<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>Mr.Lee</title>
  <subtitle>爱coding、爱运动、爱生活</subtitle>
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://leeboyue.com/"/>
  <updated>2016-03-09T06:39:21.000Z</updated>
  <id>http://leeboyue.com/</id>
  
  <author>
    <name>Bear Lee</name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>索引结构以及加锁理解</title>
    <link href="http://leeboyue.com/2016/03/08/%E7%B4%A2%E5%BC%95%E7%BB%93%E6%9E%84%E4%BB%A5%E5%8F%8A%E5%8A%A0%E9%94%81%E7%90%86%E8%A7%A3/"/>
    <id>http://leeboyue.com/2016/03/08/索引结构以及加锁理解/</id>
    <published>2016-03-08T03:14:59.000Z</published>
    <updated>2016-03-09T06:39:21.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;&amp;#x78C1;&amp;#x76D8;&amp;#x7ED3;&amp;#x6784;&quot;&gt;&amp;#x78C1;&amp;#x76D8;&amp;#x7ED3;&amp;#x6784;&lt;/h1&gt;&lt;p&gt;&amp;#x8BA1;&amp;#x7B97;&amp;#x673A;&amp;#x5B58;&amp;#x50A8;&amp;#x8BBE;&amp;#x5907;&amp;#x4E00;&amp;#x822C;&amp;#x5206;&amp;#x4E3A;&amp;#x4E24;&amp;#x79CD;&amp;#xFF1A;&amp;#x5185;&amp;#x5B58;&amp;#x50A8;&amp;#x5668;(main memory)&amp;#x548C;&amp;#x5916;&amp;#x5B58;&amp;#x50A8;&amp;#x5668;(external memory)&amp;#x3002; &amp;#x5185;&amp;#x5B58;&amp;#x5B58;&amp;#x53D6;&amp;#x901F;&amp;#x5EA6;&amp;#x5FEB;&amp;#xFF0C;&amp;#x4F46;&amp;#x5BB9;&amp;#x91CF;&amp;#x5C0F;&amp;#xFF0C;&amp;#x4EF7;&amp;#x683C;&amp;#x6602;&amp;#x8D35;&amp;#xFF0C;&amp;#x800C;&amp;#x4E14;&amp;#x4E0D;&amp;#x80FD;&amp;#x957F;&amp;#x671F;&amp;#x4FDD;&amp;#x5B58;&amp;#x6570;&amp;#x636E;(&amp;#x5728;&amp;#x4E0D;&amp;#x901A;&amp;#x7535;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0B;&amp;#x6570;&amp;#x636E;&amp;#x4F1A;&amp;#x6D88;&amp;#x5931;)&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;1-&amp;#x78C1;&amp;#x76D8;&amp;#x7684;&amp;#x6784;&amp;#x9020;&quot;&gt;1. &amp;#x78C1;&amp;#x76D8;&amp;#x7684;&amp;#x6784;&amp;#x9020;&lt;/h2&gt;&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13591471/e4a5e2ac-e523-11e5-8d1b-ac72fdaede4a.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;h2 id=&quot;2-&amp;#x78C1;&amp;#x76D8;&amp;#x8BFB;&amp;#x5199;&amp;#x539F;&amp;#x7406;&quot;&gt;2. &amp;#x78C1;&amp;#x76D8;&amp;#x8BFB;&amp;#x5199;&amp;#x539F;&amp;#x7406;&lt;/h2&gt;&lt;p&gt;&amp;#x78C1;&amp;#x76D8;&amp;#x4E0A;&amp;#x6570;&amp;#x636E;&amp;#x5FC5;&amp;#x987B;&amp;#x7528;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E09;&amp;#x7EF4;&amp;#x5730;&amp;#x5740;&amp;#x552F;&amp;#x4E00;&amp;#x6807;&amp;#x793A;&amp;#xFF1A;&amp;#x67F1;&amp;#x9762;&amp;#x53F7;&amp;#x3001;&amp;#x76D8;&amp;#x9762;&amp;#x53F7;&amp;#x3001;&amp;#x5757;&amp;#x53F7;(&amp;#x78C1;&amp;#x9053;&amp;#x4E0A;&amp;#x7684;&amp;#x76D8;&amp;#x5757;)&amp;#x3002;&lt;br&gt;&amp;#x8BBF;&amp;#x95EE;&amp;#x67D0;&amp;#x4E00;&amp;#x5177;&amp;#x4F53;&amp;#x4FE1;&amp;#x606F;&amp;#xFF0C;&amp;#x7531;3&amp;#x90E8;&amp;#x5206;&amp;#x65F6;&amp;#x95F4;&amp;#x7EC4;&amp;#x6210;&amp;#xFF1A;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#x67E5;&amp;#x627E;&amp;#x65F6;&amp;#x95F4;(seek time) Ts: &amp;#x5B8C;&amp;#x6210;&amp;#x4E0A;&amp;#x8FF0;&amp;#x6B65;&amp;#x9AA4;(1)&amp;#x6240;&amp;#x9700;&amp;#x8981;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x3002;&amp;#x8FD9;&amp;#x90E8;&amp;#x5206;&amp;#x65F6;&amp;#x95F4;&amp;#x4EE3;&amp;#x4EF7;&amp;#x6700;&amp;#x9AD8;&amp;#xFF0C;&amp;#x6700;&amp;#x5927;&amp;#x53EF;&amp;#x8FBE;&amp;#x5230;0.1s&amp;#x5DE6;&amp;#x53F3;&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x7B49;&amp;#x5F85;&amp;#x65F6;&amp;#x95F4;(latency time) Tl: &amp;#x5B8C;&amp;#x6210;&amp;#x4E0A;&amp;#x8FF0;&amp;#x6B65;&amp;#x9AA4;(3)&amp;#x6240;&amp;#x9700;&amp;#x8981;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x3002;&amp;#x7531;&amp;#x4E8E;&amp;#x76D8;&amp;#x7247;&amp;#x7ED5;&amp;#x4E3B;&amp;#x8F74;&amp;#x65CB;&amp;#x8F6C;&amp;#x901F;&amp;#x5EA6;&amp;#x5F88;&amp;#x5FEB;&amp;#xFF0C;&amp;#x4E00;&amp;#x822C;&amp;#x4E3A;7200&amp;#x8F6C;/&amp;#x5206;(&amp;#x7535;&amp;#x8111;&amp;#x786C;&amp;#x76D8;&amp;#x7684;&amp;#x6027;&amp;#x80FD;&amp;#x6307;&amp;#x6807;&amp;#x4E4B;&amp;#x4E00;, &amp;#x5BB6;&amp;#x7528;&amp;#x7684;&amp;#x666E;&amp;#x901A;&amp;#x786C;&amp;#x76D8;&amp;#x7684;&amp;#x8F6C;&amp;#x901F;&amp;#x4E00;&amp;#x822C;&amp;#x6709;5400rpm(&amp;#x7B14;&amp;#x8BB0;&amp;#x672C;)&amp;#x3001;7200rpm&amp;#x51E0;&amp;#x79CD;)&amp;#x3002;&amp;#x56E0;&amp;#x6B64;&amp;#x4E00;&amp;#x822C;&amp;#x65CB;&amp;#x8F6C;&amp;#x4E00;&amp;#x5708;&amp;#x5927;&amp;#x7EA6;0.0083s&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x4F20;&amp;#x8F93;&amp;#x65F6;&amp;#x95F4;(transmission time) Tt: &amp;#x6570;&amp;#x636E;&amp;#x901A;&amp;#x8FC7;&amp;#x7CFB;&amp;#x7EDF;&amp;#x603B;&amp;#x7EBF;&amp;#x4F20;&amp;#x9001;&amp;#x5230;&amp;#x5185;&amp;#x5B58;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x4E00;&amp;#x822C;&amp;#x4F20;&amp;#x8F93;&amp;#x4E00;&amp;#x4E2A;&amp;#x5B57;&amp;#x8282;(byte)&amp;#x5927;&amp;#x6982;0.02us=2*10^(-8)s&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x78C1;&amp;#x76D8;&amp;#x8BFB;&amp;#x53D6;&amp;#x6570;&amp;#x636E;&amp;#x662F;&amp;#x4EE5;&amp;#x76D8;&amp;#x5757;(block)&amp;#x4E3A;&amp;#x57FA;&amp;#x672C;&amp;#x5355;&amp;#x4F4D;&amp;#x7684;&amp;#x3002;&amp;#x4F4D;&amp;#x4E8E;&amp;#x540C;&amp;#x4E00;&amp;#x76D8;&amp;#x5757;&amp;#x4E2D;&amp;#x7684;&amp;#x6240;&amp;#x6709;&amp;#x6570;&amp;#x636E;&amp;#x90FD;&amp;#x80FD;&amp;#x88AB;&amp;#x4E00;&amp;#x6B21;&amp;#x6027;&amp;#x5168;&amp;#x90E8;&amp;#x8BFB;&amp;#x53D6;&amp;#x51FA;&amp;#x6765;&amp;#x3002;&amp;#x800C;&amp;#x78C1;&amp;#x76D8;IO&amp;#x4EE3;&amp;#x4EF7;&amp;#x4E3B;&amp;#x8981;&amp;#x82B1;&amp;#x8D39;&amp;#x5728;&amp;#x67E5;&amp;#x627E;&amp;#x65F6;&amp;#x95F4;Ts&amp;#x4E0A;&amp;#x3002;&amp;#x56E0;&amp;#x6B64;&amp;#x6211;&amp;#x4EEC;&amp;#x5E94;&amp;#x8BE5;&amp;#x5C3D;&amp;#x91CF;&amp;#x5C06;&amp;#x76F8;&amp;#x5173;&amp;#x4FE1;&amp;#x606F;&amp;#x5B58;&amp;#x653E;&amp;#x5728;&amp;#x540C;&amp;#x4E00;&amp;#x76D8;&amp;#x5757;&amp;#xFF0C;&amp;#x540C;&amp;#x4E00;&amp;#x78C1;&amp;#x9053;&amp;#x4E2D;&amp;#x3002;&amp;#x6216;&amp;#x8005;&amp;#x81F3;&amp;#x5C11;&amp;#x653E;&amp;#x5728;&amp;#x540C;&amp;#x4E00;&amp;#x67F1;&amp;#x9762;&amp;#x6216;&amp;#x76F8;&amp;#x90BB;&amp;#x67F1;&amp;#x9762;&amp;#x4E0A;&amp;#xFF0C;&amp;#x4EE5;&amp;#x6C42;&amp;#x5728;&amp;#x8BFB;/&amp;#x5199;&amp;#x4FE1;&amp;#x606F;&amp;#x65F6;&amp;#x5C3D;&amp;#x91CF;&amp;#x51CF;&amp;#x5C11;&amp;#x78C1;&amp;#x5934;&amp;#x6765;&amp;#x56DE;&amp;#x79FB;&amp;#x52A8;&amp;#x7684;&amp;#x6B21;&amp;#x6570;&amp;#xFF0C;&amp;#x907F;&amp;#x514D;&amp;#x8FC7;&amp;#x591A;&amp;#x7684;&amp;#x67E5;&amp;#x627E;&amp;#x65F6;&amp;#x95F4;Ts&amp;#x3002;&lt;br&gt;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x5728;&amp;#x5927;&amp;#x89C4;&amp;#x6A21;&amp;#x6570;&amp;#x636E;&amp;#x5B58;&amp;#x50A8;&amp;#x65B9;&amp;#x9762;&amp;#xFF0C;&amp;#x5927;&amp;#x91CF;&amp;#x6570;&amp;#x636E;&amp;#x5B58;&amp;#x50A8;&amp;#x5728;&amp;#x5916;&amp;#x5B58;&amp;#x78C1;&amp;#x76D8;&amp;#x4E2D;&amp;#xFF0C;&amp;#x800C;&amp;#x5728;&amp;#x5916;&amp;#x5B58;&amp;#x78C1;&amp;#x76D8;&amp;#x4E2D;&amp;#x8BFB;&amp;#x53D6;/&amp;#x5199;&amp;#x5165;&amp;#x5757;(block)&amp;#x4E2D;&amp;#x67D0;&amp;#x6570;&amp;#x636E;&amp;#x65F6;&amp;#xFF0C;&amp;#x9996;&amp;#x5148;&amp;#x9700;&amp;#x8981;&amp;#x5B9A;&amp;#x4F4D;&amp;#x5230;&amp;#x78C1;&amp;#x76D8;&amp;#x4E2D;&amp;#x7684;&amp;#x67D0;&amp;#x5757;&amp;#xFF0C;&amp;#x5982;&amp;#x4F55;&amp;#x6709;&amp;#x6548;&amp;#x5730;&amp;#x67E5;&amp;#x627E;&amp;#x78C1;&amp;#x76D8;&amp;#x4E2D;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x9700;&amp;#x8981;&amp;#x4E00;&amp;#x79CD;&amp;#x5408;&amp;#x7406;&amp;#x9AD8;&amp;#x6548;&amp;#x7684;&amp;#x5916;&amp;#x5B58;&amp;#x6570;&amp;#x636E;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x4E0B;&amp;#x9762;&amp;#x6240;&amp;#x8981;&amp;#x91CD;&amp;#x70B9;&amp;#x9610;&amp;#x8FF0;&amp;#x7684;B-tree&amp;#x7ED3;&amp;#x6784;&amp;#x3002;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&quot;btreebtree&amp;#x7EA2;&amp;#x9ED1;&amp;#x6811;&quot;&gt;Btree&amp;#x3001;B+tree&amp;#x3001;&amp;#x7EA2;&amp;#x9ED1;&amp;#x6811;&lt;/h1&gt;&lt;h2 id=&quot;btree&quot;&gt;Btree&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x9996;&amp;#x5148;&amp;#x8981;&amp;#x5F3A;&amp;#x8C03;&amp;#x4E00;&amp;#x4E0B;&amp;#xFF0C;B-tree==Btree&amp;#xFF0C;&amp;#x7279;&amp;#x6B64;&amp;#x8BF4;&amp;#x660E;&amp;#x3002;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#x76F8;&amp;#x6BD4;&amp;#x4E8C;&amp;#x53C9;&amp;#x6811;&amp;#xFF0C;Btree&amp;#x6BCF;&amp;#x4E2A;&amp;#x8282;&amp;#x70B9;&amp;#x5185;&amp;#x6709;&amp;#x591A;&amp;#x4E2A;&amp;#x5206;&amp;#x652F;&amp;#xFF0C;&amp;#x5373;&amp;#x591A;&amp;#x53C9;&amp;#x7684;&amp;#x5E73;&amp;#x8861;&amp;#x67E5;&amp;#x627E;&amp;#x6811;&amp;#x3002;Btree&amp;#x4E0E;&amp;#x7EA2;&amp;#x9ED1;&amp;#x6811;&amp;#x6700;&amp;#x5927;&amp;#x7684;&amp;#x4E0D;&amp;#x540C;&amp;#x5728;&amp;#x4E8E;&amp;#xFF0C;Btree&amp;#x8282;&amp;#x70B9;&amp;#x53EF;&amp;#x4EE5;&amp;#x6709;&amp;#x8BB8;&amp;#x591A;&amp;#x5B50;&amp;#x5973;&amp;#x3002;&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x53F6;&amp;#x7ED3;&amp;#x70B9;&amp;#x90FD;&amp;#x5904;&amp;#x4E8E;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x6DF1;&amp;#x5EA6;&amp;#xFF0C;&amp;#x5E26;&amp;#x9634;&amp;#x5F71;&amp;#x7684;&amp;#x7ED3;&amp;#x70B9;&amp;#x4E3A;&amp;#x67E5;&amp;#x627E;&amp;#x5B57;&amp;#x6BCD;R&amp;#x65F6;&amp;#x8981;&amp;#x68C0;&amp;#x67E5;&amp;#x7684;&amp;#x7ED3;&amp;#x70B9;&amp;#x3002;&lt;br&gt;&amp;#x5982;&amp;#x56FE;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x68F5;Btree&amp;#xFF0C;&amp;#x4E00;&amp;#x68F5;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x4E3A;&amp;#x82F1;&amp;#x8BED;&amp;#x4E2D;&amp;#x8F85;&amp;#x97F3;&amp;#x5B57;&amp;#x6BCD;&amp;#x7684;B&amp;#x6811;&amp;#xFF0C;&amp;#x73B0;&amp;#x5728;&amp;#x8981;&amp;#x4ECE;&amp;#x6811;&amp;#x79CD;&amp;#x67E5;&amp;#x627E;&amp;#x5B57;&amp;#x6BCD;R&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13593557/3d5f9254-e537-11e5-9f3f-e4da40ab9ded.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;&amp;#x4E00;&amp;#x68F5;m&amp;#x9636;&amp;#x7684;Btree&amp;#x6EE1;&amp;#x8DB3;&amp;#x4EE5;&amp;#x4E0B;&amp;#x6761;&amp;#x4EF6;&amp;#xFF1A;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6BCF;&amp;#x4E2A;&amp;#x8282;&amp;#x70B9;&amp;#x81F3;&amp;#x591A;&amp;#x6709;m&amp;#x68F5;&amp;#x5B50;&amp;#x6811;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x9664;&amp;#x6839;&amp;#x8282;&amp;#x70B9;&amp;#x5916;&amp;#xFF0C;&amp;#x5176;&amp;#x5B83;&amp;#x6BCF;&amp;#x4E2A;&amp;#x5206;&amp;#x652F;&amp;#x8282;&amp;#x70B9;&amp;#x81F3;&amp;#x5C11;&amp;#x6709;m/2&amp;#x68F5;&amp;#x5B50;&amp;#x6811;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6839;&amp;#x8282;&amp;#x70B9;&amp;#x81F3;&amp;#x5C11;&amp;#x6709;&amp;#x4E24;&amp;#x68F5;&amp;#x5B50;&amp;#x6811;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6240;&amp;#x6709;&amp;#x53F6;&amp;#x8282;&amp;#x70B9;&amp;#x5728;&amp;#x540C;&amp;#x4E00;&amp;#x5C42;&amp;#x4E0A;&amp;#x3002;Btree&amp;#x7684;&amp;#x53F6;&amp;#x5B50;&amp;#x8282;&amp;#x70B9;&amp;#x53EF;&amp;#x4EE5;&amp;#x770B;&amp;#x6210;&amp;#x4E00;&amp;#x79CD;&amp;#x5916;&amp;#x90E8;&amp;#x8282;&amp;#x70B9;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5305;&amp;#x542B;&amp;#x4EFB;&amp;#x4F55;&amp;#x4FE1;&amp;#x606F;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6709;j&amp;#x4E2A;&amp;#x5B69;&amp;#x5B50;&amp;#x7684;&amp;#x975E;&amp;#x53F6;&amp;#x8282;&amp;#x70B9;&amp;#x6070;&amp;#x597D;&amp;#x6709;j-1&amp;#x4E2A;&amp;#x5173;&amp;#x952E;&amp;#x7801;&amp;#xFF0C;&amp;#x5173;&amp;#x952E;&amp;#x7801;&amp;#x6309;&amp;#x9012;&amp;#x589E;&amp;#x6B21;&amp;#x5E8F;&amp;#x6392;&amp;#x5217;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;#x6811;&amp;#x4E2D;&amp;#x7684;&amp;#x6BCF;&amp;#x4E2A;&amp;#x7ED3;&amp;#x70B9;&amp;#x6839;&amp;#x636E;&amp;#x5B9E;&amp;#x9645;&amp;#x60C5;&amp;#x51B5;&amp;#x53EF;&amp;#x4EE5;&amp;#x5305;&amp;#x542B;&amp;#x5927;&amp;#x91CF;&amp;#x7684;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x4FE1;&amp;#x606F;&amp;#x548C;&amp;#x5206;&amp;#x652F;(&amp;#x5F53;&amp;#x7136;&amp;#x662F;&amp;#x4E0D;&amp;#x80FD;&amp;#x8D85;&amp;#x8FC7;&amp;#x78C1;&amp;#x76D8;&amp;#x5757;&amp;#x7684;&amp;#x5927;&amp;#x5C0F;&amp;#xFF0C;&amp;#x6839;&amp;#x636E;&amp;#x78C1;&amp;#x76D8;&amp;#x9A71;&amp;#x52A8;(disk drives)&amp;#x7684;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C;&amp;#x4E00;&amp;#x822C;&amp;#x5757;&amp;#x7684;&amp;#x5927;&amp;#x5C0F;&amp;#x5728;1k~4k&amp;#x5DE6;&amp;#x53F3;)&amp;#xFF1B;&amp;#x8FD9;&amp;#x6837;&amp;#x6811;&amp;#x7684;&amp;#x6DF1;&amp;#x5EA6;&amp;#x964D;&amp;#x4F4E;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x5C31;&amp;#x610F;&amp;#x5473;&amp;#x7740;&amp;#x67E5;&amp;#x627E;&amp;#x4E00;&amp;#x4E2A;&amp;#x5143;&amp;#x7D20;&amp;#x53EA;&amp;#x8981;&amp;#x5F88;&amp;#x5C11;&amp;#x7ED3;&amp;#x70B9;&amp;#x4ECE;&amp;#x5916;&amp;#x5B58;&amp;#x78C1;&amp;#x76D8;&amp;#x4E2D;&amp;#x8BFB;&amp;#x5165;&amp;#x5185;&amp;#x5B58;&amp;#xFF0C;&amp;#x5F88;&amp;#x5FEB;&amp;#x8BBF;&amp;#x95EE;&amp;#x5230;&amp;#x8981;&amp;#x67E5;&amp;#x627E;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x3002;&amp;#x53EF;&amp;#x4EE5;&amp;#x6309;&amp;#x4E0B;&amp;#x56FE;&amp;#x7406;&amp;#x89E3;&amp;#xFF1A;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13593784/72c8c94a-e539-11e5-8e91-6f645f806fcb.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;&amp;#x4E0B;&amp;#x9762;&amp;#xFF0C;&amp;#x54B1;&amp;#x4EEC;&amp;#x6765;&amp;#x6A21;&amp;#x62DF;&amp;#x4E0B;&amp;#x67E5;&amp;#x627E;&amp;#x6587;&amp;#x4EF6;29&amp;#x7684;&amp;#x8FC7;&amp;#x7A0B;&amp;#xFF1A;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6839;&amp;#x636E;&amp;#x6839;&amp;#x7ED3;&amp;#x70B9;&amp;#x6307;&amp;#x9488;&amp;#x627E;&amp;#x5230;&amp;#x6587;&amp;#x4EF6;&amp;#x76EE;&amp;#x5F55;&amp;#x7684;&amp;#x6839;&amp;#x78C1;&amp;#x76D8;&amp;#x5757;1&amp;#xFF0C;&amp;#x5C06;&amp;#x5176;&amp;#x4E2D;&amp;#x7684;&amp;#x4FE1;&amp;#x606F;&amp;#x5BFC;&amp;#x5165;&amp;#x5185;&amp;#x5B58;&amp;#x3002;&amp;#x3010;&amp;#x78C1;&amp;#x76D8;IO&amp;#x64CD;&amp;#x4F5C; 1&amp;#x6B21;&amp;#x3011;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6B64;&amp;#x65F6;&amp;#x5185;&amp;#x5B58;&amp;#x4E2D;&amp;#x6709;&amp;#x4E24;&amp;#x4E2A;&amp;#x6587;&amp;#x4EF6;&amp;#x540D;17&amp;#x3001;35&amp;#x548C;&amp;#x4E09;&amp;#x4E2A;&amp;#x5B58;&amp;#x50A8;&amp;#x5176;&amp;#x4ED6;&amp;#x78C1;&amp;#x76D8;&amp;#x9875;&amp;#x9762;&amp;#x5730;&amp;#x5740;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x3002;&amp;#x6839;&amp;#x636E;&amp;#x7B97;&amp;#x6CD5;&amp;#x6211;&amp;#x4EEC;&amp;#x53D1;&amp;#x73B0;&amp;#xFF1A;17&amp;lt;29&amp;lt;35&amp;#xFF0C;&amp;#x56E0;&amp;#x6B64;&amp;#x6211;&amp;#x4EEC;&amp;#x627E;&amp;#x5230;&amp;#x6307;&amp;#x9488;p2&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6839;&amp;#x636E;p2&amp;#x6307;&amp;#x9488;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5B9A;&amp;#x4F4D;&amp;#x5230;&amp;#x78C1;&amp;#x76D8;&amp;#x5757;3&amp;#xFF0C;&amp;#x5E76;&amp;#x5C06;&amp;#x5176;&amp;#x4E2D;&amp;#x7684;&amp;#x4FE1;&amp;#x606F;&amp;#x5BFC;&amp;#x5165;&amp;#x5185;&amp;#x5B58;&amp;#x3002;&amp;#x3010;&amp;#x78C1;&amp;#x76D8;IO&amp;#x64CD;&amp;#x4F5C; 2&amp;#x6B21;&amp;#x3011;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6B64;&amp;#x65F6;&amp;#x5185;&amp;#x5B58;&amp;#x4E2D;&amp;#x6709;&amp;#x4E24;&amp;#x4E2A;&amp;#x6587;&amp;#x4EF6;&amp;#x540D;26&amp;#xFF0C;30&amp;#x548C;&amp;#x4E09;&amp;#x4E2A;&amp;#x5B58;&amp;#x50A8;&amp;#x5176;&amp;#x4ED6;&amp;#x78C1;&amp;#x76D8;&amp;#x9875;&amp;#x9762;&amp;#x5730;&amp;#x5740;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x3002;&amp;#x6839;&amp;#x636E;&amp;#x7B97;&amp;#x6CD5;&amp;#x6211;&amp;#x4EEC;&amp;#x53D1;&amp;#x73B0;&amp;#xFF1A;26&amp;lt;29&amp;lt;30&amp;#xFF0C;&amp;#x56E0;&amp;#x6B64;&amp;#x6211;&amp;#x4EEC;&amp;#x627E;&amp;#x5230;&amp;#x6307;&amp;#x9488;p2&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6839;&amp;#x636E;p2&amp;#x6307;&amp;#x9488;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x5B9A;&amp;#x4F4D;&amp;#x5230;&amp;#x78C1;&amp;#x76D8;&amp;#x5757;8&amp;#xFF0C;&amp;#x5E76;&amp;#x5C06;&amp;#x5176;&amp;#x4E2D;&amp;#x7684;&amp;#x4FE1;&amp;#x606F;&amp;#x5BFC;&amp;#x5165;&amp;#x5185;&amp;#x5B58;&amp;#x3002;&amp;#x3010;&amp;#x78C1;&amp;#x76D8;IO&amp;#x64CD;&amp;#x4F5C; 3&amp;#x6B21;&amp;#x3011;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6B64;&amp;#x65F6;&amp;#x5185;&amp;#x5B58;&amp;#x4E2D;&amp;#x6709;&amp;#x4E24;&amp;#x4E2A;&amp;#x6587;&amp;#x4EF6;&amp;#x540D;28&amp;#xFF0C;29&amp;#x3002;&amp;#x6839;&amp;#x636E;&amp;#x7B97;&amp;#x6CD5;&amp;#x6211;&amp;#x4EEC;&amp;#x67E5;&amp;#x627E;&amp;#x5230;&amp;#x6587;&amp;#x4EF6;&amp;#x540D;29&amp;#xFF0C;&amp;#x5E76;&amp;#x5B9A;&amp;#x4F4D;&amp;#x4E86;&amp;#x8BE5;&amp;#x6587;&amp;#x4EF6;&amp;#x5185;&amp;#x5B58;&amp;#x7684;&amp;#x78C1;&amp;#x76D8;&amp;#x5730;&amp;#x5740;&amp;#x3002;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x5206;&amp;#x6790;&amp;#x4E0A;&amp;#x9762;&amp;#x7684;&amp;#x8FC7;&amp;#x7A0B;&amp;#xFF0C;&amp;#x53D1;&amp;#x73B0;&amp;#x9700;&amp;#x8981;3&amp;#x6B21;&amp;#x78C1;&amp;#x76D8;IO&amp;#x64CD;&amp;#x4F5C;&amp;#x548C;3&amp;#x6B21;&amp;#x5185;&amp;#x5B58;&amp;#x67E5;&amp;#x627E;&amp;#x64CD;&amp;#x4F5C;&amp;#x3002;&amp;#x5173;&amp;#x4E8E;&amp;#x5185;&amp;#x5B58;&amp;#x4E2D;&amp;#x7684;&amp;#x6587;&amp;#x4EF6;&amp;#x540D;&amp;#x67E5;&amp;#x627E;&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x6709;&amp;#x5E8F;&amp;#x8868;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x5229;&amp;#x7528;&amp;#x6298;&amp;#x534A;&amp;#x67E5;&amp;#x627E;&amp;#x63D0;&amp;#x9AD8;&amp;#x6548;&amp;#x7387;&amp;#x3002;&amp;#x81F3;&amp;#x4E8E;IO&amp;#x64CD;&amp;#x4F5C;&amp;#x662F;&amp;#x5F71;&amp;#x54CD;&amp;#x6574;&amp;#x4E2A;B&amp;#x6811;&amp;#x67E5;&amp;#x627E;&amp;#x6548;&amp;#x7387;&amp;#x7684;&amp;#x51B3;&amp;#x5B9A;&amp;#x56E0;&amp;#x7D20;&amp;#x3002;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Btree&amp;#x7684;CRUD&amp;#x65F6;&amp;#x95F4;&amp;#x590D;&amp;#x6742;&amp;#x5EA6;&amp;#xFF1A;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13591824/49c3ba44-e527-11e5-8639-032ecdd4c00e.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;&amp;#x53EF;&amp;#x4EE5;&amp;#x770B;&amp;#x51FA;&amp;#x6765;&amp;#xFF0C;Btree&amp;#x7684;&amp;#x6240;&amp;#x6709;&amp;#x6570;&amp;#x636E;&amp;#x90FD;&amp;#x662F;&amp;#x653E;&amp;#x5728;&amp;#x4E0D;&amp;#x540C;&amp;#x78C1;&amp;#x76D8;&amp;#x5757;&amp;#x4E0A;&amp;#x7684;&lt;/p&gt;
&lt;p&gt;Btree&amp;#x5177;&amp;#x4F53;&amp;#x5B9E;&amp;#x6218;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x4E0B;&amp;#x9762;&amp;#x54B1;&amp;#x4EEC;&amp;#x901A;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E2A;&amp;#x5B9E;&amp;#x4F8B;&amp;#x6765;&amp;#x9010;&amp;#x6B65;&amp;#x8BB2;&amp;#x89E3;&amp;#x4E0B;&amp;#x3002;&amp;#x63D2;&amp;#x5165;&amp;#x4EE5;&amp;#x4E0B;&amp;#x5B57;&amp;#x7B26;&amp;#x5B57;&amp;#x6BCD;&amp;#x5230;&amp;#x4E00;&amp;#x68F5;&amp;#x7A7A;&amp;#x7684;B &amp;#x6811;&amp;#x4E2D;&amp;#xFF08;&amp;#x975E;&amp;#x6839;&amp;#x7ED3;&amp;#x70B9;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x6570;&amp;#x5C0F;&amp;#x4E86;&amp;#xFF08;&amp;#x5C0F;&amp;#x4E8E;2&amp;#x4E2A;&amp;#xFF09;&amp;#x5C31;&amp;#x5408;&amp;#x5E76;&amp;#xFF0C;&amp;#x5927;&amp;#x4E86;&amp;#xFF08;&amp;#x8D85;&amp;#x8FC7;4&amp;#x4E2A;&amp;#xFF09;&amp;#x5C31;&amp;#x5206;&amp;#x88C2;&amp;#xFF09;&amp;#xFF1A;C N G A H E K Q M F W L T Z D P R X Y S&amp;#xFF0C;&amp;#x9996;&amp;#x5148;&amp;#xFF0C;&amp;#x7ED3;&amp;#x70B9;&amp;#x7A7A;&amp;#x95F4;&amp;#x8DB3;&amp;#x591F;&amp;#xFF0C;4&amp;#x4E2A;&amp;#x5B57;&amp;#x6BCD;&amp;#x63D2;&amp;#x5165;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x7ED3;&amp;#x70B9;&amp;#x4E2D;&amp;#xFF0C;&amp;#x5982;&amp;#x4E0B;&amp;#x56FE;&amp;#xFF1A;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13595987/7035bfe2-e54a-11e5-8bc6-fa741a053b07.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x5F53;&amp;#x54B1;&amp;#x4EEC;&amp;#x8BD5;&amp;#x7740;&amp;#x63D2;&amp;#x5165;H&amp;#x65F6;&amp;#xFF0C;&amp;#x7ED3;&amp;#x70B9;&amp;#x53D1;&amp;#x73B0;&amp;#x7A7A;&amp;#x95F4;&amp;#x4E0D;&amp;#x591F;&amp;#xFF0C;&amp;#x4EE5;&amp;#x81F4;&amp;#x5C06;&amp;#x5176;&amp;#x5206;&amp;#x88C2;&amp;#x6210;2&amp;#x4E2A;&amp;#x7ED3;&amp;#x70B9;&amp;#xFF0C;&amp;#x79FB;&amp;#x52A8;&amp;#x4E2D;&amp;#x95F4;&amp;#x5143;&amp;#x7D20;G&amp;#x4E0A;&amp;#x79FB;&amp;#x5230;&amp;#x65B0;&amp;#x7684;&amp;#x6839;&amp;#x7ED3;&amp;#x70B9;&amp;#x4E2D;&amp;#xFF0C;&amp;#x5728;&amp;#x5B9E;&amp;#x73B0;&amp;#x8FC7;&amp;#x7A0B;&amp;#x4E2D;&amp;#xFF0C;&amp;#x54B1;&amp;#x4EEC;&amp;#x628A;A&amp;#x548C;C&amp;#x7559;&amp;#x5728;&amp;#x5F53;&amp;#x524D;&amp;#x7ED3;&amp;#x70B9;&amp;#x4E2D;&amp;#xFF0C;&amp;#x800C;H&amp;#x548C;N&amp;#x653E;&amp;#x7F6E;&amp;#x65B0;&amp;#x7684;&amp;#x5176;&amp;#x53F3;&amp;#x90BB;&amp;#x5C45;&amp;#x7ED3;&amp;#x70B9;&amp;#x4E2D;&amp;#x3002;&amp;#x5982;&amp;#x4E0B;&amp;#x56FE;&amp;#xFF1A;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13595997/7a563ea2-e54a-11e5-80da-f916a0d38f0b.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x5F53;&amp;#x54B1;&amp;#x4EEC;&amp;#x63D2;&amp;#x5165;E,K,Q&amp;#x65F6;&amp;#xFF0C;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x4EFB;&amp;#x4F55;&amp;#x5206;&amp;#x88C2;&amp;#x64CD;&amp;#x4F5C;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596000/81d24ef0-e54a-11e5-90e8-681cb0fbcfef.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x63D2;&amp;#x5165;M&amp;#x9700;&amp;#x8981;&amp;#x4E00;&amp;#x6B21;&amp;#x5206;&amp;#x88C2;&amp;#xFF0C;&amp;#x6CE8;&amp;#x610F;M&amp;#x6070;&amp;#x597D;&amp;#x662F;&amp;#x4E2D;&amp;#x95F4;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x4EE5;&amp;#x81F4;&amp;#x5411;&amp;#x4E0A;&amp;#x79FB;&amp;#x5230;&amp;#x7236;&amp;#x8282;&amp;#x70B9;&amp;#x4E2D;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596011/91d0fc5c-e54a-11e5-9fa0-7fd8ef66c020.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x63D2;&amp;#x5165;F,W,L,T&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x4EFB;&amp;#x4F55;&amp;#x5206;&amp;#x88C2;&amp;#x64CD;&amp;#x4F5C;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596017/9d019d3e-e54a-11e5-9d9e-ea9a10220bba.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x63D2;&amp;#x5165;Z&amp;#x65F6;&amp;#xFF0C;&amp;#x6700;&amp;#x53F3;&amp;#x7684;&amp;#x53F6;&amp;#x5B50;&amp;#x7ED3;&amp;#x70B9;&amp;#x7A7A;&amp;#x95F4;&amp;#x6EE1;&amp;#x4E86;&amp;#xFF0C;&amp;#x9700;&amp;#x8981;&amp;#x8FDB;&amp;#x884C;&amp;#x5206;&amp;#x88C2;&amp;#x64CD;&amp;#x4F5C;&amp;#xFF0C;&amp;#x4E2D;&amp;#x95F4;&amp;#x5143;&amp;#x7D20;T&amp;#x4E0A;&amp;#x79FB;&amp;#x5230;&amp;#x7236;&amp;#x8282;&amp;#x70B9;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6CE8;&amp;#x610F;&amp;#x901A;&amp;#x8FC7;&amp;#x4E0A;&amp;#x79FB;&amp;#x4E2D;&amp;#x95F4;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x6811;&amp;#x6700;&amp;#x7EC8;&amp;#x8FD8;&amp;#x662F;&amp;#x4FDD;&amp;#x6301;&amp;#x5E73;&amp;#x8861;&amp;#xFF0C;&amp;#x5206;&amp;#x88C2;&amp;#x7ED3;&amp;#x679C;&amp;#x7684;&amp;#x7ED3;&amp;#x70B9;&amp;#x5B58;&amp;#x5728;2&amp;#x4E2A;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x5143;&amp;#x7D20;&amp;#x3002;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596020/a365eb12-e54a-11e5-922c-72399fe6503c.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x63D2;&amp;#x5165;D&amp;#x65F6;&amp;#xFF0C;&amp;#x5BFC;&amp;#x81F4;&amp;#x6700;&amp;#x5DE6;&amp;#x8FB9;&amp;#x7684;&amp;#x53F6;&amp;#x5B50;&amp;#x7ED3;&amp;#x70B9;&amp;#x88AB;&amp;#x5206;&amp;#x88C2;&amp;#xFF0C;D&amp;#x6070;&amp;#x597D;&amp;#x4E5F;&amp;#x662F;&amp;#x4E2D;&amp;#x95F4;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x4E0A;&amp;#x79FB;&amp;#x5230;&amp;#x7236;&amp;#x8282;&amp;#x70B9;&amp;#x4E2D;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x5B57;&amp;#x6BCD;P,R,X,Y&amp;#x9646;&amp;#x7EED;&amp;#x63D2;&amp;#x5165;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x4EFB;&amp;#x4F55;&amp;#x5206;&amp;#x88C2;&amp;#x64CD;&amp;#x4F5C;&amp;#xFF08;&amp;#x522B;&amp;#x5FD8;&amp;#x4E86;&amp;#xFF0C;&amp;#x6811;&amp;#x4E2D;&amp;#x81F3;&amp;#x591A;5&amp;#x4E2A;&amp;#x5B69;&amp;#x5B50;&amp;#xFF09;&amp;#x3002;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596023/aa9d92b8-e54a-11e5-8f2c-98ca93c5b957.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x6700;&amp;#x540E;&amp;#xFF0C;&amp;#x5F53;&amp;#x63D2;&amp;#x5165;S&amp;#x65F6;&amp;#xFF0C;&amp;#x542B;&amp;#x6709;N,P,Q,R&amp;#x7684;&amp;#x7ED3;&amp;#x70B9;&amp;#x9700;&amp;#x8981;&amp;#x5206;&amp;#x88C2;&amp;#xFF0C;&amp;#x628A;&amp;#x4E2D;&amp;#x95F4;&amp;#x5143;&amp;#x7D20;Q&amp;#x4E0A;&amp;#x79FB;&amp;#x5230;&amp;#x7236;&amp;#x8282;&amp;#x70B9;&amp;#x4E2D;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x60C5;&amp;#x51B5;&amp;#x6765;&amp;#x4E86;&amp;#xFF0C;&amp;#x7236;&amp;#x8282;&amp;#x70B9;&amp;#x4E2D;&amp;#x7A7A;&amp;#x95F4;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6EE1;&amp;#x4E86;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x4E5F;&amp;#x8981;&amp;#x8FDB;&amp;#x884C;&amp;#x5206;&amp;#x88C2;&amp;#xFF0C;&amp;#x5C06;&amp;#x7236;&amp;#x8282;&amp;#x70B9;&amp;#x4E2D;&amp;#x7684;&amp;#x4E2D;&amp;#x95F4;&amp;#x5143;&amp;#x7D20;M&amp;#x4E0A;&amp;#x79FB;&amp;#x5230;&amp;#x65B0;&amp;#x5F62;&amp;#x6210;&amp;#x7684;&amp;#x6839;&amp;#x7ED3;&amp;#x70B9;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6CE8;&amp;#x610F;&amp;#x4EE5;&amp;#x524D;&amp;#x5728;&amp;#x7236;&amp;#x8282;&amp;#x70B9;&amp;#x4E2D;&amp;#x7684;&amp;#x7B2C;&amp;#x4E09;&amp;#x4E2A;&amp;#x6307;&amp;#x9488;&amp;#x5728;&amp;#x4FEE;&amp;#x6539;&amp;#x540E;&amp;#x5305;&amp;#x62EC;D&amp;#x548C;G&amp;#x8282;&amp;#x70B9;&amp;#x4E2D;&amp;#x3002;&amp;#x8FD9;&amp;#x6837;&amp;#x5177;&amp;#x4F53;&amp;#x63D2;&amp;#x5165;&amp;#x64CD;&amp;#x4F5C;&amp;#x7684;&amp;#x5B8C;&amp;#x6210;&amp;#xFF0C;&amp;#x4E0B;&amp;#x9762;&amp;#x4ECB;&amp;#x7ECD;&amp;#x5220;&amp;#x9664;&amp;#x64CD;&amp;#x4F5C;&amp;#xFF0C;&amp;#x5220;&amp;#x9664;&amp;#x64CD;&amp;#x4F5C;&amp;#x76F8;&amp;#x5BF9;&amp;#x4E8E;&amp;#x63D2;&amp;#x5165;&amp;#x64CD;&amp;#x4F5C;&amp;#x8981;&amp;#x8003;&amp;#x8651;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#x591A;&amp;#x70B9;&amp;#x3002;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596028/b51fc3fa-e54a-11e5-9bb6-96cb2f34d89b.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;h2 id=&quot;btree&quot;&gt;B+tree&lt;/h2&gt;&lt;p&gt;&amp;#x4F20;&amp;#x7EDF;&amp;#x5173;&amp;#x7CFB;&amp;#x578B;&amp;#x6570;&amp;#x636E;&amp;#x5E93;(Oracle/MySQL/PostgreSQL&amp;#x2026;)&amp;#xFF0C;&amp;#x5176;&amp;#x4E3B;&amp;#x8981;&amp;#x7684;&amp;#x7D22;&amp;#x5F15;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x90FD;&amp;#x662F;B+&amp;#x6811;&amp;#x3002;&amp;#x66F4;&amp;#x6709;&amp;#x751A;&amp;#x8005;&amp;#xFF0C;InnoDB&amp;#x5F15;&amp;#x64CE;&amp;#x7684;&amp;#x8868;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x6574;&amp;#x4E2A;&amp;#x90FD;&amp;#x662F;&amp;#x4EE5;B+&amp;#x6811;&amp;#x7684;&amp;#x7EC4;&amp;#x7EC7;&amp;#x5F62;&amp;#x5F0F;&amp;#x5B58;&amp;#x653E;&amp;#x7684;&amp;#x3002;&amp;#x4E0B;&amp;#x56FE;&amp;#xFF0C;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x7ECF;&amp;#x5178;&amp;#x7684;B+&amp;#x6811;&amp;#x7EC4;&amp;#x7EC7;&amp;#x7ED3;&amp;#x6784;&amp;#x56FE;(2&amp;#x5C42;B+&amp;#x6811;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x9875;&amp;#x9762;&amp;#x7684;&amp;#x6247;&amp;#x51FA;&amp;#x4E3A;4)&amp;#xFF1A;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13593934/02085ce6-e53b-11e5-934f-a5da5bd35fc5.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;&amp;#x6CE8;&amp;#x610F;&amp;#xFF1A;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6B64;B+&amp;#x6811;&amp;#xFF0C;&amp;#x4EE5;InnoDB&amp;#x5B9E;&amp;#x73B0;&amp;#x7684;B+&amp;#x6811;&amp;#x7ED3;&amp;#x6784;&amp;#x4E3A;&amp;#x51C6;&amp;#xFF1B;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x6B64;B+&amp;#x6811;&amp;#xFF0C;&amp;#x6709;5&amp;#x6761;&amp;#x7528;&amp;#x6237;&amp;#x8BB0;&amp;#x5F55;&amp;#xFF0C;&amp;#x5206;&amp;#x522B;&amp;#x662F;1&amp;#xFF0C;2&amp;#xFF0C;3&amp;#xFF0C;4&amp;#xFF0C;5&amp;#xFF1B;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;B+&amp;#x6811;&amp;#x4E0A;&amp;#x5C42;&amp;#x9875;&amp;#x9762;&amp;#x4E2D;&amp;#x7684;&amp;#x8BB0;&amp;#x5F55;&amp;#xFF0C;&amp;#x5B58;&amp;#x50A8;&amp;#x7684;&amp;#x662F;&amp;#x4E0B;&amp;#x5C42;&amp;#x9875;&amp;#x9762;&amp;#x4E2D;&amp;#x7684;&amp;#x6700;&amp;#x5C0F;&amp;#x503C;(Low Key)&amp;#xFF1B;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;B+&amp;#x6811;&amp;#x7684;&amp;#x6240;&amp;#x6709;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x5747;&amp;#x5B58;&amp;#x50A8;&amp;#x5728;B+&amp;#x6811;&amp;#x7684;&amp;#x53F6;&amp;#x8282;&amp;#x70B9;&amp;#xFF1B;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;B+&amp;#x6811;&amp;#x53F6;&amp;#x8282;&amp;#x70B9;&amp;#x7684;&amp;#x6240;&amp;#x6709;&amp;#x9875;&amp;#x9762;&amp;#xFF0C;&amp;#x901A;&amp;#x8FC7;&amp;#x53CC;&amp;#x5411;&amp;#x94FE;&amp;#x8868;&amp;#x94FE;&amp;#x63A5;&amp;#x8D77;&amp;#x6765;&amp;#xFF1B;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13595425/27263a92-e546-11e5-80e4-59abb289d326.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8BF4;B+tree&amp;#x6811;&amp;#x66F4;&amp;#x9002;&amp;#x5408;&amp;#x5B9E;&amp;#x9645;&amp;#x5E94;&amp;#x7528;&amp;#x4E2D;&amp;#x64CD;&amp;#x4F5C;&amp;#x7CFB;&amp;#x7EDF;&amp;#x7684;&amp;#x6587;&amp;#x4EF6;&amp;#x7D22;&amp;#x5F15;&amp;#x548C;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#x7D22;&amp;#x5F15;&amp;#xFF1F;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;B+tree&amp;#x7684;&amp;#x78C1;&amp;#x76D8;&amp;#x8BFB;&amp;#x5199;&amp;#x4EE3;&amp;#x4EF7;&amp;#x66F4;&amp;#x4F4E;&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;B+tree&amp;#x5185;&amp;#x90E8;&amp;#x8282;&amp;#x70B9;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x6307;&amp;#x5411;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x5177;&amp;#x4F53;&amp;#x4FE1;&amp;#x606F;&amp;#x7684;&amp;#x6307;&amp;#x9488;&amp;#x3002;&amp;#x56E0;&amp;#x6B64;&amp;#x5176;&amp;#x4E2D;&amp;#x5185;&amp;#x90E8;&amp;#x8282;&amp;#x70B9;&amp;#x76F8;&amp;#x5BF9;Btree&amp;#x66F4;&amp;#x5C0F;&amp;#x3002;&amp;#x5982;&amp;#x679C;&amp;#x628A;&amp;#x6240;&amp;#x6709;&amp;#x540C;&amp;#x4E00;&amp;#x5185;&amp;#x90E8;&amp;#x8282;&amp;#x70B9;&amp;#x7684;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x5B58;&amp;#x653E;&amp;#x5728;&amp;#x540C;&amp;#x4E00;&amp;#x4E2A;&amp;#x78C1;&amp;#x76D8;&amp;#x5757;&amp;#x4E2D;&amp;#xFF0C;&amp;#x90A3;&amp;#x4E48;&amp;#x78C1;&amp;#x76D8;&amp;#x5757;&amp;#x6240;&amp;#x80FD;&amp;#x5BB9;&amp;#x7EB3;&amp;#x7684;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x6570;&amp;#x91CF;&amp;#x4E5F;&amp;#x8D8A;&amp;#x591A;&amp;#x3002;&amp;#x4E00;&amp;#x6B21;&amp;#x6027;&amp;#x8BFB;&amp;#x5165;&amp;#x5185;&amp;#x5B58;&amp;#x4E2D;&amp;#x7684;&amp;#x9700;&amp;#x8981;&amp;#x67E5;&amp;#x627E;&amp;#x7684;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x4E5F;&amp;#x5C31;&amp;#x8D8A;&amp;#x591A;&amp;#x3002;&amp;#x60F3;&amp;#x591A;&amp;#x6765;&amp;#x8BF4;IO&amp;#x8BFB;&amp;#x5199;&amp;#x6B21;&amp;#x6570;&amp;#x4E5F;&amp;#x5C31;&amp;#x964D;&amp;#x4F4E;&amp;#x4E86;&amp;#x3002;&lt;br&gt;&amp;#x4E3E;&amp;#x4E2A;&amp;#x4F8B;&amp;#x5B50;&amp;#xFF0C;&amp;#x5047;&amp;#x8BBE;&amp;#x78C1;&amp;#x76D8;&amp;#x4E2D;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x76D8;&amp;#x5757;&amp;#x5BB9;&amp;#x7EB3;16bytes&amp;#xFF0C;&amp;#x800C;&amp;#x4E00;&amp;#x4E2A;&amp;#x5173;&amp;#x952E;&amp;#x5B57;2bytes&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x5177;&amp;#x4F53;&amp;#x4FE1;&amp;#x606F;&amp;#x6307;&amp;#x9488;2bytes&amp;#x3002;&amp;#x4E00;&amp;#x68F5;9&amp;#x9636;B-tree(&amp;#x4E00;&amp;#x4E2A;&amp;#x7ED3;&amp;#x70B9;&amp;#x6700;&amp;#x591A;8&amp;#x4E2A;&amp;#x5173;&amp;#x952E;&amp;#x5B57;)&amp;#x7684;&amp;#x5185;&amp;#x90E8;&amp;#x7ED3;&amp;#x70B9;&amp;#x9700;&amp;#x8981;2&amp;#x4E2A;&amp;#x76D8;&amp;#x5FEB;&amp;#x3002;&amp;#x800C;B+ &amp;#x6811;&amp;#x5185;&amp;#x90E8;&amp;#x7ED3;&amp;#x70B9;&amp;#x53EA;&amp;#x9700;&amp;#x8981;1&amp;#x4E2A;&amp;#x76D8;&amp;#x5FEB;&amp;#x3002;&amp;#x5F53;&amp;#x9700;&amp;#x8981;&amp;#x628A;&amp;#x5185;&amp;#x90E8;&amp;#x7ED3;&amp;#x70B9;&amp;#x8BFB;&amp;#x5165;&amp;#x5185;&amp;#x5B58;&amp;#x4E2D;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;B &amp;#x6811;&amp;#x5C31;&amp;#x6BD4;B+ &amp;#x6811;&amp;#x591A;&amp;#x4E00;&amp;#x6B21;&amp;#x76D8;&amp;#x5757;&amp;#x67E5;&amp;#x627E;&amp;#x65F6;&amp;#x95F4;(&amp;#x5728;&amp;#x78C1;&amp;#x76D8;&amp;#x4E2D;&amp;#x5C31;&amp;#x662F;&amp;#x76D8;&amp;#x7247;&amp;#x65CB;&amp;#x8F6C;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;)&amp;#x3002;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;B+tree&amp;#x67E5;&amp;#x8BE2;&amp;#x6548;&amp;#x7387;&amp;#x66F4;&amp;#x7A33;&amp;#x5B9A;&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x7531;&amp;#x4E8E;&amp;#x975E;&amp;#x7EC8;&amp;#x7ED3;&amp;#x70B9;&amp;#x5E76;&amp;#x4E0D;&amp;#x662F;&amp;#x6700;&amp;#x7EC8;&amp;#x6307;&amp;#x5411;&amp;#x6587;&amp;#x4EF6;&amp;#x5185;&amp;#x5BB9;&amp;#x7684;&amp;#x7ED3;&amp;#x70B9;&amp;#xFF0C;&amp;#x800C;&amp;#x53EA;&amp;#x662F;&amp;#x53F6;&amp;#x5B50;&amp;#x7ED3;&amp;#x70B9;&amp;#x4E2D;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x7684;&amp;#x7D22;&amp;#x5F15;&amp;#x3002;&amp;#x6240;&amp;#x4EE5;&amp;#x4EFB;&amp;#x4F55;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x7684;&amp;#x67E5;&amp;#x627E;&amp;#x5FC5;&amp;#x987B;&amp;#x8D70;&amp;#x4E00;&amp;#x6761;&amp;#x4ECE;&amp;#x6839;&amp;#x7ED3;&amp;#x70B9;&amp;#x5230;&amp;#x53F6;&amp;#x5B50;&amp;#x7ED3;&amp;#x70B9;&amp;#x7684;&amp;#x8DEF;&amp;#x3002;&amp;#x6240;&amp;#x6709;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#x67E5;&amp;#x8BE2;&amp;#x7684;&amp;#x8DEF;&amp;#x5F84;&amp;#x957F;&amp;#x5EA6;&amp;#x76F8;&amp;#x540C;&amp;#xFF0C;&amp;#x5BFC;&amp;#x81F4;&amp;#x6BCF;&amp;#x4E00;&amp;#x4E2A;&amp;#x6570;&amp;#x636E;&amp;#x7684;&amp;#x67E5;&amp;#x8BE2;&amp;#x6548;&amp;#x7387;&amp;#x76F8;&amp;#x5F53;&amp;#x3002;&lt;br&gt;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#x7D22;&amp;#x5F15;&amp;#x91C7;&amp;#x7528;B+&amp;#x6811;&amp;#x7684;&amp;#x4E3B;&amp;#x8981;&amp;#x539F;&amp;#x56E0;&amp;#x662F; B&amp;#x6811;&amp;#x5728;&amp;#x63D0;&amp;#x9AD8;&amp;#x4E86;&amp;#x78C1;&amp;#x76D8;IO&amp;#x6027;&amp;#x80FD;&amp;#x7684;&amp;#x540C;&amp;#x65F6;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x89E3;&amp;#x51B3;&amp;#x5143;&amp;#x7D20;&amp;#x904D;&amp;#x5386;&amp;#x7684;&amp;#x6548;&amp;#x7387;&amp;#x4F4E;&amp;#x4E0B;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x3002;&amp;#x6B63;&amp;#x662F;&amp;#x4E3A;&amp;#x4E86;&amp;#x89E3;&amp;#x51B3;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;B+&amp;#x6811;&amp;#x5E94;&amp;#x8FD0;&amp;#x800C;&amp;#x751F;&amp;#x3002;B+&amp;#x6811;&amp;#x53EA;&amp;#x8981;&amp;#x904D;&amp;#x5386;&amp;#x53F6;&amp;#x5B50;&amp;#x8282;&amp;#x70B9;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x5B9E;&amp;#x73B0;&amp;#x6574;&amp;#x68F5;&amp;#x6811;&amp;#x7684;&amp;#x904D;&amp;#x5386;&amp;#x3002;&amp;#x800C;&amp;#x4E14;&amp;#x5728;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#x4E2D;&amp;#x57FA;&amp;#x4E8E;&amp;#x8303;&amp;#x56F4;&amp;#x7684;&amp;#x67E5;&amp;#x8BE2;&amp;#x662F;&amp;#x975E;&amp;#x5E38;&amp;#x9891;&amp;#x7E41;&amp;#x7684;&amp;#xFF0C;&amp;#x800C;B&amp;#x6811;&amp;#x4E0D;&amp;#x652F;&amp;#x6301;&amp;#x8FD9;&amp;#x6837;&amp;#x7684;&amp;#x64CD;&amp;#x4F5C;&amp;#xFF08;&amp;#x6216;&amp;#x8005;&amp;#x8BF4;&amp;#x6548;&amp;#x7387;&amp;#x592A;&amp;#x4F4E;&amp;#xFF09;&amp;#x3002;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&quot;&amp;#x603B;&amp;#x7ED3;&quot;&gt;&amp;#x603B;&amp;#x7ED3;&lt;/h2&gt;&lt;p&gt;&amp;#x901A;&amp;#x8FC7;&amp;#x4EE5;&amp;#x4E0A;&amp;#x4ECB;&amp;#x7ECD;&amp;#xFF0C;&amp;#x5927;&amp;#x81F4;&amp;#x5C06;B&amp;#x6811;&amp;#xFF0C;B+&amp;#x6811;&amp;#xFF0C;B*&amp;#x6811;&amp;#x603B;&amp;#x7ED3;&amp;#x5982;&amp;#x4E0B;&amp;#xFF1A;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;B&amp;#x6811;&amp;#xFF1A;&amp;#x6709;&amp;#x5E8F;&amp;#x6570;&amp;#x7EC4;+&amp;#x5E73;&amp;#x8861;&amp;#x591A;&amp;#x53C9;&amp;#x6811;&amp;#xFF1B;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;B+&amp;#x6811;&amp;#xFF1A;&amp;#x6709;&amp;#x5E8F;&amp;#x6570;&amp;#x7EC4;&amp;#x94FE;&amp;#x8868;+&amp;#x5E73;&amp;#x8861;&amp;#x591A;&amp;#x53C9;&amp;#x6811;&amp;#xFF1B;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;B*&amp;#x6811;&amp;#xFF1A;&amp;#x4E00;&amp;#x68F5;&amp;#x4E30;&amp;#x6EE1;&amp;#x7684;B+&amp;#x6811;&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x5728;&amp;#x5927;&amp;#x89C4;&amp;#x6A21;&amp;#x6570;&amp;#x636E;&amp;#x5B58;&amp;#x50A8;&amp;#x7684;&amp;#x6587;&amp;#x4EF6;&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E2D;&amp;#xFF0C;B~tree&amp;#x7CFB;&amp;#x5217;&amp;#x6570;&amp;#x636E;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x8D77;&amp;#x7740;&amp;#x5F88;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#x4F5C;&amp;#x7528;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;&amp;#x5B58;&amp;#x50A8;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x8282;&amp;#x70B9;&amp;#x76F8;&amp;#x5173;&amp;#x7684;&amp;#x4FE1;&amp;#x606F;&amp;#x4E5F;&amp;#x662F;&amp;#x6709;&amp;#x6240;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C;&amp;#x8FD9;&amp;#x91CC;&amp;#x6839;&amp;#x636E;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x7406;&amp;#x89E3;&amp;#xFF0C;&amp;#x753B;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x67E5;&amp;#x627E;&amp;#x4EE5;&amp;#x804C;&amp;#x5DE5;&amp;#x53F7;&amp;#x4E3A;&amp;#x5173;&amp;#x952E;&amp;#x5B57;&amp;#xFF0C;&amp;#x804C;&amp;#x5DE5;&amp;#x53F7;&amp;#x4E3A;38&amp;#x7684;&amp;#x8BB0;&amp;#x5F55;&amp;#x7684;&amp;#x7B80;&amp;#x5355;&amp;#x793A;&amp;#x610F;&amp;#x56FE;&amp;#x3002;(&amp;#x8FD9;&amp;#x91CC;&amp;#x5047;&amp;#x8BBE;&amp;#x6BCF;&amp;#x4E2A;&amp;#x7269;&amp;#x7406;&amp;#x5757;&amp;#x5BB9;&amp;#x7EB3;3&amp;#x4E2A;&amp;#x7D22;&amp;#x5F15;&amp;#xFF0C;&amp;#x78C1;&amp;#x76D8;&amp;#x7684;I/O&amp;#x64CD;&amp;#x4F5C;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x5355;&amp;#x4F4D;&amp;#x662F;&amp;#x5757;&amp;#xFF08;block),&amp;#x78C1;&amp;#x76D8;&amp;#x8BBF;&amp;#x95EE;&amp;#x5F88;&amp;#x8D39;&amp;#x65F6;&amp;#xFF0C;&amp;#x91C7;&amp;#x7528;B+&amp;#x6811;&amp;#x6709;&amp;#x6548;&amp;#x7684;&amp;#x51CF;&amp;#x5C11;&amp;#x4E86;&amp;#x8BBF;&amp;#x95EE;&amp;#x78C1;&amp;#x76D8;&amp;#x7684;&amp;#x6B21;&amp;#x6570;&amp;#x3002;&amp;#xFF09;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596156/849f9fba-e54b-11e5-99d3-0792f737c688.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;B+&amp;#x6811;&amp;#x8FD8;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x6700;&amp;#x5927;&amp;#x7684;&amp;#x597D;&amp;#x5904;&amp;#xFF0C;&amp;#x65B9;&amp;#x4FBF;&amp;#x626B;&amp;#x5E93;&amp;#xFF0C;B&amp;#x6811;&amp;#x5FC5;&amp;#x987B;&amp;#x7528;&amp;#x4E2D;&amp;#x5E8F;&amp;#x904D;&amp;#x5386;&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x6309;&amp;#x5E8F;&amp;#x626B;&amp;#x5E93;&amp;#xFF0C;&amp;#x800C;B+&amp;#x6811;&amp;#x76F4;&amp;#x63A5;&amp;#x4ECE;&amp;#x53F6;&amp;#x5B50;&amp;#x7ED3;&amp;#x70B9;&amp;#x6328;&amp;#x4E2A;&amp;#x626B;&amp;#x4E00;&amp;#x904D;&amp;#x5C31;&amp;#x5B8C;&amp;#x4E86;&amp;#xFF0C;B+&amp;#x6811;&amp;#x652F;&amp;#x6301;range-query&amp;#x975E;&amp;#x5E38;&amp;#x65B9;&amp;#x4FBF;&amp;#xFF0C;&amp;#x800C;B&amp;#x6811;&amp;#x4E0D;&amp;#x652F;&amp;#x6301;&amp;#x3002;&amp;#x8FD9;&amp;#x662F;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#x9009;&amp;#x7528;B+&amp;#x6811;&amp;#x7684;&amp;#x6700;&amp;#x4E3B;&amp;#x8981;&amp;#x539F;&amp;#x56E0;&amp;#x3002;&lt;br&gt;&amp;#x6BD4;&amp;#x5982;&amp;#x8981;&amp;#x67E5; 5-10&amp;#x4E4B;&amp;#x95F4;&amp;#x7684;&amp;#xFF0C;B+&amp;#x6811;&amp;#x4E00;&amp;#x628A;&amp;#x5230;5&amp;#x8FD9;&amp;#x4E2A;&amp;#x6807;&amp;#x8BB0;&amp;#xFF0C;&amp;#x518D;&amp;#x4E00;&amp;#x628A;&amp;#x5230;10&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x4E32;&amp;#x8D77;&amp;#x6765;&amp;#x5C31;&amp;#x884C;&amp;#x4E86;&amp;#xFF0C;B&amp;#x6811;&amp;#x5C31;&amp;#x975E;&amp;#x5E38;&amp;#x9EBB;&amp;#x70E6;&amp;#x3002;B&amp;#x6811;&amp;#x7684;&amp;#x597D;&amp;#x5904;&amp;#xFF0C;&amp;#x5C31;&amp;#x662F;&amp;#x6210;&amp;#x529F;&amp;#x67E5;&amp;#x8BE2;&amp;#x7279;&amp;#x522B;&amp;#x6709;&amp;#x5229;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x6811;&amp;#x7684;&amp;#x9AD8;&amp;#x5EA6;&amp;#x603B;&amp;#x4F53;&amp;#x8981;&amp;#x6BD4;B+&amp;#x6811;&amp;#x77EE;&amp;#x3002;&amp;#x4E0D;&amp;#x6210;&amp;#x529F;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0B;&amp;#xFF0C;B&amp;#x6811;&amp;#x4E5F;&amp;#x6BD4;B+&amp;#x6811;&amp;#x7A0D;&amp;#x7A0D;&amp;#x5360;&amp;#x4E00;&amp;#x70B9;&amp;#x70B9;&amp;#x4FBF;&amp;#x5B9C;&amp;#x3002;&lt;br&gt;B&amp;#x6811;&amp;#x6BD4;&amp;#x5982;&amp;#x4F60;&amp;#x7684;&amp;#x4F8B;&amp;#x5B50;&amp;#x4E2D;&amp;#x67E5;&amp;#xFF0C;17&amp;#x7684;&amp;#x8BDD;&amp;#xFF0C;&amp;#x4E00;&amp;#x628A;&amp;#x5C31;&amp;#x5F97;&amp;#x5230;&amp;#x7ED3;&amp;#x679C;&amp;#x4E86;&amp;#xFF0C;&lt;br&gt;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#x57FA;&amp;#x4E8E;&amp;#x9891;&amp;#x7387;&amp;#x7684;&amp;#x641C;&amp;#x7D22;&amp;#x662F;&amp;#x9009;&amp;#x7528;B&amp;#x6811;&amp;#xFF0C;&amp;#x8D8A;&amp;#x9891;&amp;#x7E41;query&amp;#x7684;&amp;#x7ED3;&amp;#x70B9;&amp;#x8D8A;&amp;#x5F80;&amp;#x6839;&amp;#x4E0A;&amp;#x8D70;&amp;#xFF0C;&amp;#x524D;&amp;#x63D0;&amp;#x662F;&amp;#x9700;&amp;#x8981;&amp;#x5BF9;query&amp;#x505A;&amp;#x7EDF;&amp;#x8BA1;&amp;#xFF0C;&amp;#x800C;&amp;#x4E14;&amp;#x8981;&amp;#x5BF9;key&amp;#x505A;&amp;#x4E00;&amp;#x4E9B;&amp;#x53D8;&amp;#x5316;&amp;#x3002;&lt;br&gt;&amp;#x53E6;&amp;#x5916;B&amp;#x6811;&amp;#x4E5F;&amp;#x597D;B+&amp;#x6811;&amp;#x4E5F;&amp;#x597D;&amp;#xFF0C;&amp;#x6839;&amp;#x6216;&amp;#x8005;&amp;#x4E0A;&amp;#x9762;&amp;#x51E0;&amp;#x5C42;&amp;#x56E0;&amp;#x4E3A;&amp;#x88AB;&amp;#x53CD;&amp;#x590D;query&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x8FD9;&amp;#x51E0;&amp;#x5757;&amp;#x57FA;&amp;#x672C;&amp;#x90FD;&amp;#x5728;&amp;#x5185;&amp;#x5B58;&amp;#x4E2D;&amp;#xFF0C;&amp;#x4E0D;&amp;#x4F1A;&amp;#x51FA;&amp;#x73B0;&amp;#x8BFB;&amp;#x78C1;&amp;#x76D8;IO&amp;#xFF0C;&amp;#x4E00;&amp;#x822C;&amp;#x5DF2;&amp;#x542F;&amp;#x52A8;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#xFF0C;&amp;#x5C31;&amp;#x4F1A;&amp;#x4E3B;&amp;#x52A8;&amp;#x6362;&amp;#x5165;&amp;#x5185;&amp;#x5B58;&amp;#x3002;&lt;br&gt;mysql &amp;#x5E95;&amp;#x5C42;&amp;#x5B58;&amp;#x50A8;&amp;#x662F;&amp;#x7528;B+&amp;#x6811;&amp;#x5B9E;&amp;#x73B0;&amp;#x7684;&amp;#xFF0C;&amp;#x77E5;&amp;#x9053;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x3002;&amp;#x5185;&amp;#x5B58;&amp;#x4E2D;B+&amp;#x6811;&amp;#x662F;&amp;#x6CA1;&amp;#x6709;&amp;#x4F18;&amp;#x52BF;&amp;#x7684;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x4E00;&amp;#x5230;&amp;#x78C1;&amp;#x76D8;&amp;#xFF0C;B+&amp;#x6811;&amp;#x7684;&amp;#x5A01;&amp;#x529B;&amp;#x5C31;&amp;#x51FA;&amp;#x6765;&amp;#x4E86;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&quot;mysql&amp;#x4E0D;&amp;#x540C;&amp;#x5B58;&amp;#x50A8;&amp;#x5F15;&amp;#x64CE;&amp;#x7D22;&amp;#x5F15;&amp;#x7ED3;&amp;#x6784;&quot;&gt;mysql&amp;#x4E0D;&amp;#x540C;&amp;#x5B58;&amp;#x50A8;&amp;#x5F15;&amp;#x64CE;&amp;#x7D22;&amp;#x5F15;&amp;#x7ED3;&amp;#x6784;&lt;/h1&gt;&lt;h2 id=&quot;myisam&amp;#x7D22;&amp;#x5F15;&amp;#x5B9E;&amp;#x73B0;&quot;&gt;MyISAM&amp;#x7D22;&amp;#x5F15;&amp;#x5B9E;&amp;#x73B0;&lt;/h2&gt;&lt;p&gt;MyISAM&amp;#x5F15;&amp;#x64CE;&amp;#x4F7F;&amp;#x7528;B+Tree&amp;#x4F5C;&amp;#x4E3A;&amp;#x7D22;&amp;#x5F15;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x53F6;&amp;#x8282;&amp;#x70B9;&amp;#x7684;data&amp;#x57DF;&amp;#x5B58;&amp;#x653E;&amp;#x7684;&amp;#x662F;&amp;#x6570;&amp;#x636E;&amp;#x8BB0;&amp;#x5F55;&amp;#x7684;&amp;#x5730;&amp;#x5740;&amp;#x3002;&amp;#x4E0B;&amp;#x56FE;&amp;#x662F;MyISAM&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#x539F;&amp;#x7406;&amp;#x56FE;&amp;#xFF1A;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596332/d091af52-e54c-11e5-918c-e45668aa948b.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;MyISAM&amp;#x7684;&amp;#x7D22;&amp;#x5F15;&amp;#x65B9;&amp;#x5F0F;&amp;#x4E5F;&amp;#x53EB;&amp;#x505A;&amp;#x201C;&amp;#x975E;&amp;#x805A;&amp;#x96C6;&amp;#x201D;&amp;#x7684;&amp;#xFF0C;&amp;#x56E0;&amp;#x6B64;&amp;#x5BF9;&amp;#x5E94;&amp;#x6570;&amp;#x636E;&amp;#x4E5F;&amp;#x4E0D;&amp;#x662F;&amp;#x987A;&amp;#x5E8F;&amp;#x7684;&lt;/p&gt;
&lt;h2 id=&quot;innodb&amp;#x7D22;&amp;#x5F15;&amp;#x5B9E;&amp;#x73B0;&quot;&gt;InnoDB&amp;#x7D22;&amp;#x5F15;&amp;#x5B9E;&amp;#x73B0;&lt;/h2&gt;&lt;p&gt;&amp;#x867D;&amp;#x7136;InnoDB&amp;#x4E5F;&amp;#x4F7F;&amp;#x7528;B+Tree&amp;#x4F5C;&amp;#x4E3A;&amp;#x7D22;&amp;#x5F15;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x4F46;&amp;#x5177;&amp;#x4F53;&amp;#x5B9E;&amp;#x73B0;&amp;#x65B9;&amp;#x5F0F;&amp;#x5374;&amp;#x4E0E;MyISAM&amp;#x622A;&amp;#x7136;&amp;#x4E0D;&amp;#x540C;&amp;#x3002;&lt;br&gt;       &amp;#x7B2C;&amp;#x4E00;&amp;#x4E2A;&amp;#x91CD;&amp;#x5927;&amp;#x533A;&amp;#x522B;&amp;#x662F;InnoDB&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x6587;&amp;#x4EF6;&amp;#x672C;&amp;#x8EAB;&amp;#x5C31;&amp;#x662F;&amp;#x7D22;&amp;#x5F15;&amp;#x6587;&amp;#x4EF6;&amp;#x3002;&amp;#x4ECE;&amp;#x4E0A;&amp;#x6587;&amp;#x77E5;&amp;#x9053;&amp;#xFF0C;MyISAM&amp;#x7D22;&amp;#x5F15;&amp;#x6587;&amp;#x4EF6;&amp;#x548C;&amp;#x6570;&amp;#x636E;&amp;#x6587;&amp;#x4EF6;&amp;#x662F;&amp;#x5206;&amp;#x79BB;&amp;#x7684;&amp;#xFF0C;&amp;#x7D22;&amp;#x5F15;&amp;#x6587;&amp;#x4EF6;&amp;#x4EC5;&amp;#x4FDD;&amp;#x5B58;&amp;#x6570;&amp;#x636E;&amp;#x8BB0;&amp;#x5F55;&amp;#x7684;&amp;#x5730;&amp;#x5740;&amp;#x3002;&amp;#x800C;&amp;#x5728;InnoDB&amp;#x4E2D;&amp;#xFF0C;&amp;#x8868;&amp;#x6570;&amp;#x636E;&amp;#x6587;&amp;#x4EF6;&amp;#x672C;&amp;#x8EAB;&amp;#x5C31;&amp;#x662F;&amp;#x6309;B+Tree&amp;#x7EC4;&amp;#x7EC7;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x7D22;&amp;#x5F15;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x8FD9;&amp;#x68F5;&amp;#x6811;&amp;#x7684;&amp;#x53F6;&amp;#x8282;&amp;#x70B9;data&amp;#x57DF;&amp;#x4FDD;&amp;#x5B58;&amp;#x4E86;&amp;#x5B8C;&amp;#x6574;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x8BB0;&amp;#x5F55;&amp;#x3002;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7D22;&amp;#x5F15;&amp;#x7684;key&amp;#x662F;&amp;#x6570;&amp;#x636E;&amp;#x8868;&amp;#x7684;&amp;#x4E3B;&amp;#x952E;&amp;#xFF0C;&amp;#x56E0;&amp;#x6B64;InnoDB&amp;#x8868;&amp;#x6570;&amp;#x636E;&amp;#x6587;&amp;#x4EF6;&amp;#x672C;&amp;#x8EAB;&amp;#x5C31;&amp;#x662F;&amp;#x4E3B;&amp;#x7D22;&amp;#x5F15;&amp;#x3002;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596638/aa940b2c-e54e-11e5-967d-7411651f77b3.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;       &amp;#x53EF;&amp;#x4EE5;&amp;#x770B;&amp;#x5230;&amp;#x53F6;&amp;#x8282;&amp;#x70B9;&amp;#x5305;&amp;#x542B;&amp;#x4E86;&amp;#x5B8C;&amp;#x6574;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x8BB0;&amp;#x5F55;&amp;#x3002;&amp;#x8FD9;&amp;#x79CD;&amp;#x7D22;&amp;#x5F15;&amp;#x53EB;&amp;#x505A;&amp;#x805A;&amp;#x96C6;&amp;#x7D22;&amp;#x5F15;&amp;#x3002;&amp;#x56E0;&amp;#x4E3A;InnoDB&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x6587;&amp;#x4EF6;&amp;#x672C;&amp;#x8EAB;&amp;#x8981;&amp;#x6309;&amp;#x4E3B;&amp;#x952E;&amp;#x805A;&amp;#x96C6;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;InnoDB&amp;#x8981;&amp;#x6C42;&amp;#x8868;&amp;#x5FC5;&amp;#x987B;&amp;#x6709;&amp;#x4E3B;&amp;#x952E;&amp;#xFF08;MyISAM&amp;#x53EF;&amp;#x4EE5;&amp;#x6CA1;&amp;#x6709;&amp;#xFF09;&amp;#xFF0C;&amp;#x5982;&amp;#x679C;&amp;#x6CA1;&amp;#x6709;&amp;#x663E;&amp;#x5F0F;&amp;#x6307;&amp;#x5B9A;&amp;#xFF0C;&amp;#x5219;MySQL&amp;#x7CFB;&amp;#x7EDF;&amp;#x4F1A;&amp;#x81EA;&amp;#x52A8;&amp;#x9009;&amp;#x62E9;&amp;#x4E00;&amp;#x4E2A;&amp;#x53EF;&amp;#x4EE5;&amp;#x552F;&amp;#x4E00;&amp;#x6807;&amp;#x8BC6;&amp;#x6570;&amp;#x636E;&amp;#x8BB0;&amp;#x5F55;&amp;#x7684;&amp;#x5217;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E3B;&amp;#x952E;&amp;#xFF0C;&amp;#x5982;&amp;#x679C;&amp;#x4E0D;&amp;#x5B58;&amp;#x5728;&amp;#x8FD9;&amp;#x79CD;&amp;#x5217;&amp;#xFF0C;&amp;#x5219;MySQL&amp;#x81EA;&amp;#x52A8;&amp;#x4E3A;InnoDB&amp;#x8868;&amp;#x751F;&amp;#x6210;&amp;#x4E00;&amp;#x4E2A;&amp;#x9690;&amp;#x542B;&amp;#x5B57;&amp;#x6BB5;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E3B;&amp;#x952E;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x5B57;&amp;#x6BB5;&amp;#x957F;&amp;#x5EA6;&amp;#x4E3A;6&amp;#x4E2A;&amp;#x5B57;&amp;#x8282;&amp;#xFF0C;&amp;#x7C7B;&amp;#x578B;&amp;#x4E3A;&amp;#x957F;&amp;#x6574;&amp;#x5F62;&amp;#x3002;&lt;br&gt;       &amp;#x7B2C;&amp;#x4E8C;&amp;#x4E2A;&amp;#x4E0E;MyISAM&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#x4E0D;&amp;#x540C;&amp;#x662F;InnoDB&amp;#x7684;&amp;#x8F85;&amp;#x52A9;&amp;#x7D22;&amp;#x5F15;data&amp;#x57DF;&amp;#x5B58;&amp;#x50A8;&amp;#x76F8;&amp;#x5E94;&amp;#x8BB0;&amp;#x5F55;&amp;#x4E3B;&amp;#x952E;&amp;#x7684;&amp;#x503C;&amp;#x800C;&amp;#x4E0D;&amp;#x662F;&amp;#x5730;&amp;#x5740;&amp;#x3002;&amp;#x6362;&amp;#x53E5;&amp;#x8BDD;&amp;#x8BF4;&amp;#xFF0C;InnoDB&amp;#x7684;&amp;#x6240;&amp;#x6709;&amp;#x8F85;&amp;#x52A9;&amp;#x7D22;&amp;#x5F15;&amp;#x90FD;&amp;#x5F15;&amp;#x7528;&amp;#x4E3B;&amp;#x952E;&amp;#x4F5C;&amp;#x4E3A;data&amp;#x57DF;&amp;#x3002;&amp;#x4F8B;&amp;#x5982;&amp;#xFF0C;&amp;#x56FE;11&amp;#x4E3A;&amp;#x5B9A;&amp;#x4E49;&amp;#x5728;Col3&amp;#x4E0A;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x8F85;&amp;#x52A9;&amp;#x7D22;&amp;#x5F15;&amp;#xFF1A;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596682/eba20862-e54e-11e5-9aae-02ed6f89cac4.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;       &amp;#x8FD9;&amp;#x91CC;&amp;#x4EE5;&amp;#x82F1;&amp;#x6587;&amp;#x5B57;&amp;#x7B26;&amp;#x7684;ASCII&amp;#x7801;&amp;#x4F5C;&amp;#x4E3A;&amp;#x6BD4;&amp;#x8F83;&amp;#x51C6;&amp;#x5219;&amp;#x3002;&amp;#x805A;&amp;#x96C6;&amp;#x7D22;&amp;#x5F15;&amp;#x8FD9;&amp;#x79CD;&amp;#x5B9E;&amp;#x73B0;&amp;#x65B9;&amp;#x5F0F;&amp;#x4F7F;&amp;#x5F97;&amp;#x6309;&amp;#x4E3B;&amp;#x952E;&amp;#x7684;&amp;#x641C;&amp;#x7D22;&amp;#x5341;&amp;#x5206;&amp;#x9AD8;&amp;#x6548;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x8F85;&amp;#x52A9;&amp;#x7D22;&amp;#x5F15;&amp;#x641C;&amp;#x7D22;&amp;#x9700;&amp;#x8981;&amp;#x68C0;&amp;#x7D22;&amp;#x4E24;&amp;#x904D;&amp;#x7D22;&amp;#x5F15;&amp;#xFF1A;&amp;#x9996;&amp;#x5148;&amp;#x68C0;&amp;#x7D22;&amp;#x8F85;&amp;#x52A9;&amp;#x7D22;&amp;#x5F15;&amp;#x83B7;&amp;#x5F97;&amp;#x4E3B;&amp;#x952E;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x7528;&amp;#x4E3B;&amp;#x952E;&amp;#x5230;&amp;#x4E3B;&amp;#x7D22;&amp;#x5F15;&amp;#x4E2D;&amp;#x68C0;&amp;#x7D22;&amp;#x83B7;&amp;#x5F97;&amp;#x8BB0;&amp;#x5F55;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x603B;&amp;#x7ED3;&amp;#x4E00;&amp;#x4E0B;&quot;&gt;&amp;#x603B;&amp;#x7ED3;&amp;#x4E00;&amp;#x4E0B;&lt;/h2&gt;&lt;p&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13596562/2badbc54-e54e-11e5-8e7e-8081badb8edf.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;Myisam&lt;/p&gt;
&lt;blockquote&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x4E3B;&amp;#x952E;&amp;#x7D22;&amp;#x5F15;/&amp;#x975E;&amp;#x4E3B;&amp;#x952E;&amp;#x7D22;&amp;#x5F15;&lt;/li&gt;
&lt;li&gt;&amp;#x53F6;&amp;#x5B50;&amp;#x8282;&amp;#x70B9;&amp;#x4E0A;&amp;#x5747;&amp;#x5E26;&amp;#x6709;&amp;#x884C;&amp;#x53F7;&amp;#xFF0C;&amp;#x901A;&amp;#x8FC7;&amp;#x884C;&amp;#x53F7;&amp;#x8FDB;&amp;#x884C;&amp;#x7D22;&amp;#x5F15;&lt;/li&gt;
&lt;/ul&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Innodb&lt;/p&gt;
&lt;blockquote&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x4E3B;&amp;#x952E;&amp;#x7D22;&amp;#x5F15;(&amp;#x805A;&amp;#x7C07;&amp;#x7D22;&amp;#x5F15;)&amp;#xFF0C;&amp;#x53F6;&amp;#x5B50;&amp;#x8282;&amp;#x70B9;&amp;#x4E0A;&amp;#x5E26;&amp;#x6709;&amp;#x6570;&amp;#x636E;&lt;/li&gt;
&lt;li&gt;&amp;#x975E;&amp;#x4E3B;&amp;#x952E;&amp;#x7D22;&amp;#x5F15;(&amp;#x7B2C;&amp;#x4E8C;&amp;#x7D22;&amp;#x5F15;)&amp;#xFF0C;&amp;#x53F6;&amp;#x5B50;&amp;#x8282;&amp;#x70B9;&amp;#x4E0A;&amp;#x5E26;&amp;#x6709;&amp;#x4E3B;&amp;#x952E;id&lt;/li&gt;
&lt;/ul&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;innodb&amp;#x5B58;&amp;#x50A8;&amp;#x5F15;&amp;#x64CE;&amp;#x7684;&amp;#x7D22;&amp;#x5F15;&amp;#x8BBE;&amp;#x8BA1;&amp;#x4E0E;myisam&amp;#x7684;&amp;#x5B9E;&amp;#x73B0;&amp;#x6709;&amp;#x5F02;&amp;#xFF1F;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;myisam&amp;#x5C5E;&amp;#x4E8E;&amp;#x5806;&amp;#x8868;&amp;#xFF0C;&amp;#x6570;&amp;#x636E;&amp;#x5199;&amp;#x5165;&amp;#x4E00;&amp;#x76F4;&amp;#x7D2F;&amp;#x79EF;(concurrent_insert&amp;#x53C2;&amp;#x6570;&amp;#x8BBE;&amp;#x7F6E;&amp;#x4E3A;2);&amp;#x6B64;&amp;#x65F6;&amp;#x5199;&amp;#x5165;&amp;#x6027;&amp;#x80FD;&amp;#x6BD4;innodb&amp;#x597D;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x65E0;&amp;#x8BBA;&amp;#x662F;&amp;#x4E3B;&amp;#x952E;&amp;#x67E5;&amp;#x8BE2;&amp;#x8FD8;&amp;#x662F;&amp;#x975E;&amp;#x4E3B;&amp;#x952E;&amp;#x67E5;&amp;#x8BE2;&amp;#xFF0C;&amp;#x90FD;&amp;#x4E0D;&amp;#x53EF;&amp;#x907F;&amp;#x514D;&amp;#x7684;&amp;#x9700;&amp;#x8981;&amp;#x4E8C;&amp;#x6B21;io(&amp;#x9664;&amp;#x975E;&amp;#x80FD;&amp;#x7D22;&amp;#x5F15;&amp;#x5185;&amp;#x5B8C;&amp;#x6210;&amp;#x5B57;&amp;#x6BB5;&amp;#x8BB0;&amp;#x5F55;&amp;#x8FD4;&amp;#x56DE;)&lt;br&gt;innodb&amp;#x5C5E;&amp;#x4E8E;&amp;#x805A;&amp;#x7C07;&amp;#x7D22;&amp;#x5F15;&amp;#x7EC4;&amp;#x7EC7;&amp;#x8868;(&amp;#x4E3B;&amp;#x952E;&amp;#x7D22;&amp;#x5F15;&amp;#x5373;&amp;#x6570;&amp;#x636E;),&amp;#x7531;&amp;#x4E8E;&amp;#x5FC5;&amp;#x987B;&amp;#x4FDD;&amp;#x8BC1;&amp;#x7D22;&amp;#x5F15;&amp;#x6709;&amp;#x5E8F;&amp;#xFF0C;&amp;#x5728;&amp;#x5199;&amp;#x5165;&amp;#x65F6;&amp;#x9700;&amp;#x8981;&amp;#x627E;&amp;#x5230;&amp;#x5408;&amp;#x9002;&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#x8FDB;&amp;#x884C;&amp;#x63D2;&amp;#x5165;&amp;#xFF0C;&amp;#x6709;&amp;#x65F6;&amp;#x5019;&amp;#x8FD8;&amp;#x4F1A;&amp;#x5BFC;&amp;#x81F4;&amp;#x4E8C;&amp;#x53C9;&amp;#x6811;&amp;#x8C03;&amp;#x6574;&amp;#x6240;&amp;#x4EE5;&amp;#x5199;&amp;#x5165;&amp;#x6027;&amp;#x80FD;&amp;#x6BD4;myisam&amp;#x8981;&amp;#x5DEE;&amp;#xFF1B;&amp;#x4F46;&amp;#x662F;&amp;#x4E3B;&amp;#x952E;&amp;#x67E5;&amp;#x627E;&amp;#x65F6;&amp;#x53EA;&amp;#x9700;&amp;#x8981;&amp;#x4E00;&amp;#x6B21;io&amp;#x5373;&amp;#x53EF;&amp;#x8FD4;&amp;#x56DE;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x975E;&amp;#x4E3B;&amp;#x952E;&amp;#x7D22;&amp;#x5F15;&amp;#x67E5;&amp;#x8BE2;&amp;#x65F6;&amp;#x5982;&amp;#x679C;&amp;#x5728;&amp;#x7D22;&amp;#x5F15;&amp;#x5185;&amp;#x4E0D;&amp;#x80FD;&amp;#x5B8C;&amp;#x6210;&amp;#x67E5;&amp;#x8BE2;&amp;#x8BB0;&amp;#x5F55;&amp;#x8FD4;&amp;#x56DE;&amp;#x5219;&amp;#x9700;&amp;#x8981;&amp;#x7B2C;&amp;#x4E8C;&amp;#x6B21;&amp;#x7684;io&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&quot;mysql-innodb&amp;#x4E8B;&amp;#x52A1;&amp;#x548C;&amp;#x9501;&quot;&gt;mysql InnoDB&amp;#x4E8B;&amp;#x52A1;&amp;#x548C;&amp;#x9501;&lt;/h1&gt;&lt;h2 id=&quot;mvccsnapshot-read-vs-current-read&quot;&gt;MVCC&amp;#xFF1A;Snapshot Read vs Current Read&lt;/h2&gt;&lt;p&gt;MySQL InnoDB&amp;#x5B58;&amp;#x50A8;&amp;#x5F15;&amp;#x64CE;&amp;#xFF0C;&amp;#x5B9E;&amp;#x73B0;&amp;#x7684;&amp;#x662F;&amp;#x57FA;&amp;#x4E8E;&amp;#x591A;&amp;#x7248;&amp;#x672C;&amp;#x7684;&amp;#x5E76;&amp;#x53D1;&amp;#x63A7;&amp;#x5236;&amp;#x534F;&amp;#x8BAE;&amp;#x2014;&amp;#x2014;MVCC (Multi-Version Concurrency Control) (&amp;#x6CE8;&amp;#xFF1A;&amp;#x4E0E;MVCC&amp;#x76F8;&amp;#x5BF9;&amp;#x7684;&amp;#xFF0C;&amp;#x662F;&amp;#x57FA;&amp;#x4E8E;&amp;#x9501;&amp;#x7684;&amp;#x5E76;&amp;#x53D1;&amp;#x63A7;&amp;#x5236;&amp;#xFF0C;Lock-Based Concurrency Control)&amp;#x3002;MVCC&amp;#x6700;&amp;#x5927;&amp;#x7684;&amp;#x597D;&amp;#x5904;&amp;#xFF0C;&amp;#x76F8;&amp;#x4FE1;&amp;#x4E5F;&amp;#x662F;&amp;#x8033;&amp;#x719F;&amp;#x80FD;&amp;#x8BE6;&amp;#xFF1A;&amp;#x8BFB;&amp;#x4E0D;&amp;#x52A0;&amp;#x9501;&amp;#xFF0C;&amp;#x8BFB;&amp;#x5199;&amp;#x4E0D;&amp;#x51B2;&amp;#x7A81;&amp;#x3002;&amp;#x5728;&amp;#x8BFB;&amp;#x591A;&amp;#x5199;&amp;#x5C11;&amp;#x7684;OLTP&amp;#x5E94;&amp;#x7528;&amp;#x4E2D;&amp;#xFF0C;&amp;#x8BFB;&amp;#x5199;&amp;#x4E0D;&amp;#x51B2;&amp;#x7A81;&amp;#x662F;&amp;#x975E;&amp;#x5E38;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#xFF0C;&amp;#x6781;&amp;#x5927;&amp;#x7684;&amp;#x589E;&amp;#x52A0;&amp;#x4E86;&amp;#x7CFB;&amp;#x7EDF;&amp;#x7684;&amp;#x5E76;&amp;#x53D1;&amp;#x6027;&amp;#x80FD;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E5F;&amp;#x662F;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x73B0;&amp;#x9636;&amp;#x6BB5;&amp;#xFF0C;&amp;#x51E0;&amp;#x4E4E;&amp;#x6240;&amp;#x6709;&amp;#x7684;RDBMS&amp;#xFF0C;&amp;#x90FD;&amp;#x652F;&amp;#x6301;&amp;#x4E86;MVCC&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5728;MVCC&amp;#x5E76;&amp;#x53D1;&amp;#x63A7;&amp;#x5236;&amp;#x4E2D;&amp;#xFF0C;&amp;#x8BFB;&amp;#x64CD;&amp;#x4F5C;&amp;#x53EF;&amp;#x4EE5;&amp;#x5206;&amp;#x6210;&amp;#x4E24;&amp;#x7C7B;&amp;#xFF1A;&amp;#x5FEB;&amp;#x7167;&amp;#x8BFB; (snapshot read)&amp;#x4E0E;&amp;#x5F53;&amp;#x524D;&amp;#x8BFB; (current read)&amp;#x3002;&amp;#x5FEB;&amp;#x7167;&amp;#x8BFB;&amp;#xFF0C;&amp;#x8BFB;&amp;#x53D6;&amp;#x7684;&amp;#x662F;&amp;#x8BB0;&amp;#x5F55;&amp;#x7684;&amp;#x53EF;&amp;#x89C1;&amp;#x7248;&amp;#x672C; (&amp;#x6709;&amp;#x53EF;&amp;#x80FD;&amp;#x662F;&amp;#x5386;&amp;#x53F2;&amp;#x7248;&amp;#x672C;)&amp;#xFF0C;&amp;#x4E0D;&amp;#x7528;&amp;#x52A0;&amp;#x9501;&amp;#x3002;&amp;#x5F53;&amp;#x524D;&amp;#x8BFB;&amp;#xFF0C;&amp;#x8BFB;&amp;#x53D6;&amp;#x7684;&amp;#x662F;&amp;#x8BB0;&amp;#x5F55;&amp;#x7684;&amp;#x6700;&amp;#x65B0;&amp;#x7248;&amp;#x672C;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#xFF0C;&amp;#x5F53;&amp;#x524D;&amp;#x8BFB;&amp;#x8FD4;&amp;#x56DE;&amp;#x7684;&amp;#x8BB0;&amp;#x5F55;&amp;#xFF0C;&amp;#x90FD;&amp;#x4F1A;&amp;#x52A0;&amp;#x4E0A;&amp;#x9501;&amp;#xFF0C;&amp;#x4FDD;&amp;#x8BC1;&amp;#x5176;&amp;#x4ED6;&amp;#x4E8B;&amp;#x52A1;&amp;#x4E0D;&amp;#x4F1A;&amp;#x518D;&amp;#x5E76;&amp;#x53D1;&amp;#x4FEE;&amp;#x6539;&amp;#x8FD9;&amp;#x6761;&amp;#x8BB0;&amp;#x5F55;&amp;#x3002;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x5FEB;&amp;#x7167;&amp;#x8BFB;&amp;#xFF1A;&amp;#x7B80;&amp;#x5355;&amp;#x7684;select&amp;#x64CD;&amp;#x4F5C;&amp;#xFF0C;&amp;#x5C5E;&amp;#x4E8E;&amp;#x5FEB;&amp;#x7167;&amp;#x8BFB;&amp;#xFF0C;&amp;#x4E0D;&amp;#x52A0;&amp;#x9501;&amp;#x3002;(&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x4E5F;&amp;#x6709;&amp;#x4F8B;&amp;#x5916;&amp;#xFF0C;&amp;#x4E0B;&amp;#x9762;&amp;#x4F1A;&amp;#x5206;&amp;#x6790;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;select * from table where ?;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x5F53;&amp;#x524D;&amp;#x8BFB;&amp;#xFF1A;&amp;#x7279;&amp;#x6B8A;&amp;#x7684;&amp;#x8BFB;&amp;#x64CD;&amp;#x4F5C;&amp;#xFF0C;&amp;#x63D2;&amp;#x5165;/&amp;#x66F4;&amp;#x65B0;/&amp;#x5220;&amp;#x9664;&amp;#x64CD;&amp;#x4F5C;&amp;#xFF0C;&amp;#x5C5E;&amp;#x4E8E;&amp;#x5F53;&amp;#x524D;&amp;#x8BFB;&amp;#xFF0C;&amp;#x9700;&amp;#x8981;&amp;#x52A0;&amp;#x9501;&amp;#x3002;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;select * from table where ? lock in share mode;&lt;br&gt;select * from table where ? for update;&lt;br&gt;insert into table values (&amp;#x2026;);&lt;br&gt;update table set ? where ?;&lt;br&gt;delete from table where ?;&lt;br&gt;&amp;#x6240;&amp;#x6709;&amp;#x4EE5;&amp;#x4E0A;&amp;#x7684;&amp;#x8BED;&amp;#x53E5;&amp;#xFF0C;&amp;#x90FD;&amp;#x5C5E;&amp;#x4E8E;&amp;#x5F53;&amp;#x524D;&amp;#x8BFB;&amp;#xFF0C;&amp;#x8BFB;&amp;#x53D6;&amp;#x8BB0;&amp;#x5F55;&amp;#x7684;&amp;#x6700;&amp;#x65B0;&amp;#x7248;&amp;#x672C;&amp;#x3002;&amp;#x5E76;&amp;#x4E14;&amp;#xFF0C;&amp;#x8BFB;&amp;#x53D6;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x8FD8;&amp;#x9700;&amp;#x8981;&amp;#x4FDD;&amp;#x8BC1;&amp;#x5176;&amp;#x4ED6;&amp;#x5E76;&amp;#x53D1;&amp;#x4E8B;&amp;#x52A1;&amp;#x4E0D;&amp;#x80FD;&amp;#x4FEE;&amp;#x6539;&amp;#x5F53;&amp;#x524D;&amp;#x8BB0;&amp;#x5F55;&amp;#xFF0C;&amp;#x5BF9;&amp;#x8BFB;&amp;#x53D6;&amp;#x8BB0;&amp;#x5F55;&amp;#x52A0;&amp;#x9501;&amp;#x3002;&amp;#x5176;&amp;#x4E2D;&amp;#xFF0C;&amp;#x9664;&amp;#x4E86;&amp;#x7B2C;&amp;#x4E00;&amp;#x6761;&amp;#x8BED;&amp;#x53E5;&amp;#xFF0C;&amp;#x5BF9;&amp;#x8BFB;&amp;#x53D6;&amp;#x8BB0;&amp;#x5F55;&amp;#x52A0;S&amp;#x9501; (&amp;#x5171;&amp;#x4EAB;&amp;#x9501;)&amp;#x5916;&amp;#xFF0C;&amp;#x5176;&amp;#x4ED6;&amp;#x7684;&amp;#x64CD;&amp;#x4F5C;&amp;#xFF0C;&amp;#x90FD;&amp;#x52A0;&amp;#x7684;&amp;#x662F;X&amp;#x9501; (&amp;#x6392;&amp;#x5B83;&amp;#x9501;)&amp;#x3002;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13623266/5a41c58c-e5e0-11e5-99e7-61883fb1bee3.png&quot; alt=&quot;image&quot;&gt;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x4E00;&amp;#x6761;&amp;#x7B80;&amp;#x5355;sql&amp;#x7684;&amp;#x52A0;&amp;#x9501;&amp;#x5B9E;&amp;#x73B0;&amp;#x5206;&amp;#x6790;&quot;&gt;&amp;#x4E00;&amp;#x6761;&amp;#x7B80;&amp;#x5355;SQL&amp;#x7684;&amp;#x52A0;&amp;#x9501;&amp;#x5B9E;&amp;#x73B0;&amp;#x5206;&amp;#x6790;&lt;/h2&gt;&lt;p&gt;&amp;#x5728;&amp;#x4ECB;&amp;#x7ECD;&amp;#x5B8C;&amp;#x4E00;&amp;#x4E9B;&amp;#x80CC;&amp;#x666F;&amp;#x77E5;&amp;#x8BC6;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x672C;&amp;#x6587;&amp;#x63A5;&amp;#x4E0B;&amp;#x6765;&amp;#x5C06;&amp;#x9009;&amp;#x62E9;&amp;#x51E0;&amp;#x4E2A;&amp;#x6709;&amp;#x4EE3;&amp;#x8868;&amp;#x6027;&amp;#x7684;&amp;#x4F8B;&amp;#x5B50;&amp;#xFF0C;&amp;#x6765;&amp;#x8BE6;&amp;#x7EC6;&amp;#x5206;&amp;#x6790;MySQL&amp;#x7684;&amp;#x52A0;&amp;#x9501;&amp;#x5904;&amp;#x7406;&amp;#x3002;&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x4ECE;&amp;#x6700;&amp;#x7B80;&amp;#x5355;&amp;#x7684;&amp;#x4F8B;&amp;#x5B50;&amp;#x8BF4;&amp;#x8D77;&amp;#x3002;&amp;#x7ECF;&amp;#x5E38;&amp;#x6709;&amp;#x670B;&amp;#x53CB;&amp;#x53D1;&amp;#x7ED9;&amp;#x6211;&amp;#x4E00;&amp;#x4E2A;SQL&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x95EE;&amp;#x6211;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;SQL&amp;#x52A0;&amp;#x4EC0;&amp;#x4E48;&amp;#x9501;&amp;#xFF1F;&amp;#x5C31;&amp;#x5982;&amp;#x540C;&amp;#x4E0B;&amp;#x9762;&amp;#x4E24;&amp;#x6761;&amp;#x7B80;&amp;#x5355;&amp;#x7684;SQL&amp;#xFF0C;&amp;#x4ED6;&amp;#x4EEC;&amp;#x52A0;&amp;#x4EC0;&amp;#x4E48;&amp;#x9501;&amp;#xFF1F;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;SQL1&amp;#xFF1A;select * from t1 where id = 10;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;SQL2&amp;#xFF1A;delete from t1 where id = 10;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x9488;&amp;#x5BF9;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x8BE5;&amp;#x600E;&amp;#x4E48;&amp;#x56DE;&amp;#x7B54;&amp;#xFF1F;&amp;#x6211;&amp;#x80FD;&amp;#x60F3;&amp;#x8C61;&amp;#x5230;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x7B54;&amp;#x6848;&amp;#x662F;&amp;#xFF1A;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;SQL1&amp;#xFF1A;&amp;#x4E0D;&amp;#x52A0;&amp;#x9501;&amp;#x3002;&amp;#x56E0;&amp;#x4E3A;MySQL&amp;#x662F;&amp;#x4F7F;&amp;#x7528;&amp;#x591A;&amp;#x7248;&amp;#x672C;&amp;#x5E76;&amp;#x53D1;&amp;#x63A7;&amp;#x5236;&amp;#x7684;&amp;#xFF0C;&amp;#x8BFB;&amp;#x4E0D;&amp;#x52A0;&amp;#x9501;&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;SQL2&amp;#xFF1A;&amp;#x5BF9;id = 10&amp;#x7684;&amp;#x8BB0;&amp;#x5F55;&amp;#x52A0;&amp;#x5199;&amp;#x9501; (&amp;#x8D70;&amp;#x4E3B;&amp;#x952E;&amp;#x7D22;&amp;#x5F15;)&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7B54;&amp;#x6848;&amp;#x5BF9;&amp;#x5417;&amp;#xFF1F;&amp;#x8BF4;&amp;#x4E0D;&amp;#x4E0A;&amp;#x6765;&amp;#x3002;&amp;#x5373;&amp;#x53EF;&amp;#x80FD;&amp;#x662F;&amp;#x6B63;&amp;#x786E;&amp;#x7684;&amp;#xFF0C;&amp;#x4E5F;&amp;#x6709;&amp;#x53EF;&amp;#x80FD;&amp;#x662F;&amp;#x9519;&amp;#x8BEF;&amp;#x7684;&amp;#xFF0C;&amp;#x5DF2;&amp;#x77E5;&amp;#x6761;&amp;#x4EF6;&amp;#x4E0D;&amp;#x8DB3;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#x6CA1;&amp;#x6709;&amp;#x7B54;&amp;#x6848;&amp;#x3002;&amp;#x5982;&amp;#x679C;&amp;#x8BA9;&amp;#x6211;&amp;#x6765;&amp;#x56DE;&amp;#x7B54;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x6211;&amp;#x5FC5;&amp;#x987B;&amp;#x8FD8;&amp;#x8981;&amp;#x77E5;&amp;#x9053;&amp;#x4EE5;&amp;#x4E0B;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x524D;&amp;#x63D0;&amp;#xFF0C;&amp;#x524D;&amp;#x63D0;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C;&amp;#x6211;&amp;#x80FD;&amp;#x7ED9;&amp;#x51FA;&amp;#x7684;&amp;#x7B54;&amp;#x6848;&amp;#x4E5F;&amp;#x5C31;&amp;#x4E0D;&amp;#x540C;&amp;#x3002;&amp;#x8981;&amp;#x56DE;&amp;#x7B54;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x8FD8;&amp;#x7F3A;&amp;#x5C11;&amp;#x54EA;&amp;#x4E9B;&amp;#x524D;&amp;#x63D0;&amp;#x6761;&amp;#x4EF6;&amp;#xFF1F;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#x524D;&amp;#x63D0;&amp;#x4E00;&amp;#xFF1A;id&amp;#x5217;&amp;#x662F;&amp;#x4E0D;&amp;#x662F;&amp;#x4E3B;&amp;#x952E;&amp;#xFF1F;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x524D;&amp;#x63D0;&amp;#x4E8C;&amp;#xFF1A;&amp;#x5F53;&amp;#x524D;&amp;#x7CFB;&amp;#x7EDF;&amp;#x7684;&amp;#x9694;&amp;#x79BB;&amp;#x7EA7;&amp;#x522B;&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x524D;&amp;#x63D0;&amp;#x4E09;&amp;#xFF1A;id&amp;#x5217;&amp;#x5982;&amp;#x679C;&amp;#x4E0D;&amp;#x662F;&amp;#x4E3B;&amp;#x952E;&amp;#xFF0C;&amp;#x90A3;&amp;#x4E48;id&amp;#x5217;&amp;#x4E0A;&amp;#x6709;&amp;#x7D22;&amp;#x5F15;&amp;#x5417;&amp;#xFF1F;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x524D;&amp;#x63D0;&amp;#x56DB;&amp;#xFF1A;id&amp;#x5217;&amp;#x4E0A;&amp;#x5982;&amp;#x679C;&amp;#x6709;&amp;#x4E8C;&amp;#x7EA7;&amp;#x7D22;&amp;#x5F15;&amp;#xFF0C;&amp;#x90A3;&amp;#x4E48;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7D22;&amp;#x5F15;&amp;#x662F;&amp;#x552F;&amp;#x4E00;&amp;#x7D22;&amp;#x5F15;&amp;#x5417;&amp;#xFF1F;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x524D;&amp;#x63D0;&amp;#x4E94;&amp;#xFF1A;&amp;#x4E24;&amp;#x4E2A;SQL&amp;#x7684;&amp;#x6267;&amp;#x884C;&amp;#x8BA1;&amp;#x5212;&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;&amp;#x7D22;&amp;#x5F15;&amp;#x626B;&amp;#x63CF;&amp;#xFF1F;&amp;#x5168;&amp;#x8868;&amp;#x626B;&amp;#x63CF;&amp;#xFF1F;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&quot;&amp;#x6B7B;&amp;#x9501;&amp;#x539F;&amp;#x7406;&amp;#x4E0E;&amp;#x5206;&amp;#x6790;&quot;&gt;&amp;#x6B7B;&amp;#x9501;&amp;#x539F;&amp;#x7406;&amp;#x4E0E;&amp;#x5206;&amp;#x6790;&lt;/h2&gt;&lt;p&gt;&amp;#x4E0B;&amp;#x9762;&amp;#xFF0C;&amp;#x6765;&amp;#x770B;&amp;#x770B;&amp;#x4E24;&amp;#x4E2A;&amp;#x6B7B;&amp;#x9501;&amp;#x7684;&amp;#x4F8B;&amp;#x5B50; (&amp;#x4E00;&amp;#x4E2A;&amp;#x662F;&amp;#x4E24;&amp;#x4E2A;Session&amp;#x7684;&amp;#x4E24;&amp;#x6761;SQL&amp;#x4EA7;&amp;#x751F;&amp;#x6B7B;&amp;#x9501;&amp;#xFF1B;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x662F;&amp;#x4E24;&amp;#x4E2A;Session&amp;#x7684;&amp;#x4E00;&amp;#x6761;SQL&amp;#xFF0C;&amp;#x4EA7;&amp;#x751F;&amp;#x6B7B;&amp;#x9501;)&amp;#xFF1A;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13623403/5f69683e-e5e1-11e5-8f6c-ad66e76bc412.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13623405/628a9786-e5e1-11e5-8097-22755ecf3877.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;&amp;#x4E0A;&amp;#x9762;&amp;#x7684;&amp;#x4E24;&amp;#x4E2A;&amp;#x6B7B;&amp;#x9501;&amp;#x7528;&amp;#x4F8B;&amp;#x3002;&amp;#x7B2C;&amp;#x4E00;&amp;#x4E2A;&amp;#x975E;&amp;#x5E38;&amp;#x597D;&amp;#x7406;&amp;#x89E3;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x6700;&amp;#x5E38;&amp;#x89C1;&amp;#x7684;&amp;#x6B7B;&amp;#x9501;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x4E8B;&amp;#x52A1;&amp;#x6267;&amp;#x884C;&amp;#x4E24;&amp;#x6761;SQL&amp;#xFF0C;&amp;#x5206;&amp;#x522B;&amp;#x6301;&amp;#x6709;&amp;#x4E86;&amp;#x4E00;&amp;#x628A;&amp;#x9501;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x52A0;&amp;#x53E6;&amp;#x4E00;&amp;#x628A;&amp;#x9501;&amp;#xFF0C;&amp;#x4EA7;&amp;#x751F;&amp;#x6B7B;&amp;#x9501;&lt;/p&gt;
&lt;p&gt;&amp;#x7B2C;&amp;#x4E8C;&amp;#x4E2A;&amp;#x7528;&amp;#x4F8B;&amp;#xFF0C;&amp;#x867D;&amp;#x7136;&amp;#x6BCF;&amp;#x4E2A;Session&amp;#x90FD;&amp;#x53EA;&amp;#x6709;&amp;#x4E00;&amp;#x6761;&amp;#x8BED;&amp;#x53E5;&amp;#xFF0C;&amp;#x4ECD;&amp;#x65E7;&amp;#x4F1A;&amp;#x4EA7;&amp;#x751F;&amp;#x6B7B;&amp;#x9501;&amp;#x3002;&amp;#x8981;&amp;#x5206;&amp;#x6790;&amp;#x8FD9;&amp;#x4E2A;&amp;#x6B7B;&amp;#x9501;&amp;#xFF0C;&amp;#x9996;&amp;#x5148;&amp;#x5FC5;&amp;#x987B;&amp;#x7528;&amp;#x5230;&amp;#x672C;&amp;#x6587;&amp;#x524D;&amp;#x9762;&amp;#x63D0;&amp;#x5230;&amp;#x7684;MySQL&amp;#x52A0;&amp;#x9501;&amp;#x7684;&amp;#x89C4;&amp;#x5219;&amp;#x3002;&amp;#x9488;&amp;#x5BF9;Session 1&amp;#xFF0C;&amp;#x4ECE;name&amp;#x7D22;&amp;#x5F15;&amp;#x51FA;&amp;#x53D1;&amp;#xFF0C;&amp;#x8BFB;&amp;#x5230;&amp;#x7684;[hdc, 1]&amp;#xFF0C;[hdc, 6]&amp;#x5747;&amp;#x6EE1;&amp;#x8DB3;&amp;#x6761;&amp;#x4EF6;&amp;#xFF0C;&amp;#x4E0D;&amp;#x4EC5;&amp;#x4F1A;&amp;#x52A0;name&amp;#x7D22;&amp;#x5F15;&amp;#x4E0A;&amp;#x7684;&amp;#x8BB0;&amp;#x5F55;X&amp;#x9501;&amp;#xFF0C;&amp;#x800C;&amp;#x4E14;&amp;#x4F1A;&amp;#x52A0;&amp;#x805A;&amp;#x7C07;&amp;#x7D22;&amp;#x5F15;&amp;#x4E0A;&amp;#x7684;&amp;#x8BB0;&amp;#x5F55;X&amp;#x9501;&amp;#xFF0C;&amp;#x52A0;&amp;#x9501;&amp;#x987A;&amp;#x5E8F;&amp;#x4E3A;&amp;#x5148;[1,hdc,100]&amp;#xFF0C;&amp;#x540E;[6,hdc,10]&amp;#x3002;&amp;#x800C;Session 2&amp;#xFF0C;&amp;#x4ECE;pubtime&amp;#x7D22;&amp;#x5F15;&amp;#x51FA;&amp;#x53D1;&amp;#xFF0C;[10,6],[100,1]&amp;#x5747;&amp;#x6EE1;&amp;#x8DB3;&amp;#x8FC7;&amp;#x6EE4;&amp;#x6761;&amp;#x4EF6;&amp;#xFF0C;&amp;#x540C;&amp;#x6837;&amp;#x4E5F;&amp;#x4F1A;&amp;#x52A0;&amp;#x805A;&amp;#x7C07;&amp;#x7D22;&amp;#x5F15;&amp;#x4E0A;&amp;#x7684;&amp;#x8BB0;&amp;#x5F55;X&amp;#x9501;&amp;#xFF0C;&amp;#x52A0;&amp;#x9501;&amp;#x987A;&amp;#x5E8F;&amp;#x4E3A;[6,hdc,10]&amp;#xFF0C;&amp;#x540E;[1,hdc,100]&amp;#x3002;&amp;#x53D1;&amp;#x73B0;&amp;#x6CA1;&amp;#x6709;&amp;#xFF0C;&amp;#x8DDF;Session 1&amp;#x7684;&amp;#x52A0;&amp;#x9501;&amp;#x987A;&amp;#x5E8F;&amp;#x6B63;&amp;#x597D;&amp;#x76F8;&amp;#x53CD;&amp;#xFF0C;&amp;#x5982;&amp;#x679C;&amp;#x4E24;&amp;#x4E2A;Session&amp;#x6070;&amp;#x597D;&amp;#x90FD;&amp;#x6301;&amp;#x6709;&amp;#x4E86;&amp;#x7B2C;&amp;#x4E00;&amp;#x628A;&amp;#x9501;&amp;#xFF0C;&amp;#x8BF7;&amp;#x6C42;&amp;#x52A0;&amp;#x7B2C;&amp;#x4E8C;&amp;#x628A;&amp;#x9501;&amp;#xFF0C;&amp;#x6B7B;&amp;#x9501;&amp;#x5C31;&amp;#x53D1;&amp;#x751F;&amp;#x4E86;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x7ED3;&amp;#x8BBA;&amp;#xFF1A;&amp;#x6B7B;&amp;#x9501;&amp;#x7684;&amp;#x53D1;&amp;#x751F;&amp;#x4E0E;&amp;#x5426;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E0D;&amp;#x5728;&amp;#x4E8E;&amp;#x4E8B;&amp;#x52A1;&amp;#x4E2D;&amp;#x6709;&amp;#x591A;&amp;#x5C11;&amp;#x6761;SQL&amp;#x8BED;&amp;#x53E5;&amp;#xFF0C;&amp;#x6B7B;&amp;#x9501;&amp;#x7684;&amp;#x5173;&amp;#x952E;&amp;#x5728;&amp;#x4E8E;&amp;#xFF1A;&amp;#x4E24;&amp;#x4E2A;(&amp;#x6216;&amp;#x4EE5;&amp;#x4E0A;)&amp;#x7684;Session&amp;#x52A0;&amp;#x9501;&amp;#x7684;&amp;#x987A;&amp;#x5E8F;&amp;#x4E0D;&amp;#x4E00;&amp;#x81F4;&amp;#x3002;&amp;#x800C;&amp;#x4F7F;&amp;#x7528;&amp;#x672C;&amp;#x6587;&amp;#x4E0A;&amp;#x9762;&amp;#x63D0;&amp;#x5230;&amp;#x7684;&amp;#xFF0C;&amp;#x5206;&amp;#x6790;MySQL&amp;#x6BCF;&amp;#x6761;SQL&amp;#x8BED;&amp;#x53E5;&amp;#x7684;&amp;#x52A0;&amp;#x9501;&amp;#x89C4;&amp;#x5219;&amp;#xFF0C;&amp;#x5206;&amp;#x6790;&amp;#x51FA;&amp;#x6BCF;&amp;#x6761;&amp;#x8BED;&amp;#x53E5;&amp;#x7684;&amp;#x52A0;&amp;#x9501;&amp;#x987A;&amp;#x5E8F;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x68C0;&amp;#x67E5;&amp;#x591A;&amp;#x4E2A;&amp;#x5E76;&amp;#x53D1;SQL&amp;#x95F4;&amp;#x662F;&amp;#x5426;&amp;#x5B58;&amp;#x5728;&amp;#x4EE5;&amp;#x76F8;&amp;#x53CD;&amp;#x7684;&amp;#x987A;&amp;#x5E8F;&amp;#x52A0;&amp;#x9501;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#xFF0C;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x5206;&amp;#x6790;&amp;#x51FA;&amp;#x5404;&amp;#x79CD;&amp;#x6F5C;&amp;#x5728;&amp;#x7684;&amp;#x6B7B;&amp;#x9501;&amp;#x60C5;&amp;#x51B5;&amp;#xFF0C;&amp;#x4E5F;&amp;#x53EF;&amp;#x4EE5;&amp;#x5206;&amp;#x6790;&amp;#x51FA;&amp;#x7EBF;&amp;#x4E0A;&amp;#x6B7B;&amp;#x9501;&amp;#x53D1;&amp;#x751F;&amp;#x7684;&amp;#x539F;&amp;#x56E0;&amp;#x3002;&lt;/p&gt;
&lt;h1 id=&quot;&amp;#x7D22;&amp;#x5F15;&amp;#x4F18;&amp;#x5316;&quot;&gt;&amp;#x7D22;&amp;#x5F15;&amp;#x4F18;&amp;#x5316;&lt;/h1&gt;&lt;h2 id=&quot;&amp;#x9009;&amp;#x62E9;&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x7C7B;&amp;#x578B;&quot;&gt;&amp;#x9009;&amp;#x62E9;&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x7C7B;&amp;#x578B;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#x8D8A;&amp;#x5C0F;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x7C7B;&amp;#x578B;&amp;#x901A;&amp;#x5E38;&amp;#x66F4;&amp;#x597D;&amp;#xFF1A;&amp;#x8D8A;&amp;#x5C0F;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x7C7B;&amp;#x578B;&amp;#x901A;&amp;#x5E38;&amp;#x5728;&amp;#x78C1;&amp;#x76D8;&amp;#x3001;&amp;#x5185;&amp;#x5B58;&amp;#x548C;CPU&amp;#x7F13;&amp;#x5B58;&amp;#x4E2D;&amp;#x90FD;&amp;#x9700;&amp;#x8981;&amp;#x66F4;&amp;#x5C11;&amp;#x7684;&amp;#x7A7A;&amp;#x95F4;&amp;#xFF0C;&amp;#x5904;&amp;#x7406;&amp;#x8D77;&amp;#x6765;&amp;#x66F4;&amp;#x5FEB;&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x7B80;&amp;#x5355;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x7C7B;&amp;#x578B;&amp;#x66F4;&amp;#x597D;&amp;#xFF1A;&amp;#x6574;&amp;#x578B;&amp;#x6570;&amp;#x636E;&amp;#x6BD4;&amp;#x8D77;&amp;#x5B57;&amp;#x7B26;&amp;#xFF0C;&amp;#x5904;&amp;#x7406;&amp;#x5F00;&amp;#x9500;&amp;#x66F4;&amp;#x5C0F;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x5B57;&amp;#x7B26;&amp;#x4E32;&amp;#x7684;&amp;#x6BD4;&amp;#x8F83;&amp;#x66F4;&amp;#x590D;&amp;#x6742;&amp;#x3002;&amp;#x5728;MySQL&amp;#x4E2D;&amp;#xFF0C;&amp;#x5E94;&amp;#x8BE5;&amp;#x7528;&amp;#x5185;&amp;#x7F6E;&amp;#x7684;&amp;#x65E5;&amp;#x671F;&amp;#x548C;&amp;#x65F6;&amp;#x95F4;&amp;#x6570;&amp;#x636E;&amp;#x7C7B;&amp;#x578B;&amp;#xFF0C;&amp;#x800C;&amp;#x4E0D;&amp;#x662F;&amp;#x7528;&amp;#x5B57;&amp;#x7B26;&amp;#x4E32;&amp;#x6765;&amp;#x5B58;&amp;#x50A8;&amp;#x65F6;&amp;#x95F4;&amp;#xFF1B;&amp;#x4EE5;&amp;#x53CA;&amp;#x7528;&amp;#x6574;&amp;#x578B;&amp;#x6570;&amp;#x636E;&amp;#x7C7B;&amp;#x578B;&amp;#x5B58;&amp;#x50A8;IP&amp;#x5730;&amp;#x5740;&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x5C3D;&amp;#x91CF;&amp;#x907F;&amp;#x514D;NULL&amp;#xFF1A;&amp;#x5E94;&amp;#x8BE5;&amp;#x6307;&amp;#x5B9A;&amp;#x5217;&amp;#x4E3A;NOT NULL&amp;#xFF0C;&amp;#x9664;&amp;#x975E;&amp;#x4F60;&amp;#x60F3;&amp;#x5B58;&amp;#x50A8;NULL&amp;#x3002;&amp;#x5728;MySQL&amp;#x4E2D;&amp;#xFF0C;&amp;#x542B;&amp;#x6709;&amp;#x7A7A;&amp;#x503C;&amp;#x7684;&amp;#x5217;&amp;#x5F88;&amp;#x96BE;&amp;#x8FDB;&amp;#x884C;&amp;#x67E5;&amp;#x8BE2;&amp;#x4F18;&amp;#x5316;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x5B83;&amp;#x4EEC;&amp;#x4F7F;&amp;#x5F97;&amp;#x7D22;&amp;#x5F15;&amp;#x3001;&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#x7EDF;&amp;#x8BA1;&amp;#x4FE1;&amp;#x606F;&amp;#x4EE5;&amp;#x53CA;&amp;#x6BD4;&amp;#x8F83;&amp;#x8FD0;&amp;#x7B97;&amp;#x66F4;&amp;#x52A0;&amp;#x590D;&amp;#x6742;&amp;#x3002;&amp;#x4F60;&amp;#x5E94;&amp;#x8BE5;&amp;#x7528;0&amp;#x3001;&amp;#x4E00;&amp;#x4E2A;&amp;#x7279;&amp;#x6B8A;&amp;#x7684;&amp;#x503C;&amp;#x6216;&amp;#x8005;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A7A;&amp;#x4E32;&amp;#x4EE3;&amp;#x66FF;&amp;#x7A7A;&amp;#x503C;&amp;#x3002;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&quot;faq&quot;&gt;FAQ&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&lt;p&gt;like&amp;#x4E0D;&amp;#x80FD;&amp;#x7528;&amp;#x7D22;&amp;#x5F15;&amp;#xFF1F;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x5C3D;&amp;#x91CF;&amp;#x51CF;&amp;#x5C11;like&amp;#xFF0C;&amp;#x4F46;&amp;#x4E0D;&amp;#x662F;&amp;#x7EDD;&amp;#x5BF9;&amp;#x4E0D;&amp;#x53EF;&amp;#x7528;&amp;#xFF0C;&amp;#x201D;xxxx%&amp;#x201D; &amp;#x662F;&amp;#x53EF;&amp;#x4EE5;&amp;#x7528;&amp;#x5230;&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#xFF0C;&lt;br&gt;&amp;#x9664;&amp;#x4E86;like&amp;#xFF0C;&amp;#x4EE5;&amp;#x4E0B;&amp;#x64CD;&amp;#x4F5C;&amp;#x7B26;&amp;#x4E5F;&amp;#x53EF;&amp;#x7528;&amp;#x5230;&amp;#x7D22;&amp;#x5F15;&amp;#xFF1A;&lt;br&gt;&amp;lt;&amp;#xFF0C;&amp;lt;=&amp;#xFF0C;=&amp;#xFF0C;&amp;gt;&amp;#xFF0C;&amp;gt;=&amp;#xFF0C;BETWEEN&amp;#xFF0C;IN&lt;br&gt;&amp;lt;&amp;gt;&amp;#xFF0C;not in &amp;#xFF0C;&amp;#xFF01;=&amp;#x5219;&amp;#x4E0D;&amp;#x884C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x4EC0;&amp;#x4E48;&amp;#x6837;&amp;#x7684;&amp;#x5B57;&amp;#x6BB5;&amp;#x4E0D;&amp;#x9002;&amp;#x5408;&amp;#x5EFA;&amp;#x7D22;&amp;#x5F15;&amp;#xFF1F;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x4E00;&amp;#x822C;&amp;#x6765;&amp;#x8BF4;&amp;#xFF0C;&amp;#x5217;&amp;#x7684;&amp;#x503C;&amp;#x552F;&amp;#x4E00;&amp;#x6027;&amp;#x592A;&amp;#x5C0F;&amp;#xFF08;&amp;#x5982;&amp;#x6027;&amp;#x522B;&amp;#xFF0C;&amp;#x7C7B;&amp;#x578B;&amp;#x4EC0;&amp;#x4E48;&amp;#x7684;&amp;#xFF09;&amp;#xFF0C;&amp;#x4E0D;&amp;#x9002;&amp;#x5408;&amp;#x5EFA;&amp;#x7D22;&amp;#x5F15;&amp;#xFF08;&amp;#x600E;&amp;#x6837;&amp;#x53EB;&amp;#x592A;&amp;#x5C0F;&amp;#xFF1F;&amp;#x4E00;&amp;#x534A;&amp;#x8BF4;&amp;#x6765;&amp;#xFF0C;&amp;#x540C;&amp;#x503C;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x8D85;&amp;#x8FC7;&amp;#x8868;&amp;#x7684;&amp;#x767E;&amp;#x5206;&amp;#x4E4B;15&amp;#xFF0C;&amp;#x90A3;&amp;#x5C31;&amp;#x6CA1;&amp;#x5FC5;&amp;#x8981;&amp;#x5EFA;&amp;#x7D22;&amp;#x5F15;&amp;#x4E86;&amp;#xFF09;&lt;br&gt;&amp;#x592A;&amp;#x957F;&amp;#x7684;&amp;#x5217;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x9009;&amp;#x62E9;&amp;#x53EA;&amp;#x5EFA;&amp;#x7ACB;&amp;#x90E8;&amp;#x5206;&amp;#x7D22;&amp;#x5F15;&amp;#xFF0C;&amp;#xFF08;&amp;#x5982;&amp;#xFF1A;&amp;#x53EA;&amp;#x53D6;&amp;#x524D;&amp;#x5341;&amp;#x4F4D;&amp;#x505A;&amp;#x7D22;&amp;#x5F15;&amp;#xFF09;&lt;br&gt;&amp;#x66F4;&amp;#x65B0;&amp;#x975E;&amp;#x5E38;&amp;#x9891;&amp;#x7E41;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x4E0D;&amp;#x9002;&amp;#x5B9C;&amp;#x5EFA;&amp;#x7D22;&amp;#x5F15;&amp;#xFF08;&amp;#x600E;&amp;#x6837;&amp;#x53EB;&amp;#x975E;&amp;#x5E38;&amp;#xFF1F;&amp;#x610F;&amp;#x4F1A;&amp;#xFF09;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x4E00;&amp;#x6B21;&amp;#x67E5;&amp;#x8BE2;&amp;#x80FD;&amp;#x7528;&amp;#x591A;&amp;#x4E2A;&amp;#x7D22;&amp;#x5F15;&amp;#x5417;?&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x4E0D;&amp;#x80FD;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x591A;&amp;#x5217;&amp;#x67E5;&amp;#x8BE2;&amp;#x8BE5;&amp;#x5982;&amp;#x4F55;&amp;#x5EFA;&amp;#x7D22;&amp;#x5F15;?&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x4E00;&amp;#x6B21;&amp;#x67E5;&amp;#x8BE2;&amp;#x53EA;&amp;#x80FD;&amp;#x7528;&amp;#x5230;&amp;#x4E00;&amp;#x4E2A;&amp;#x7D22;&amp;#x5F15;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5; &amp;#x9996;&amp;#x5148;&amp;#x67AA;&amp;#x6BD9; a&amp;#xFF0C;b&amp;#x5404;&amp;#x5EFA;&amp;#x7D22;&amp;#x5F15;&amp;#x65B9;&amp;#x6848;&lt;br&gt;a&amp;#x8FD8;&amp;#x662F;b&amp;#xFF1F; &amp;#x8C01;&amp;#x7684;&amp;#x533A;&amp;#x5206;&amp;#x5EA6;&amp;#x66F4;&amp;#x9AD8;&amp;#xFF08;&amp;#x540C;&amp;#x503C;&amp;#x7684;&amp;#x6700;&amp;#x5C11;&amp;#xFF09;&amp;#xFF0C;&amp;#x5EFA;&amp;#x8C01;&amp;#xFF01;&lt;br&gt;&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x8054;&amp;#x5408;&amp;#x7D22;&amp;#x5F15;&amp;#x4E5F;&amp;#x662F;&amp;#x4E2A;&amp;#x4E0D;&amp;#x9519;&amp;#x7684;&amp;#x65B9;&amp;#x6848;&amp;#xFF0C;ab&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;ba&amp;#xFF0C;&amp;#x5219;&amp;#x540C;&amp;#x4E0A;&amp;#xFF0C;&amp;#x533A;&amp;#x5206;&amp;#x5EA6;&amp;#x9AD8;&amp;#x8005;&amp;#xFF0C;&amp;#x5728;&amp;#x524D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x8054;&amp;#x5408;&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#x95EE;&amp;#x9898;?&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;where a = &amp;#x201C;xxx&amp;#x201D; &amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x7528; AB &amp;#x8054;&amp;#x5408;&amp;#x7D22;&amp;#x5F15;&lt;br&gt;where b = &amp;#x201C;xxx&amp;#x201D; &amp;#x5219;&amp;#x4E0D;&amp;#x53EF; &amp;#xFF08;&amp;#x518D;&amp;#x60F3;&amp;#x8C61;&amp;#x4E00;&amp;#x4E0B;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x4E66;&amp;#x7684;&amp;#x76EE;&amp;#x5F55;&amp;#xFF1F;&amp;#xFF09;&lt;br&gt;&amp;#x6240;&amp;#x4EE5;&amp;#xFF0C;&amp;#x5927;&amp;#x591A;&amp;#x6570;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0B;&amp;#xFF0C;&amp;#x6709;AB&amp;#x7D22;&amp;#x5F15;&amp;#x4E86;&amp;#xFF0C;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x4E0D;&amp;#x7528;&amp;#x5728;&amp;#x53BB;&amp;#x5EFA;&amp;#x4E00;&amp;#x4E2A;A&amp;#x7D22;&amp;#x5F15;&amp;#x4E86;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x54EA;&amp;#x4E9B;&amp;#x5E38;&amp;#x89C1;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0D;&amp;#x80FD;&amp;#x7528;&amp;#x7D22;&amp;#x5F15;?&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;like &amp;#x201C;%xxx&amp;#x201D;&lt;br&gt;not in &amp;#xFF0C; &amp;#xFF01;=&lt;br&gt;&amp;#x5BF9;&amp;#x5217;&amp;#x8FDB;&amp;#x884C;&amp;#x51FD;&amp;#x6570;&amp;#x8FD0;&amp;#x7B97;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#xFF08;&amp;#x5982; where md5(password) = &amp;#x201C;xxxx&amp;#x201D;&amp;#xFF09;&lt;br&gt;WHERE index=1 OR A=10&lt;br&gt;&amp;#x5B58;&amp;#x4E86;&amp;#x6570;&amp;#x503C;&amp;#x7684;&amp;#x5B57;&amp;#x7B26;&amp;#x4E32;&amp;#x7C7B;&amp;#x578B;&amp;#x5B57;&amp;#x6BB5;&amp;#xFF08;&amp;#x5982;&amp;#x624B;&amp;#x673A;&amp;#x53F7;&amp;#xFF09;&amp;#xFF0C;&amp;#x67E5;&amp;#x8BE2;&amp;#x65F6;&amp;#x8BB0;&amp;#x5F97;&amp;#x4E0D;&amp;#x8981;&amp;#x4E22;&amp;#x6389;&amp;#x503C;&amp;#x7684;&amp;#x5F15;&amp;#x53F7;&amp;#xFF0C;&amp;#x5426;&amp;#x5219;&amp;#x65E0;&amp;#x6CD5;&amp;#x7528;&amp;#x5230;&amp;#x8BE5;&amp;#x5B57;&amp;#x6BB5;&amp;#x76F8;&amp;#x5173;&amp;#x7D22;&amp;#x5F15;&amp;#xFF0C;&amp;#x53CD;&amp;#x4E4B;&amp;#x5219;&amp;#x6CA1;&amp;#x5173;&amp;#x7CFB;&lt;br&gt;&amp;#x4E5F;&amp;#x5373;&lt;br&gt;select * from test where mobile = 13711112222;&lt;br&gt;&amp;#x53EF;&amp;#x662F;&amp;#x65E0;&amp;#x6CD5;&amp;#x7528;&amp;#x5230;mobile&amp;#x5B57;&amp;#x6BB5;&amp;#x7684;&amp;#x7D22;&amp;#x5F15;&amp;#x7684;&amp;#x54E6;&amp;#xFF08;&amp;#x5982;&amp;#x679C;mobile&amp;#x662F;char &amp;#x6216; varchar&amp;#x7C7B;&amp;#x578B;&amp;#x7684;&amp;#x8BDD;&amp;#xFF09;&lt;br&gt;btw&amp;#xFF0C;&amp;#x5343;&amp;#x4E07;&amp;#x4E0D;&amp;#x8981;&amp;#x5C1D;&amp;#x8BD5;&amp;#x7528;int&amp;#x6765;&amp;#x5B58;&amp;#x624B;&amp;#x673A;&amp;#x53F7;&amp;#xFF08;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;&amp;#x81EA;&amp;#x5DF1;&amp;#x60F3;&amp;#xFF01;&amp;#x8981;&amp;#x4E0D;&amp;#x81EA;&amp;#x5DF1;&amp;#x8BD5;&amp;#x8BD5;&amp;#xFF09;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;NULL &amp;#x7684;&amp;#x95EE;&amp;#x9898;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;NULL&amp;#x4F1A;&amp;#x5BFC;&amp;#x81F4;&amp;#x7D22;&amp;#x5F15;&amp;#x5F62;&amp;#x540C;&amp;#x865A;&amp;#x8BBE;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x5728;&amp;#x8BBE;&amp;#x8BA1;&amp;#x8868;&amp;#x7ED3;&amp;#x6784;&amp;#x65F6;&amp;#x5E94;&amp;#x907F;&amp;#x514D;NULL &amp;#x7684;&amp;#x5B58;&amp;#x5728;&amp;#xFF08;&amp;#x7528;&amp;#x5176;&amp;#x4ED6;&amp;#x65B9;&amp;#x5F0F;&amp;#x8868;&amp;#x8FBE;&amp;#x4F60;&amp;#x60F3;&amp;#x8868;&amp;#x8FBE;&amp;#x7684;NULL&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982; -1&amp;#xFF1F;&amp;#xFF09;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x5982;&amp;#x4F55;&amp;#x67E5;&amp;#x770B;&amp;#x7D22;&amp;#x5F15;&amp;#x4FE1;&amp;#x606F;&amp;#xFF0C;&amp;#x5982;&amp;#x4F55;&amp;#x5206;&amp;#x6790;&amp;#x662F;&amp;#x5426;&amp;#x6B63;&amp;#x786E;&amp;#x7528;&amp;#x5230;&amp;#x7D22;&amp;#x5F15;?&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;show index from tablename;&lt;br&gt;explain select &amp;#x2026;&amp;#x2026;;&lt;br&gt;&amp;#x5173;&amp;#x4E8E;explain&amp;#xFF0C;&amp;#x6539;&amp;#x5929;&amp;#x53EF;&amp;#x4EE5;&amp;#x627E;&amp;#x4E2A;&amp;#x65F6;&amp;#x95F4;&amp;#x4E13;&amp;#x95E8;&amp;#x5199;&amp;#x4E00;&amp;#x7BC7;&amp;#x5165;&amp;#x95E8;&amp;#x5E16;&amp;#xFF0C;&amp;#x5728;&amp;#x6B64;&amp;#x4E4B;&amp;#x524D;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x5C1D;&amp;#x8BD5; google&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;/ol&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;&amp;#x78C1;
    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>一些插件</title>
    <link href="http://leeboyue.com/2016/03/07/%E4%B8%80%E4%BA%9B%E6%8F%92%E4%BB%B6/"/>
    <id>http://leeboyue.com/2016/03/07/一些插件/</id>
    <published>2016-03-07T07:24:06.000Z</published>
    <updated>2016-03-09T03:42:32.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;echart&quot;&gt;echart&lt;/h1&gt;&lt;div id=&quot;echarts7409&quot; style=&quot;width: 81%;height: 400px;margin: 0 auto&quot;&gt;&lt;/div&gt;
&lt;script type=&quot;text/javascript&quot;&gt;
        // 基于准备好的dom，初始化echarts实例
        var myChart = echarts.init(document.getElementById(&#39;echarts7409&#39;));

        // 指定图表的配置项和数据
        var option = {
    tooltip : {
        trigger: &#39;axis&#39;,
        axisPointer : {            // 坐标轴指示器，坐标轴触发有效
            type : &#39;shadow&#39;        // 默认为直线，可选为：&#39;line&#39; | &#39;shadow&#39;
        }
    },
    legend: {
        data:[&#39;利润&#39;, &#39;支出&#39;, &#39;收入&#39;]
    },
    grid: {
        left: &#39;3%&#39;,
        right: &#39;4%&#39;,
        bottom: &#39;3%&#39;,
        containLabel: true
    },
    xAxis : [
        {
            type : &#39;value&#39;
        }
    ],
    yAxis : [
        {
            type : &#39;category&#39;,
            axisTick : {show: false},
            data : [&#39;周一&#39;,&#39;周二&#39;,&#39;周三&#39;,&#39;周四&#39;,&#39;周五&#39;,&#39;周六&#39;,&#39;周日&#39;]
        }
    ],
    series : [
        {
            name:&#39;利润&#39;,
            type:&#39;bar&#39;,
            itemStyle : {
                normal: {
                    label: {show: true, position: &#39;inside&#39;}
                }
            },
            data:[200, 170, 240, 244, 200, 220, 210]
        },
        {
            name:&#39;收入&#39;,
            type:&#39;bar&#39;,
            stack: &#39;总量&#39;,
            itemStyle: {
                normal: {
                    label : {show: true}
                }
            },
            data:[320, 302, 341, 374, 390, 450, 420]
        },
        {
            name:&#39;支出&#39;,
            type:&#39;bar&#39;,
            stack: &#39;总量&#39;,
            itemStyle: {normal: {
                label : {show: true, position: &#39;left&#39;}
            }},
            data:[-120, -132, -101, -134, -190, -230, -210]
        }
    ]
};

        // 使用刚指定的配置项和数据显示图表。
        myChart.setOption(option);
&lt;/script&gt;
&lt;h1 id=&quot;&amp;#x79D1;&amp;#x5B66;&amp;#x8BA1;&amp;#x7B97;&quot;&gt;&amp;#x79D1;&amp;#x5B66;&amp;#x8BA1;&amp;#x7B97;&lt;/h1&gt;&lt;div id=&quot;badge-container-akfish-hexo-math-b82e65&quot; class=&quot;hexo-github&quot; style=&quot;width: 100%&quot;&gt;&lt;/div&gt;
&lt;script src=&quot;/hexo-github/badge.js&quot;&gt;&lt;/script&gt;
&lt;script type=&quot;text/javascript&quot;&gt;
  loadStyle(&quot;/hexo-github/style.css&quot;);
  loadStyle(&quot;/hexo-github/octicons/octicons.css&quot;);
  new Badge(&quot;#badge-container-akfish-hexo-math-b82e65&quot;, &quot;akfish&quot;, &quot;hexo-math&quot;, &quot;b82e65&quot;, false);
&lt;/script&gt;

&lt;h1 id=&quot;&amp;#x5D4C;&amp;#x5165;pdf&quot;&gt;&amp;#x5D4C;&amp;#x5165;pdf&lt;/h1&gt;

	&lt;div class=&quot;row&quot;&gt;
	  &lt;iframe src=&quot;http://nagland.github.io/viewer/web/viewer.html?val=http://7xov2f.com1.z0.glb.clouddn.com/bash_freshman.pdf&quot; style=&quot;width:100%; height:550px&quot;&gt;&lt;/iframe&gt;
	&lt;/div&gt;



&lt;h1 id=&quot;&amp;#x5D4C;&amp;#x5165;&amp;#x4F18;&amp;#x9177;&amp;#x89C6;&amp;#x9891;&quot;&gt;&amp;#x5D4C;&amp;#x5165;&amp;#x4F18;&amp;#x9177;&amp;#x89C6;&amp;#x9891;&lt;/h1&gt;&lt;iframe height=&quot;480&quot; width=&quot;400&quot; src=&quot;http://player.youku.com/embed/XMTQ2MjU2NTU2OA&quot; frameborder=&quot;0&quot; allowfullscreen&gt;&lt;/iframe&gt;
&lt;h1 id=&quot;&amp;#x8F6C;&amp;#x4E49;&amp;#x5B57;&amp;#x7B26;&quot;&gt;&amp;#x8F6C;&amp;#x4E49;&amp;#x5B57;&amp;#x7B26;&lt;/h1&gt;&lt;ruby&gt;Base&lt;rp&gt; (&lt;/rp&gt;&lt;rt&gt;top&lt;/rt&gt;&lt;rp&gt;) &lt;/rp&gt;&lt;/ruby&gt;
&lt;ruby&gt;&amp;#x4F50;&amp;#x5929;&amp;#x6CEA;&amp;#x5B50;&lt;rp&gt; (&lt;/rp&gt;&lt;rt&gt;xi&amp;#x101;n q&amp;#xFA;n ku&amp;#xE1;ng m&amp;#xF3;&lt;/rt&gt;&lt;rp&gt;) &lt;/rp&gt;&lt;/ruby&gt;
&lt;ruby&gt;&amp;#x8D85;&amp;#x96FB;&amp;#x78C1;&amp;#x7832;&lt;rp&gt; (&lt;/rp&gt;&lt;rt&gt;&amp;#x30EC;&amp;#x30FC;&amp;#x30EB;&amp;#x30AC;&amp;#x30F3;&lt;/rt&gt;&lt;rp&gt;) &lt;/rp&gt;&lt;/ruby&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;echart&quot;&gt;
    
    </summary>
    
      <category term="技术" scheme="http://leeboyue.com/categories/%E6%8A%80%E6%9C%AF/"/>
    
    
      <category term="plugins" scheme="http://leeboyue.com/tags/plugins/"/>
    
  </entry>
  
  <entry>
    <title>期盼已久的offer</title>
    <link href="http://leeboyue.com/2016/03/04/%E6%9C%9F%E7%9B%BC%E5%B7%B2%E4%B9%85%E7%9A%84offer/"/>
    <id>http://leeboyue.com/2016/03/04/期盼已久的offer/</id>
    <published>2016-03-04T15:35:04.000Z</published>
    <updated>2016-03-07T07:26:49.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&amp;#x7EC8;&amp;#x4E8E;&amp;#xFF01;&amp;#x7EC8;&amp;#x4E8E;&amp;#x7B49;&amp;#x5230;&amp;#x4E86;&amp;#x963F;&amp;#x91CC;offer&amp;#xFF0C;&amp;#x771F;&amp;#x7684;&amp;#x662F;&amp;#x5F88;&amp;#x5174;&amp;#x594B;&amp;#xFF0C;&amp;#x6709;&amp;#x79CD;&amp;#x68A6;&amp;#x60F3;&amp;#x6210;&amp;#x771F;&amp;#x7684;&amp;#x611F;&amp;#x89C9;&amp;#xFF01;&amp;#x6EE1;&amp;#x6EE1;&amp;#x7684;&amp;#x52A8;&amp;#x529B;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5FD8;&amp;#x521D;&amp;#x5FC3;&amp;#xFF0C;&amp;#x52AA;&amp;#x529B;&amp;#x5411;&amp;#x524D;&amp;#xFF01;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&amp;#x7EC8;&amp;#x4E
    
    </summary>
    
      <category term="随笔" scheme="http://leeboyue.com/categories/%E9%9A%8F%E7%AC%94/"/>
    
    
      <category term="阿里巴巴" scheme="http://leeboyue.com/tags/%E9%98%BF%E9%87%8C%E5%B7%B4%E5%B7%B4/"/>
    
  </entry>
  
  <entry>
    <title>互联网金融体系</title>
    <link href="http://leeboyue.com/2016/03/02/%E4%BA%92%E8%81%94%E7%BD%91%E9%87%91%E8%9E%8D%E4%BD%93%E7%B3%BB/"/>
    <id>http://leeboyue.com/2016/03/02/互联网金融体系/</id>
    <published>2016-03-02T11:44:49.000Z</published>
    <updated>2016-03-07T07:26:13.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;&amp;#x6982;&amp;#x8981;&quot;&gt;&amp;#x6982;&amp;#x8981;&lt;/h1&gt;&lt;h2 id=&quot;&amp;#x5BF9;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x91D1;&amp;#x878D;&amp;#x7684;&amp;#x7406;&amp;#x89E3;&quot;&gt;&amp;#x5BF9;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x91D1;&amp;#x878D;&amp;#x7684;&amp;#x7406;&amp;#x89E3;&lt;/h2&gt;&lt;p&gt;&amp;#x672A;&amp;#x5B8C;&amp;#x5F85;&amp;#x7EED;~&lt;br&gt;&lt;img src=&quot;/2016/03/02/&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x91D1;&amp;#x878D;&amp;#x4F53;&amp;#x7CFB;/&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x91D1;&amp;#x878D;.jpg&quot; alt=&quot;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x91D1;&amp;#x878D;&amp;#x4F53;&amp;#x7CFB;&quot;&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;&amp;#x6982;
    
    </summary>
    
    
      <category term="心得" scheme="http://leeboyue.com/tags/%E5%BF%83%E5%BE%97/"/>
    
  </entry>
  
  <entry>
    <title>网络通讯</title>
    <link href="http://leeboyue.com/2016/03/01/%E7%BD%91%E7%BB%9C%E9%80%9A%E8%AE%AF/"/>
    <id>http://leeboyue.com/2016/03/01/网络通讯/</id>
    <published>2016-03-01T09:40:47.000Z</published>
    <updated>2016-03-02T09:43:03.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;&amp;#x4E00;&amp;#x7F51;&amp;#x7EDC;&amp;#x7F16;&amp;#x7A0B;&amp;#x4E2D;&amp;#x4E24;&amp;#x4E2A;&amp;#x4E3B;&amp;#x8981;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&quot;&gt;&amp;#x4E00;&amp;#x3001;&amp;#x7F51;&amp;#x7EDC;&amp;#x7F16;&amp;#x7A0B;&amp;#x4E2D;&amp;#x4E24;&amp;#x4E2A;&amp;#x4E3B;&amp;#x8981;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&lt;/h1&gt;&lt;p&gt;&amp;#x4E00;&amp;#x4E2A;&amp;#x662F;&amp;#x5982;&amp;#x4F55;&amp;#x51C6;&amp;#x786E;&amp;#x7684;&amp;#x5B9A;&amp;#x4F4D;&amp;#x7F51;&amp;#x7EDC;&amp;#x4E0A;&amp;#x4E00;&amp;#x53F0;&amp;#x6216;&amp;#x591A;&amp;#x53F0;&amp;#x4E3B;&amp;#x673A;&amp;#xFF0C;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x5C31;&amp;#x662F;&amp;#x627E;&amp;#x5230;&amp;#x4E3B;&amp;#x673A;&amp;#x540E;&amp;#x5982;&amp;#x4F55;&amp;#x53EF;&amp;#x9760;&amp;#x9AD8;&amp;#x6548;&amp;#x7684;&amp;#x8FDB;&amp;#x884C;&amp;#x6570;&amp;#x636E;&amp;#x4F20;&amp;#x8F93;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5728;TCP/IP&amp;#x534F;&amp;#x8BAE;&amp;#x4E2D;IP&amp;#x5C42;&amp;#x4E3B;&amp;#x8981;&amp;#x8D1F;&amp;#x8D23;&amp;#x7F51;&amp;#x7EDC;&amp;#x4E3B;&amp;#x673A;&amp;#x7684;&amp;#x5B9A;&amp;#x4F4D;&amp;#xFF0C;&amp;#x6570;&amp;#x636E;&amp;#x4F20;&amp;#x8F93;&amp;#x7684;&amp;#x8DEF;&amp;#x7531;&amp;#xFF0C;&amp;#x7531;IP&amp;#x5730;&amp;#x5740;&amp;#x53EF;&amp;#x4EE5;&amp;#x552F;&amp;#x4E00;&amp;#x5730;&amp;#x786E;&amp;#x5B9A;Internet&amp;#x4E0A;&amp;#x7684;&amp;#x4E00;&amp;#x53F0;&amp;#x4E3B;&amp;#x673A;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x800C;TCP&amp;#x5C42;&amp;#x5219;&amp;#x63D0;&amp;#x4F9B;&amp;#x9762;&amp;#x5411;&amp;#x5E94;&amp;#x7528;&amp;#x7684;&amp;#x53EF;&amp;#x9760;&amp;#xFF08;tcp&amp;#xFF09;&amp;#x7684;&amp;#x6216;&amp;#x975E;&amp;#x53EF;&amp;#x9760;&amp;#xFF08;UDP&amp;#xFF09;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x4F20;&amp;#x8F93;&amp;#x673A;&amp;#x5236;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x7F51;&amp;#x7EDC;&amp;#x7F16;&amp;#x7A0B;&amp;#x7684;&amp;#x4E3B;&amp;#x8981;&amp;#x5BF9;&amp;#x8C61;&amp;#xFF0C;&amp;#x4E00;&amp;#x822C;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x5173;&amp;#x5FC3;IP&amp;#x5C42;&amp;#x662F;&amp;#x5982;&amp;#x4F55;&amp;#x5904;&amp;#x7406;&amp;#x6570;&amp;#x636E;&amp;#x7684;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x76EE;&amp;#x524D;&amp;#x8F83;&amp;#x4E3A;&amp;#x6D41;&amp;#x884C;&amp;#x7684;&amp;#x7F51;&amp;#x7EDC;&amp;#x7F16;&amp;#x7A0B;&amp;#x6A21;&amp;#x578B;&amp;#x662F;&amp;#x5BA2;&amp;#x6237;&amp;#x673A;/&amp;#x670D;&amp;#x52A1;&amp;#x5668;&amp;#xFF08;C/S&amp;#xFF09;&amp;#x7ED3;&amp;#x6784;&amp;#x3002;&amp;#x5373;&amp;#x901A;&amp;#x4FE1;&amp;#x53CC;&amp;#x65B9;&amp;#x4E00;&amp;#x65B9;&amp;#x4F5C;&amp;#x4E3A;&amp;#x670D;&amp;#x52A1;&amp;#x5668;&amp;#x7B49;&amp;#x5F85;&amp;#x5BA2;&amp;#x6237;&amp;#x63D0;&amp;#x51FA;&amp;#x8BF7;&amp;#x6C42;&amp;#x5E76;&amp;#x4E88;&amp;#x4EE5;&amp;#x54CD;&amp;#x5E94;&amp;#x3002;&amp;#x5BA2;&amp;#x6237;&amp;#x5219;&amp;#x5728;&amp;#x9700;&amp;#x8981;&amp;#x670D;&amp;#x52A1;&amp;#x65F6;&amp;#x5411;&amp;#x670D;&amp;#x52A1;&amp;#x5668;&amp;#x63D0; &amp;#x51FA;&amp;#x7533;&amp;#x8BF7;&amp;#x3002;&amp;#x670D;&amp;#x52A1;&amp;#x5668;&amp;#x4E00;&amp;#x822C;&amp;#x4F5C;&amp;#x4E3A;&amp;#x5B88;&amp;#x62A4;&amp;#x8FDB;&amp;#x7A0B;&amp;#x59CB;&amp;#x7EC8;&amp;#x8FD0;&amp;#x884C;&amp;#xFF0C;&amp;#x76D1;&amp;#x542C;&amp;#x7F51;&amp;#x7EDC;&amp;#x7AEF;&amp;#x53E3;&amp;#xFF0C;&amp;#x4E00;&amp;#x65E6;&amp;#x6709;&amp;#x5BA2;&amp;#x6237;&amp;#x8BF7;&amp;#x6C42;&amp;#xFF0C;&amp;#x5C31;&amp;#x4F1A;&amp;#x542F;&amp;#x52A8;&amp;#x4E00;&amp;#x4E2A;&amp;#x670D;&amp;#x52A1;&amp;#x8FDB;&amp;#x7A0B;&amp;#x6765;&amp;#x54CD;&amp;#x5E94;&amp;#x8BE5;&amp;#x5BA2;&amp;#x6237;&amp;#xFF0C;&amp;#x540C;&amp;#x65F6;&amp;#x81EA;&amp;#x5DF1;&amp;#x7EE7;&amp;#x7EED;&amp;#x76D1;&amp;#x542C;&amp;#x670D;&amp;#x52A1;&amp;#x7AEF;&amp;#x53E3;&amp;#xFF0C;&amp;#x4F7F;&amp;#x540E;&amp;#x6765;&amp;#x7684;&amp;#x5BA2;&amp;#x6237;&amp;#x4E5F; &amp;#x80FD;&amp;#x53CA;&amp;#x65F6;&amp;#x5F97;&amp;#x5230;&amp;#x670D;&amp;#x52A1;&amp;#x3002;&lt;/p&gt;
&lt;h1 id=&quot;&amp;#x4E8C;&amp;#x4E24;&amp;#x7C7B;&amp;#x4F20;&amp;#x8F93;&amp;#x534F;&amp;#x8BAE;tcpudp&quot;&gt;&amp;#x4E8C;&amp;#x3001;&amp;#x4E24;&amp;#x7C7B;&amp;#x4F20;&amp;#x8F93;&amp;#x534F;&amp;#x8BAE;&amp;#xFF1A;TCP&amp;#xFF1B;UDP&lt;/h1&gt;&lt;p&gt;TCP&amp;#x662F;Tranfer Control Protocol&amp;#x7684; &amp;#x7B80;&amp;#x79F0;&amp;#xFF0C;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x9762;&amp;#x5411;&amp;#x8FDE;&amp;#x63A5;&amp;#x7684;&amp;#x4FDD;&amp;#x8BC1;&amp;#x53EF;&amp;#x9760;&amp;#x4F20;&amp;#x8F93;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#x3002;&amp;#x901A;&amp;#x8FC7;TCP&amp;#x534F;&amp;#x8BAE;&amp;#x4F20;&amp;#x8F93;&amp;#xFF0C;&amp;#x5F97;&amp;#x5230;&amp;#x7684;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x987A;&amp;#x5E8F;&amp;#x7684;&amp;#x65E0;&amp;#x5DEE;&amp;#x9519;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x6D41;&amp;#x3002;&amp;#x53D1;&amp;#x9001;&amp;#x65B9;&amp;#x548C;&amp;#x63A5;&amp;#x6536;&amp;#x65B9;&amp;#x7684;&amp;#x6210;&amp;#x5BF9;&amp;#x7684;&amp;#x4E24;&amp;#x4E2A;socket&amp;#x4E4B;&amp;#x95F4;&amp;#x5FC5;&amp;#x987B;&amp;#x5EFA; &amp;#x7ACB;&amp;#x8FDE;&amp;#x63A5;&amp;#xFF0C;&amp;#x4EE5;&amp;#x4FBF;&amp;#x5728;TCP&amp;#x534F;&amp;#x8BAE;&amp;#x7684;&amp;#x57FA;&amp;#x7840;&amp;#x4E0A;&amp;#x8FDB;&amp;#x884C;&amp;#x901A;&amp;#x4FE1;&amp;#xFF0C;&amp;#x5F53;&amp;#x4E00;&amp;#x4E2A;socket&amp;#xFF08;&amp;#x901A;&amp;#x5E38;&amp;#x90FD;&amp;#x662F;server socket&amp;#xFF09;&amp;#x7B49;&amp;#x5F85;&amp;#x5EFA;&amp;#x7ACB;&amp;#x8FDE;&amp;#x63A5;&amp;#x65F6;&amp;#xFF0C;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;socket&amp;#x53EF;&amp;#x4EE5;&amp;#x8981;&amp;#x6C42;&amp;#x8FDB;&amp;#x884C;&amp;#x8FDE;&amp;#x63A5;&amp;#xFF0C;&amp;#x4E00;&amp;#x65E6;&amp;#x8FD9;&amp;#x4E24;&amp;#x4E2A;socket&amp;#x8FDE;&amp;#x63A5;&amp;#x8D77;&amp;#x6765;&amp;#xFF0C;&amp;#x5B83;&amp;#x4EEC;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x8FDB;&amp;#x884C;&amp;#x53CC;&amp;#x5411;&amp;#x6570;&amp;#x636E;&amp;#x4F20;&amp;#x8F93;&amp;#xFF0C;&amp;#x53CC;&amp;#x65B9;&amp;#x90FD;&amp;#x53EF;&amp;#x4EE5;&amp;#x8FDB;&amp;#x884C;&amp;#x53D1;&amp;#x9001; &amp;#x6216;&amp;#x63A5;&amp;#x6536;&amp;#x64CD;&amp;#x4F5C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;UDP&amp;#x662F;User Datagram Protocol&amp;#x7684;&amp;#x7B80;&amp;#x79F0;&amp;#xFF0C;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x65E0;&amp;#x8FDE;&amp;#x63A5;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x6570;&amp;#x636E;&amp;#x62A5;&amp;#x90FD;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x72EC;&amp;#x7ACB;&amp;#x7684;&amp;#x4FE1;&amp;#x606F;&amp;#xFF0C;&amp;#x5305;&amp;#x62EC;&amp;#x5B8C;&amp;#x6574;&amp;#x7684;&amp;#x6E90;&amp;#x5730;&amp;#x5740;&amp;#x6216;&amp;#x76EE;&amp;#x7684;&amp;#x5730;&amp;#x5740;&amp;#xFF0C;&amp;#x5B83;&amp;#x5728;&amp;#x7F51;&amp;#x7EDC;&amp;#x4E0A;&amp;#x4EE5;&amp;#x4EFB;&amp;#x4F55;&amp;#x53EF;&amp;#x80FD;&amp;#x7684;&amp;#x8DEF;&amp;#x5F84;&amp;#x4F20;&amp;#x5F80;&amp;#x76EE;&amp;#x7684;&amp;#x5730;&amp;#xFF0C;&amp;#x56E0;&amp;#x6B64;&amp;#x80FD;&amp;#x5426;&amp;#x5230;&amp;#x8FBE;&amp;#x76EE;&amp;#x7684;&amp;#x5730;&amp;#xFF0C;&amp;#x5230;&amp;#x8FBE;&amp;#x76EE;&amp;#x7684;&amp;#x5730;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x4EE5;&amp;#x53CA;&amp;#x5185;&amp;#x5BB9;&amp;#x7684;&amp;#x6B63;&amp;#x786E;&amp;#x6027;&amp;#x90FD;&amp;#x662F;&amp;#x4E0D;&amp;#x80FD;&amp;#x88AB;&amp;#x4FDD;&amp;#x8BC1;&amp;#x7684;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x6BD4;&amp;#x8F83;&amp;#xFF1A;&lt;/p&gt;
&lt;h2 id=&quot;udp&quot;&gt;UDP:&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x6BCF;&amp;#x4E2A;&amp;#x6570;&amp;#x636E;&amp;#x62A5;&amp;#x4E2D;&amp;#x90FD;&amp;#x7ED9;&amp;#x51FA;&amp;#x4E86;&amp;#x5B8C;&amp;#x6574;&amp;#x7684;&amp;#x5730;&amp;#x5740;&amp;#x4FE1;&amp;#x606F;&amp;#xFF0C;&amp;#x56E0;&amp;#x6B64;&amp;#x65E0;&amp;#x9700;&amp;#x8981;&amp;#x5EFA;&amp;#x7ACB;&amp;#x53D1;&amp;#x9001;&amp;#x65B9;&amp;#x548C;&amp;#x63A5;&amp;#x6536;&amp;#x65B9;&amp;#x7684;&amp;#x8FDE;&amp;#x63A5;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;UDP&amp;#x4F20;&amp;#x8F93;&amp;#x6570;&amp;#x636E;&amp;#x65F6;&amp;#x662F;&amp;#x6709;&amp;#x5927;&amp;#x5C0F;&amp;#x9650;&amp;#x5236;&amp;#x7684;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x88AB;&amp;#x4F20;&amp;#x8F93;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x62A5;&amp;#x5FC5;&amp;#x987B;&amp;#x9650;&amp;#x5B9A;&amp;#x5728;64KB&amp;#x4E4B;&amp;#x5185;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;UDP&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E0D;&amp;#x53EF;&amp;#x9760;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#xFF0C;&amp;#x53D1;&amp;#x9001;&amp;#x65B9;&amp;#x6240;&amp;#x53D1;&amp;#x9001;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x62A5;&amp;#x5E76;&amp;#x4E0D;&amp;#x4E00;&amp;#x5B9A;&amp;#x4EE5;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x6B21;&amp;#x5E8F;&amp;#x5230;&amp;#x8FBE;&amp;#x63A5;&amp;#x6536;&amp;#x65B9;&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&quot;tcp&quot;&gt;TCP:&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x9762;&amp;#x5411;&amp;#x8FDE;&amp;#x63A5;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#xFF0C;&amp;#x5728;socket&amp;#x4E4B;&amp;#x95F4;&amp;#x8FDB;&amp;#x884C;&amp;#x6570;&amp;#x636E;&amp;#x4F20;&amp;#x8F93;&amp;#x4E4B;&amp;#x524D;&amp;#x5FC5;&amp;#x7136;&amp;#x8981;&amp;#x5EFA;&amp;#x7ACB;&amp;#x8FDE;&amp;#x63A5;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x5728;TCP&amp;#x4E2D;&amp;#x9700;&amp;#x8981;&amp;#x8FDE;&amp;#x63A5;&amp;#x65F6;&amp;#x95F4;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;TCP&amp;#x4F20;&amp;#x8F93;&amp;#x6570;&amp;#x636E;&amp;#x5927;&amp;#x5C0F;&amp;#x9650;&amp;#x5236;&amp;#xFF0C;&amp;#x4E00;&amp;#x65E6;&amp;#x8FDE;&amp;#x63A5;&amp;#x5EFA;&amp;#x7ACB;&amp;#x8D77;&amp;#x6765;&amp;#xFF0C;&amp;#x53CC;&amp;#x65B9;&amp;#x7684;socket&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x6309;&amp;#x7EDF;&amp;#x4E00;&amp;#x7684;&amp;#x683C;&amp;#x5F0F;&amp;#x4F20;&amp;#x8F93;&amp;#x5927;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;TCP&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x53EF;&amp;#x9760;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#xFF0C;&amp;#x5B83;&amp;#x786E;&amp;#x4FDD;&amp;#x63A5;&amp;#x6536;&amp;#x65B9;&amp;#x5B8C;&amp;#x5168;&amp;#x6B63;&amp;#x786E;&amp;#x5730;&amp;#x83B7;&amp;#x53D6;&amp;#x53D1;&amp;#x9001;&amp;#x65B9;&amp;#x6240;&amp;#x53D1;&amp;#x9001;&amp;#x7684;&amp;#x5168;&amp;#x90E8;&amp;#x6570;&amp;#x636E;&amp;#x3002;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&quot;&amp;#x4E09;&amp;#x603B;&amp;#x7ED3;&amp;#x7684;&amp;#x8111;&amp;#x56FE;&quot;&gt;&amp;#x4E09;&amp;#x3001;&amp;#x603B;&amp;#x7ED3;&amp;#x7684;&amp;#x8111;&amp;#x56FE;&amp;#xFF1A;&lt;/h1&gt;&lt;p&gt;&lt;img src=&quot;/2016/03/01/&amp;#x7F51;&amp;#x7EDC;&amp;#x901A;&amp;#x8BAF;/&amp;#x7F51;&amp;#x7EDC;&amp;#x901A;&amp;#x4FE1;.jpg&quot; alt=&quot;&amp;#x7F51;&amp;#x7EDC;&amp;#x901A;&amp;#x8BAF;&quot;&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;&amp;#x4E00;
    
    </summary>
    
      <category term="技术" scheme="http://leeboyue.com/categories/%E6%8A%80%E6%9C%AF/"/>
    
    
      <category term="java" scheme="http://leeboyue.com/tags/java/"/>
    
      <category term="网络" scheme="http://leeboyue.com/tags/%E7%BD%91%E7%BB%9C/"/>
    
      <category term="通讯" scheme="http://leeboyue.com/tags/%E9%80%9A%E8%AE%AF/"/>
    
  </entry>
  
  <entry>
    <title>要做的一些事情</title>
    <link href="http://leeboyue.com/2016/03/01/%E8%A6%81%E5%81%9A%E7%9A%84%E4%B8%80%E4%BA%9B%E4%BA%8B%E6%83%85/"/>
    <id>http://leeboyue.com/2016/03/01/要做的一些事情/</id>
    <published>2016-03-01T07:40:08.000Z</published>
    <updated>2016-03-09T03:42:35.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&amp;#x5B58;&amp;#x50A8;&amp;#x77E5;&amp;#x8BC6;&amp;#x5B66;&amp;#x4E60;&lt;/p&gt;
&lt;p&gt;&amp;#x4ECA;&amp;#x5E74;3&amp;#x6708;&amp;#x4EFD;&amp;#x53C8;&amp;#x6362;&amp;#x4E86;&amp;#x5DE5;&amp;#x4F5C;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x575A;&amp;#x6301;&amp;#x6280;&amp;#x672F;&amp;#x4E3A;&amp;#x4E3B;&amp;#xFF0C;&amp;#x6280;&amp;#x672F;&amp;#x548C;&amp;#x4E1A;&amp;#x52A1;&amp;#x76F8;&amp;#x7ED3;&amp;#x5408;&amp;#x5E76;&amp;#x884C;&amp;#x63D0;&amp;#x5347;&lt;/p&gt;
&lt;p&gt;&amp;#x8BFB;&amp;#x4E66;&amp;#x4E0E;&amp;#x535A;&amp;#x5BA2;&amp;#xFF0C;&amp;#x8FD8;&amp;#x6709;issue&amp;#xFF0C;&amp;#x5237;leetcode&lt;/p&gt;
&lt;p&gt;&amp;#x5F00;&amp;#x59CB;&amp;#x4F7F;&amp;#x7528;&amp;#x8111;&amp;#x56FE;&amp;#x89C4;&amp;#x5212;&amp;#x81EA;&amp;#x5DF1;&amp;#x5B66;&amp;#x4E60;&amp;#x8DEF;&amp;#x7EBF;&amp;#x4E0E;&amp;#x4E13;&amp;#x4E1A;&amp;#x65B9;&amp;#x5411;&lt;/p&gt;
&lt;p&gt;&amp;#x4E00;&amp;#x6B21;&amp;#x65C5;&amp;#x6E38;&amp;#xFF0C;&amp;#x666E;&amp;#x5409;&amp;#x5C9B;&lt;/p&gt;
&lt;p&gt;&amp;#x671F;&amp;#x671B;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&amp;#x5B58;&amp;#x50
    
    </summary>
    
      <category term="学习" scheme="http://leeboyue.com/categories/%E5%AD%A6%E4%B9%A0/"/>
    
    
      <category term="技术" scheme="http://leeboyue.com/tags/%E6%8A%80%E6%9C%AF/"/>
    
      <category term="随笔" scheme="http://leeboyue.com/tags/%E9%9A%8F%E7%AC%94/"/>
    
  </entry>
  
  <entry>
    <title>存储知识学习</title>
    <link href="http://leeboyue.com/2016/03/01/%E5%AD%98%E5%82%A8%E7%9F%A5%E8%AF%86%E5%AD%A6%E4%B9%A0/"/>
    <id>http://leeboyue.com/2016/03/01/存储知识学习/</id>
    <published>2016-03-01T07:24:38.000Z</published>
    <updated>2016-03-09T06:15:07.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h2 id=&quot;1&amp;#x78C1;&amp;#x76D8;&amp;#x57FA;&amp;#x672C;&amp;#x77E5;&amp;#x8BC6;&quot;&gt;1.&amp;#x78C1;&amp;#x76D8;&amp;#x57FA;&amp;#x672C;&amp;#x77E5;&amp;#x8BC6;&lt;/h2&gt;&lt;p&gt;&amp;#x78C1;&amp;#x76D8;&amp;#x5927;&amp;#x81F4;&amp;#x7531;&amp;#x76D8;&amp;#x7247;&amp;#x3001;&amp;#x78C1;&amp;#x5934;&amp;#x3001;&amp;#x6B65;&amp;#x8FDB;&amp;#x7535;&amp;#x673A;&amp;#x7B49;&amp;#x51E0;&amp;#x90E8;&amp;#x5206;&amp;#x7EC4;&amp;#x6210;&amp;#x7EC4;&amp;#x6210;&amp;#x3002;&lt;br&gt;&amp;#x76D8;&amp;#x9762;&amp;#xFF1A;&amp;#x786C;&amp;#x76D8;&amp;#x4E00;&amp;#x822C;&amp;#x542B;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x6216;&amp;#x591A;&amp;#x4E2A;&amp;#x76D8;&amp;#x7247;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x76D8;&amp;#x7247;&amp;#x5305;&amp;#x542B;&amp;#x4E24;&amp;#x4E2A;&amp;#x76D8;&amp;#x9762;&amp;#x3002;&lt;br&gt;&amp;#x78C1;&amp;#x9053;&amp;#xFF1A;&amp;#x6BCF;&amp;#x4E2A;&amp;#x76D8;&amp;#x9762;&amp;#x88AB;&amp;#x5212;&amp;#x6210;&amp;#x591A;&amp;#x4E2A;&amp;#x72ED;&amp;#x7A84;&amp;#x7684;&amp;#x540C;&amp;#x5FC3;&amp;#x5706;&amp;#x73AF;&amp;#xFF0C;&amp;#x8FD9;&amp;#x6837;&amp;#x7684;&amp;#x5706;&amp;#x73AF;&amp;#x53EB;&amp;#x505A;&amp;#x78C1;&amp;#x9053;&amp;#x3002;&lt;br&gt;&amp;#x6247;&amp;#x533A;&amp;#xFF1A;&amp;#x6BCF;&amp;#x4E2A;&amp;#x78C1;&amp;#x9053;&amp;#x7684;&amp;#x6BCF;&amp;#x6BB5;&amp;#x5706;&amp;#x5F27;&amp;#x53EB;&amp;#x505A;&amp;#x4E00;&amp;#x4E2A;&amp;#x6247;&amp;#x533A;&amp;#xFF0C;&amp;#x662F;&amp;#x8BFB;&amp;#x5199;&amp;#x7684;&amp;#x6700;&amp;#x5C0F;&amp;#x5355;&amp;#x4F4D;&amp;#x3002;&lt;br&gt;&amp;#x67F1;&amp;#x9762;&amp;#xFF1A;&amp;#x6240;&amp;#x6709;&amp;#x76D8;&amp;#x9762;&amp;#x4E0A;&amp;#x7684;&amp;#x540C;&amp;#x4E00;&amp;#x78C1;&amp;#x9053;&amp;#xFF0C;&amp;#x5728;&amp;#x7AD6;&amp;#x76F4;&amp;#x65B9;&amp;#x5411;&amp;#x6784;&amp;#x6210;&amp;#x4E00;&amp;#x4E2A;&amp;#x5706;&amp;#x67F1;&amp;#xFF0C;&amp;#x79F0;&amp;#x4E3A;&amp;#x67F1;&amp;#x9762;&amp;#x3002;&lt;br&gt;&amp;#x8BFB;&amp;#x5199;&amp;#x8FC7;&amp;#x7A0B;&amp;#xFF1A;&amp;#x786C;&amp;#x76D8;&amp;#x8BFB;&amp;#x53D6;&amp;#x6570;&amp;#x636E;&amp;#x65F6;&amp;#xFF0C;&amp;#x78C1;&amp;#x5934;&amp;#x5148;&amp;#x79FB;&amp;#x52A8;&amp;#x5230;&amp;#x8BFB;&amp;#x53D6;&amp;#x6247;&amp;#x533A;&amp;#x6240;&amp;#x5728;&amp;#x78C1;&amp;#x9053;&amp;#x7684;&amp;#x4E0A;&amp;#x65B9;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8FC7;&amp;#x7A0B;&amp;#x8017;&amp;#x65F6;&amp;#x53EB;&amp;#x505A;&amp;#x78C1;&amp;#x76D8;&amp;#x5BFB;&amp;#x9053;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x5E73;&amp;#x5747;&amp;#x65F6;&amp;#x95F4;&amp;#x4E3A;10ms&amp;#x3002;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x901A;&amp;#x8FC7;&amp;#x76D8;&amp;#x7247;&amp;#x7684;&amp;#x65CB;&amp;#x8F6C;&amp;#xFF0C;&amp;#x4F7F;&amp;#x5F97;&amp;#x6247;&amp;#x533A;&amp;#x8F6C;&amp;#x5230;&amp;#x78C1;&amp;#x5934;&amp;#x7684;&amp;#x4E0B;&amp;#x65B9;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8FC7;&amp;#x7A0B;&amp;#x8017;&amp;#x65F6;&amp;#x53EB;&amp;#x505A;&amp;#x65CB;&amp;#x8F6C;&amp;#x5EF6;&amp;#x8FDF;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;7200&amp;#x8F6C;/min&amp;#x7684;&amp;#x786C;&amp;#x76D8;&amp;#x8F6C;&amp;#x4E00;&amp;#x5468;&amp;#x4E3A;60*1000/7200=8.33ms&amp;#xFF0C;&amp;#x5E73;&amp;#x5747;&amp;#x65CB;&amp;#x8F6C;&amp;#x5EF6;&amp;#x8FDF;&amp;#x4E3A;4.17ms&amp;#xFF08;&amp;#x534A;&amp;#x5708;&amp;#xFF09;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;2raid&amp;#x57FA;&amp;#x672C;&amp;#x77E5;&amp;#x8BC6;&quot;&gt;2.RAID&amp;#x57FA;&amp;#x672C;&amp;#x77E5;&amp;#x8BC6;&lt;/h2&gt;&lt;p&gt;RAID&amp;#xFF08;Redundant Array of Independent Disks&amp;#xFF09;&amp;#xFF0C;&amp;#x5373;&amp;#x7531;&amp;#x72EC;&amp;#x7ACB;&amp;#x7684;&amp;#x78C1;&amp;#x76D8;&amp;#x7EC4;&amp;#x6210;&amp;#x7684;&amp;#x5177;&amp;#x6709;&amp;#x5197;&amp;#x4F59;&amp;#x7279;&amp;#x6027;&amp;#x7684;&amp;#x9635;&amp;#x5217;&amp;#x3002;&amp;#x5176;&amp;#x57FA;&amp;#x672C;&amp;#x601D;&amp;#x60F3;&amp;#x5C31;&amp;#x662F;&amp;#x628A;&amp;#x591A;&amp;#x4E2A;&amp;#x76F8;&amp;#x5BF9;&amp;#x4FBF;&amp;#x5B9C;&amp;#x7684;&amp;#x786C;&amp;#x76D8;&amp;#x7EC4;&amp;#x5408;&amp;#x8D77;&amp;#x6765;&amp;#xFF0C;&amp;#x6210;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x786C;&amp;#x76D8;&amp;#x9635;&amp;#x5217;&amp;#x7EC4;&amp;#xFF0C;&amp;#x4F7F;&amp;#x6027;&amp;#x80FD;&amp;#x8FBE;&amp;#x5230;&amp;#x751A;&amp;#x81F3;&amp;#x8D85;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EF7;&amp;#x683C;&amp;#x6602;&amp;#x8D35;&amp;#x3001; &amp;#x5BB9;&amp;#x91CF;&amp;#x5DE8;&amp;#x5927;&amp;#x7684;&amp;#x786C;&amp;#x76D8;&amp;#x3002;&lt;br&gt;RAID 0&amp;#xFF0C;&amp;#x6761;&amp;#x5E26;&amp;#x5316;&amp;#x5B58;&amp;#x50A8;&amp;#xFF0C;&amp;#x5BB9;&amp;#x91CF;&amp;#x589E;&amp;#x52A0;&amp;#xFF0C;&amp;#x5E76;&amp;#x884C;&amp;#x5316;&amp;#xFF0C;&amp;#x4F46;&amp;#x65E0;&amp;#x5197;&amp;#x4F59;&amp;#xFF0C;&amp;#x5BB9;&amp;#x6613;&amp;#x5355;&amp;#x70B9;&amp;#x6545;&amp;#x969C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;RAID 1&amp;#xFF0C;&amp;#x955C;&amp;#x50CF;&amp;#x5B58;&amp;#x50A8;&amp;#xFF0C;&amp;#x5199;&amp;#x5165;&amp;#x901F;&amp;#x7387;&amp;#x6162;&amp;#xFF0C;&amp;#x8BFB;&amp;#x53D6;&amp;#x901F;&amp;#x7387;&amp;#x5FEB;&amp;#xFF0C;&amp;#x6709;&amp;#x5197;&amp;#x4F59;&amp;#x5907;&amp;#x4EFD;&amp;#xFF0C;&amp;#x4F18;&amp;#x70B9;&amp;#x662F;&amp;#x9AD8;&amp;#x53EF;&amp;#x9760;&amp;#x3001;&amp;#x9AD8;&amp;#x53EF;&amp;#x7528;&amp;#xFF0C;&amp;#x7F3A;&amp;#x70B9;&amp;#x662F;&amp;#x9AD8;&amp;#x82B1;&amp;#x8D39;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;RAID 2&amp;#xFF0C;RAID 0&amp;#x7684;&amp;#x6539;&amp;#x8FDB;&amp;#x7248;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528;&amp;#x6C49;&amp;#x660E;&amp;#x7801;&amp;#x8FDB;&amp;#x884C;&amp;#x68C0;&amp;#x6D4B;&amp;#x548C;&amp;#x7EA0;&amp;#x9519;&amp;#xFF0C;&amp;#x9002;&amp;#x7528;&amp;#x4E8E;&amp;#x8FDE;&amp;#x7EED;IO&amp;#x3001;&amp;#x5927;&amp;#x5757;IO&amp;#xFF08;&amp;#x5982;&amp;#x89C6;&amp;#x9891;&amp;#x6D41;&amp;#xFF09;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;RAID 3&amp;#xFF0C;RAID 3&amp;#x548C;RAID 2&amp;#x7684;&amp;#x601D;&amp;#x8DEF;&amp;#x6BD4;&amp;#x8F83;&amp;#x76F8;&amp;#x4F3C;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528;&amp;#x5947;&amp;#x5076;&amp;#x6821;&amp;#x9A8C;&amp;#x8FDB;&amp;#x884C;&amp;#x9519;&amp;#x8BEF;&amp;#x68C0;&amp;#x6D4B;&amp;#x548C;&amp;#x7EA0;&amp;#x9519;&amp;#xFF0C;&amp;#x4F46;&amp;#x6821;&amp;#x9A8C;&amp;#x76D8;&amp;#x5355;&amp;#x70B9;&amp;#x6545;&amp;#x969C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;RAID 4&amp;#xFF0C;RAID 4&amp;#x548C;RAID 3&amp;#x601D;&amp;#x8DEF;&amp;#x4E00;&amp;#x6837;&amp;#xFF0C;&amp;#x53EA;&amp;#x4E0D;&amp;#x8FC7;&amp;#x662F;&amp;#x4F7F;&amp;#x7528;BLOCK&amp;#x8FDB;&amp;#x884C;&amp;#x5B58;&amp;#x50A8;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;RAID 5&amp;#xFF0C;&amp;#x6821;&amp;#x9A8C;&amp;#x4FE1;&amp;#x606F;&amp;#x4EA4;&amp;#x53C9;&amp;#x7684;&amp;#x5B58;&amp;#x50A8;&amp;#x5728;&amp;#x6240;&amp;#x6709;&amp;#x6570;&amp;#x636E;&amp;#x76D8;&amp;#x4E0A;&amp;#xFF0C;&amp;#x9AD8;&amp;#x5197;&amp;#x4F59;&amp;#xFF0C;&amp;#x9AD8;&amp;#x6570;&amp;#x636E;&amp;#x4F20;&amp;#x8F93;&amp;#x7387;&amp;#xFF0C;&amp;#x5B9E;&amp;#x73B0;&amp;#x590D;&amp;#x6742;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;RAID 6&amp;#xFF0C;&amp;#x76F8;&amp;#x6BD4;RAID5&amp;#x589E;&amp;#x52A0;&amp;#x5757;&amp;#x5185;&amp;#x7684;&amp;#x6821;&amp;#x9A8C;&amp;#xFF0C;&amp;#x5141;&amp;#x8BB8;&amp;#x540C;&amp;#x65F6;&amp;#x574F;2&amp;#x5757;&amp;#x786C;&amp;#x76D8;&amp;#x800C;&amp;#x4E0D;&amp;#x4E22;&amp;#x5931;&amp;#x6570;&amp;#x636E;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;RAID 01&amp;#xFF0C;&amp;#x5148;&amp;#x505A;&amp;#x6761;&amp;#x5E26;&amp;#xFF08;0&amp;#xFF09;&amp;#xFF0C;&amp;#x518D;&amp;#x505A;&amp;#x955C;&amp;#x50CF;&amp;#xFF08;1&amp;#xFF09;&amp;#x3002;&amp;#x8BFB;&amp;#x5199;&amp;#x901F;&amp;#x5EA6;&amp;#x5FEB;&amp;#xFF0C;&amp;#x6570;&amp;#x636E;&amp;#x4FDD;&amp;#x62A4;&amp;#x80FD;&amp;#x529B;&amp;#x5F3A;&amp;#xFF0C;&amp;#x7A7A;&amp;#x95F4;&amp;#x5229;&amp;#x7528;&amp;#x7387;50%&amp;#x3002;&lt;br&gt;RAID 10&amp;#xFF0C;&amp;#x5148;&amp;#x505A;&amp;#x955C;&amp;#x50CF;&amp;#xFF08;1&amp;#xFF09;&amp;#xFF0C;&amp;#x518D;&amp;#x505A;&amp;#x6761;&amp;#x5E26;&amp;#xFF08;0&amp;#xFF09;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;3&amp;#x5B58;&amp;#x50A8;&amp;#x65B9;&amp;#x5F0F;&quot;&gt;3.&amp;#x5B58;&amp;#x50A8;&amp;#x65B9;&amp;#x5F0F;&lt;/h2&gt;&lt;p&gt;&amp;#x6839;&amp;#x636E;&amp;#x7F51;&amp;#x4E0A;&amp;#x7684;&amp;#x8D44;&amp;#x6599;&amp;#x548C;&amp;#x7406;&amp;#x89E3;&amp;#xFF0C;&amp;#x7528;Visio&amp;#x6574;&amp;#x7406;&amp;#x4E86;&amp;#x4E00;&amp;#x5F20;&amp;#x56FE;&amp;#x5BF9;&amp;#x6BD4;&amp;#x4E86;&amp;#x4E0B;&amp;#x51E0;&amp;#x79CD;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF1A;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13420474/84972086-dfc1-11e5-91e9-dfb7b7e0e5cc.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;DAS&amp;#x5168;&amp;#x79F0;&amp;#x4E3A;Direct Attached Storage&amp;#xFF0C;&amp;#x5373;&amp;#x670D;&amp;#x52A1;&amp;#x5668;&amp;#x76F4;&amp;#x8FDE;&amp;#x5B58;&amp;#x50A8;&amp;#x3002;&amp;#x5982;&amp;#x56FE;&amp;#x6240;&amp;#x793A;&amp;#xFF0C;&amp;#x6587;&amp;#x4EF6;&amp;#x7CFB;&amp;#x7EDF;&amp;#x76F4;&amp;#x63A5;&amp;#x901A;&amp;#x8FC7;RAID&amp;#x5B8C;&amp;#x6210;&amp;#x5BF9;&amp;#x786C;&amp;#x4EF6;&amp;#x8BBF;&amp;#x95EE;&amp;#x3002;&amp;#x4F18;&amp;#x70B9;&amp;#x662F;&amp;#x64CD;&amp;#x4F5C;&amp;#x7B80;&amp;#x4FBF;&amp;#xFF0C;&amp;#x7ECF;&amp;#x6D4E;&amp;#xFF0C;&amp;#x7F3A;&amp;#x70B9;&amp;#x662F;&amp;#x5206;&amp;#x6563;&amp;#x5F0F;&amp;#x5B58;&amp;#x50A8;&amp;#xFF0C;&amp;#x4E0D;&amp;#x53EF;&amp;#x96C6;&amp;#x4E2D;&amp;#x7BA1;&amp;#x7406;&amp;#x3002;&lt;br&gt;NAS&amp;#x5168;&amp;#x79F0;&amp;#x4E3A;Network Attached Storage&amp;#xFF0C;&amp;#x5373;&amp;#x7F51;&amp;#x7EDC;&amp;#x5B58;&amp;#x50A8;&amp;#x670D;&amp;#x52A1;&amp;#x3002;&amp;#x5982;&amp;#x56FE;&amp;#x6240;&amp;#x793A;&amp;#xFF0C;&amp;#x6587;&amp;#x4EF6;&amp;#x7CFB;&amp;#x7EDF;&amp;#x901A;&amp;#x8FC7;&amp;#x7F51;&amp;#x7EDC;&amp;#x66B4;&amp;#x9732;&amp;#x51FA;&amp;#x6765;&amp;#x7ED9;&amp;#x5E94;&amp;#x7528;&amp;#x670D;&amp;#x52A1;&amp;#x3002;&amp;#x4F18;&amp;#x70B9;&amp;#x662F;&amp;#x7ED3;&amp;#x6784;&amp;#x7B80;&amp;#x5355;&amp;#x3002;&amp;#x914D;&amp;#x7F6E;&amp;#x4F7F;&amp;#x7528;&amp;#x7BA1;&amp;#x7406;&amp;#x975E;&amp;#x5E38;&amp;#x65B9;&amp;#x4FBF;&amp;#xFF0C;&amp;#x53EF;&amp;#x5B9E;&amp;#x73B0;&amp;#x8DE8;&amp;#x5E73;&amp;#x53F0;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x5171;&amp;#x4EAB;&amp;#x3002;&amp;#x7F3A;&amp;#x70B9;&amp;#x662F;&amp;#x9700;&amp;#x8981;&amp;#x5360;&amp;#x7528;&amp;#x7F51;&amp;#x7EDC;&amp;#x8D44;&amp;#x6E90;&amp;#x3001;&amp;#x5E94;&amp;#x7528;&amp;#x5C40;&amp;#x9650;&amp;#x6027;&amp;#x5927;&amp;#x3002;&lt;br&gt;SAN&amp;#x5168;&amp;#x79F0;&amp;#x4E3A;Storage Aera Network&amp;#xFF0C;&amp;#x5373;&amp;#x5B58;&amp;#x50A8;&amp;#x533A;&amp;#x57DF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF0C;&amp;#x5982;&amp;#x56FE;&amp;#x6240;&amp;#x793A;&amp;#xFF0C;RAID&amp;#x63A5;&amp;#x53E3;&amp;#x901A;&amp;#x8FC7;&amp;#x7F51;&amp;#x7EDC;&amp;#x66B4;&amp;#x9732;&amp;#x51FA;&amp;#x6765;&amp;#x3002;&amp;#x4F18;&amp;#x70B9;&amp;#x662F;&amp;#x6269;&amp;#x5C55;&amp;#x6027;&amp;#x5F3A;&amp;#xFF0C;&amp;#x96C6;&amp;#x4E2D;&amp;#x7BA1;&amp;#x7406;&amp;#xFF0C;&amp;#x7F3A;&amp;#x70B9;&amp;#x662F;&amp;#x6210;&amp;#x672C;&amp;#x8F83;&amp;#x9AD8;&amp;#xFF0C;&amp;#x7BA1;&amp;#x7406;&amp;#x7EF4;&amp;#x62A4;&amp;#x96BE;&amp;#x5EA6;&amp;#x5927;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;4-ip-san&amp;#x4E0E;fc-san&quot;&gt;4. IP SAN&amp;#x4E0E;FC SAN&lt;/h2&gt;&lt;p&gt;FC SAN&amp;#x6307;&amp;#x57FA;&amp;#x4E8E;&amp;#x5149;&amp;#x7EA4;&amp;#x901A;&amp;#x9053;&amp;#xFF08;Fiber Channel&amp;#xFF09;&amp;#x7684;&amp;#x5B58;&amp;#x50A8;&amp;#x533A;&amp;#x57DF;&amp;#x7F51;&amp;#xFF0C;&amp;#x5728;FC SAN&amp;#x4E2D;&amp;#x5B58;&amp;#x5728;&amp;#x4E24;&amp;#x5F20;&amp;#x7F51;&amp;#xFF0C;&amp;#x4E00;&amp;#x5F20;&amp;#x9762;&amp;#x5411;&amp;#x5E94;&amp;#x7528;&amp;#x7684;&amp;#x7F51;&amp;#xFF08;IP&amp;#x7F51;&amp;#xFF09;&amp;#xFF0C;&amp;#x53E6;&amp;#x4E00;&amp;#x5F20;&amp;#x4E2D;&amp;#x5219;&amp;#x662F;&amp;#x5B58;&amp;#x50A8;&amp;#x7F51;&amp;#xFF08;FC&amp;#x7F51;&amp;#xFF09;&amp;#x3002;&amp;#x800C;IP SAN&amp;#x7684;&amp;#x51FA;&amp;#x73B0;&amp;#x5219;&amp;#x662F;&amp;#x4E3A;&amp;#x4E86;&amp;#x5BFB;&amp;#x6C42;&amp;#x4E00;&amp;#x79CD;&amp;#x65B0;&amp;#x7684;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x7528;&amp;#x4E0E;&amp;#x5E94;&amp;#x7528;&amp;#x7F51;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x4F53;&amp;#x7CFB;&amp;#x67B6;&amp;#x6784;&amp;#x6765;&amp;#x6784;&amp;#x9020;&amp;#x5B58;&amp;#x50A8;&amp;#x7F51;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528;&amp;#x901A;&amp;#x7528;&amp;#x7684;IP&amp;#x7F51;&amp;#x7EDC;&amp;#x53CA;&amp;#x8BBE;&amp;#x5907;&amp;#x3002;&lt;br&gt;FC SAN&amp;#x6027;&amp;#x80FD;&amp;#x597D;&amp;#xFF0C;&amp;#x4EF7;&amp;#x683C;&amp;#x9AD8;&amp;#xFF0C;&amp;#x4F46;&amp;#x4E0E;&amp;#x4E3B;&amp;#x6D41;&amp;#x7684;IP&amp;#x7F51;&amp;#x7EDC;&amp;#x5F02;&amp;#x6784;&amp;#x3002;&amp;#x9002;&amp;#x7528;&amp;#x4E8E;&amp;#x5173;&amp;#x952E;&amp;#x5E94;&amp;#x7528;&amp;#x7684;&amp;#x51E0;&amp;#x79CD;&amp;#x5B58;&amp;#x50A8;&amp;#x3001;&amp;#x5907;&amp;#x4EFD;&amp;#x53CA;&amp;#x5BB9;&amp;#x707E;&amp;#x3002;&lt;br&gt;IP SAN&amp;#x5219;&amp;#x7531;&amp;#x4E8E;&amp;#x4EE5;&amp;#x592A;&amp;#x7F51;MTU&amp;#xFF08;1518&amp;#x5B57;&amp;#x8282;&amp;#xFF09;&amp;#x7684;&amp;#x9650;&amp;#x5236;&amp;#xFF0C;&amp;#x6027;&amp;#x80FD;&amp;#x7A0D;&amp;#x5DEE;&amp;#xFF0C;&amp;#x4F46;&amp;#x57FA;&amp;#x4E8E;&amp;#x901A;&amp;#x7528;&amp;#x7684;IP&amp;#x534F;&amp;#x8BAE;&amp;#x3002;&amp;#x9002;&amp;#x7528;&amp;#x4E8E;&amp;#x5F02;&amp;#x5730;&amp;#x95F4;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x4EA4;&amp;#x6362;&amp;#x3001;&amp;#x5907;&amp;#x4EFD;&amp;#x5BB9;&amp;#x707E;&amp;#xFF0C;&amp;#x975E;&amp;#x5173;&amp;#x952E;&amp;#x5E94;&amp;#x7528;&amp;#x7684;&amp;#x96C6;&amp;#x4E2D;&amp;#x5B58;&amp;#x50A8;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;5-lvm&amp;#x57FA;&amp;#x672C;&amp;#x77E5;&amp;#x8BC6;&quot;&gt;5. LVM&amp;#x57FA;&amp;#x672C;&amp;#x77E5;&amp;#x8BC6;&lt;/h2&gt;&lt;p&gt;LVM&amp;#x7684;&amp;#x5168;&amp;#x79F0;&amp;#x662F;Logical Volume Manager&amp;#xFF0C;&amp;#x903B;&amp;#x8F91;&amp;#x5377;&amp;#x8F74;&amp;#x7BA1;&amp;#x7406;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8981;&amp;#x89E3;&amp;#x51B3;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x662F;&amp;#xFF0C;&amp;#x5F39;&amp;#x6027;&amp;#x8C03;&amp;#x6574;&amp;#x6587;&amp;#x4EF6;&amp;#x7CFB;&amp;#x7EDF;&amp;#x7684;&amp;#x5BB9;&amp;#x91CF;&amp;#x3002;&lt;br&gt;&lt;img src=&quot;https://cloud.githubusercontent.com/assets/11264082/13420492/a2857f66-dfc1-11e5-9ef5-38bd5ca8b56b.png&quot; alt=&quot;image&quot;&gt;&lt;br&gt;&amp;#x4E0E;&amp;#x4F20;&amp;#x7EDF;&amp;#x7684;&amp;#x78C1;&amp;#x76D8;&amp;#x4E0E;&amp;#x5206;&amp;#x533A;&amp;#x76F8;&amp;#x6BD4;&amp;#xFF0C;LVM&amp;#x4E3A;&amp;#x8BA1;&amp;#x7B97;&amp;#x673A;&amp;#x63D0;&amp;#x4F9B;&amp;#x4E86;&amp;#x66F4;&amp;#x9AD8;&amp;#x5C42;&amp;#x6B21;&amp;#x7684;&amp;#x5B58;&amp;#x50A8;&amp;#xFF0C;&amp;#x901A;&amp;#x8FC7;&amp;#x5728;&amp;#x78C1;&amp;#x76D8;&amp;#x5206;&amp;#x533A;&amp;#x548C;&amp;#x6587;&amp;#x4EF6;&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E4B;&amp;#x95F4;&amp;#x589E;&amp;#x52A0;&amp;#x4E00;&amp;#x4E2A;&amp;#x903B;&amp;#x8F91;&amp;#x5C42;&amp;#xFF0C;&amp;#x63D0;&amp;#x4F9B;&amp;#x4E00;&amp;#x4E2A;&amp;#x62BD;&amp;#x8C61;&amp;#x7684;&amp;#x903B;&amp;#x8F91;&amp;#x76D8;&amp;#x5377;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x53C2;&amp;#x8003;&amp;#x8D44;&amp;#x6599;&quot;&gt;&amp;#x53C2;&amp;#x8003;&amp;#x8D44;&amp;#x6599;&lt;/h2&gt;&lt;p&gt;1.&amp;#x300A;&amp;#x5927;&amp;#x8BDD;&amp;#x5B58;&amp;#x50A8;&amp;#x300B;&lt;br&gt;2.RAID&amp;#x6280;&amp;#x672F;&amp;#x4ECB;&amp;#x7ECD;&amp;#x548C;&amp;#x603B;&amp;#x7ED3;&lt;a href=&quot;http://blog.jobbole.com/83808/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;http://blog.jobbole.com/83808/&lt;/a&gt;&lt;br&gt;3.&amp;#x57FA;&amp;#x4E8E;OpenStack&amp;#x7684;NAS&amp;#x670D;&amp;#x52A1;&lt;a href=&quot;https://www.ustack.com/blog/openstack-nas/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;https://www.ustack.com/blog/openstack-nas/&lt;/a&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h2 id=&quot;1&amp;#x78C1
    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>2016年目标与计划</title>
    <link href="http://leeboyue.com/2016/01/01/2016%E5%B9%B4%E7%9B%AE%E6%A0%87%E4%B8%8E%E8%AE%A1%E5%88%92/"/>
    <id>http://leeboyue.com/2016/01/01/2016年目标与计划/</id>
    <published>2016-01-01T06:32:08.000Z</published>
    <updated>2016-03-02T10:58:39.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x65B0;&amp;#x7684;&amp;#x4E00;&amp;#x5E74;&amp;#x5F00;&amp;#x59CB;&amp;#x4E86;&amp;#xFF0C;&amp;#x7ED9;&amp;#x81EA;&amp;#x5DF1;&amp;#x5236;&amp;#x5B9A;&amp;#x4E00;&amp;#x5E74;&amp;#x5FC5;&amp;#x987B;&amp;#x8FBE;&amp;#x6210;&amp;#x7684;&amp;#x76EE;&amp;#x6807;&amp;#xFF0C;&amp;#x52A0;&amp;#x6CB9;&amp;#xFF01;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;h1 id=&quot;&amp;#x76EE;&amp;#x6807;&quot;&gt;&amp;#x76EE;&amp;#x6807;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x575A;&amp;#x6301;&amp;#x5065;&amp;#x8EAB;&amp;#xFF0C;&amp;#x5E74;&amp;#x672B;&amp;#x8FBE;&amp;#x5230;&amp;#x8FDE;&amp;#x7EED;&amp;#x5F15;&amp;#x4F53;&amp;#x5411;&amp;#x4E0A;60&amp;#x4E0B;&amp;#xFF0C;&amp;#x52A0;&amp;#x5F3A;&amp;#x80F8;&amp;#x808C;&amp;#x548C;&amp;#x8179;&amp;#x808C;&lt;/li&gt;
&lt;li&gt;&amp;#x57FA;&amp;#x91D1;&amp;#x5B9A;&amp;#x6295;&amp;#xFF0C;&amp;#x8D44;&amp;#x4EA7;&amp;#x5408;&amp;#x7406;&amp;#x914D;&amp;#x7F6E;&amp;#xFF0C;&amp;#x653E;&amp;#x4E00;&amp;#x4E9B;&amp;#x5230;&amp;#x80A1;&amp;#x5E02;&amp;#x3001;&amp;#x6E2F;&amp;#x80A1;&lt;/li&gt;
&lt;li&gt;&amp;#x4E89;&amp;#x53D6;&amp;#x89C1;&amp;#x4E08;&amp;#x6BCD;&amp;#x5A18;&lt;/li&gt;
&lt;li&gt;&amp;#x8BFB;&amp;#x5F00;&amp;#x6E90;&amp;#x9879;&amp;#x76EE;&amp;#x6E90;&amp;#x7801;&amp;#xFF1A;&lt;br&gt;&lt;code&gt;[ ] dubbo&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] rocketMq&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] j2cache&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] jfinal&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] zbus&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&amp;#x5BF9;&amp;#x6280;&amp;#x672F;&amp;#x7684;&amp;#x8981;&amp;#x6C42;&amp;#xFF1A;&lt;br&gt;&lt;code&gt;[ ] &amp;#x6DF1;&amp;#x5165;&amp;#x4E86;&amp;#x89E3;rocketMq&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] &amp;#x6DF1;&amp;#x5165;&amp;#x4E86;&amp;#x89E3;NIO &amp;#x4F7F;&amp;#x7528;netty&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] &amp;#x638C;&amp;#x63E1;redis&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&amp;#x8BFB;&amp;#x4E13;&amp;#x4E1A;&amp;#x4E66;&amp;#x7C4D;&lt;br&gt;&lt;code&gt;[ ] &amp;#x4EBA;&amp;#x6708;&amp;#x795E;&amp;#x8BDD;&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] &amp;#x91CD;&amp;#x6784;&amp;#xFF0C;&amp;#x6539;&amp;#x5584;&amp;#x65E2;&amp;#x6709;&amp;#x4EE3;&amp;#x7801;&amp;#x7684;&amp;#x8BBE;&amp;#x8BA1;&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] &amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x4FEE;&amp;#x70BC;&amp;#x4E4B;&amp;#x9053;-&amp;#x4ECE;&amp;#x5C0F;&amp;#x5DE5;&amp;#x5230;&amp;#x4E13;&amp;#x5BB6;&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] &amp;#x7F16;&amp;#x7A0B;&amp;#x73E0;&amp;#x7391;&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] &amp;#x6DF1;&amp;#x5165;&amp;#x7406;&amp;#x89E3;JVM&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&amp;#x8BFB;&amp;#x975E;&amp;#x4E13;&amp;#x4E1A;&amp;#x4E66;&amp;#x7C4D;&lt;br&gt;&lt;code&gt;[ ] &amp;#x5FC5;&amp;#x7136;&lt;/code&gt;&lt;br&gt;&lt;code&gt;[ ] &amp;#x6295;&amp;#x8D44;&amp;#x54F2;&amp;#x5B66;&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&amp;#x53BB;&amp;#x6D4E;&amp;#x5DDE;&amp;#x5C9B;&amp;#x81EA;&amp;#x7531;&amp;#x884C;&lt;/li&gt;
&lt;li&gt;&amp;#x5DE5;&amp;#x4F5C;&amp;#x4E0A;&amp;#x80FD;&amp;#x591F;&amp;#x505A;&amp;#x5230;&amp;#x72EC;&amp;#x5F53;&amp;#x4E00;&amp;#x9762;&lt;/li&gt;
&lt;/ol&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;
    
    </summary>
    
      <category term="生活" scheme="http://leeboyue.com/categories/%E7%94%9F%E6%B4%BB/"/>
    
    
      <category term="技术" scheme="http://leeboyue.com/tags/%E6%8A%80%E6%9C%AF/"/>
    
  </entry>
  
  <entry>
    <title>2015年总结</title>
    <link href="http://leeboyue.com/2015/12/31/2015%E5%B9%B4%E6%80%BB%E7%BB%93/"/>
    <id>http://leeboyue.com/2015/12/31/2015年总结/</id>
    <published>2015-12-31T13:53:18.000Z</published>
    <updated>2016-03-02T07:42:04.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x8F6C;&amp;#x773C;&amp;#xFF0C;&amp;#x4E00;&amp;#x5E74;&amp;#x53C8;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#xFF0C;&amp;#x6BCF;&amp;#x5929;&amp;#x4E0A;&amp;#x73ED;&amp;#x5730;&amp;#x94C1;&amp;#x8DEF;&amp;#x4E0A;&amp;#x7684;&amp;#x4E00;&amp;#x5C0F;&amp;#x65F6;&amp;#x53EF;&amp;#x4EE5;&amp;#x6536;&amp;#x83B7;&amp;#x5F88;&amp;#x591A;&amp;#xFF0C;&amp;#x5217;&amp;#x4E00;&amp;#x4E0B;&amp;#x4ECA;&amp;#x5E74;&amp;#x7684;&amp;#x8BFB;&amp;#x4E66;&amp;#x6E05;&amp;#x5355;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#x300A;&amp;#x5927;&amp;#x578B;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x7F51;&amp;#x7AD9;&amp;#x67B6;&amp;#x6784;&amp;#x8BBE;&amp;#x8BA1;&amp;#x4E0E;&amp;#x5B9E;&amp;#x8DF5;&amp;#x300B;&lt;/li&gt;
&lt;li&gt;&amp;#x300A;&amp;#x5927;&amp;#x578B;&amp;#x7F51;&amp;#x7AD9;&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E0E;Java&amp;#x4E2D;&amp;#x95F4;&amp;#x4EF6;&amp;#x5B9E;&amp;#x8DF5;&amp;#x300B;&lt;/li&gt;
&lt;li&gt;&amp;#x300A;&amp;#x6DF1;&amp;#x5165;&amp;#x5206;&amp;#x6790;Java Web&amp;#x300B;&lt;/li&gt;
&lt;li&gt;&amp;#x300A;&amp;#x5927;&amp;#x89C4;&amp;#x6A21;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x7CFB;&amp;#x7EDF;&amp;#x67B6;&amp;#x6784;&amp;#x4E0E;&amp;#x8BBE;&amp;#x8BA1;&amp;#x5B9E;&amp;#x6218;&amp;#x300B;&lt;/li&gt;
&lt;li&gt;&amp;#x300A;Java&amp;#x52A0;&amp;#x5BC6;&amp;#x4E0E;&amp;#x89E3;&amp;#x5BC6;&amp;#x7684;&amp;#x827A;&amp;#x672F;&amp;#x300B;&lt;/li&gt;
&lt;li&gt;&amp;#x300A;Java&amp;#x5E76;&amp;#x53D1;&amp;#x7F16;&amp;#x7A0B;&amp;#x5B9E;&amp;#x6218;&amp;#x300B;&lt;/li&gt;
&lt;li&gt;&amp;#x300A;&amp;#x4ECE;Paxos&amp;#x5230;Zookeeper&amp;#x300B;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#x4ECA;&amp;#x5E74;&amp;#x7684;&amp;#x6280;&amp;#x672F;&amp;#x7C7B;&amp;#x4E66;&amp;#x7C4D;&amp;#x8BFB;&amp;#x7684;&amp;#x8FD8;&amp;#x7B97;&amp;#x6BD4;&amp;#x8F83;&amp;#x591A;&amp;#xFF0C;&amp;#x4ECE;0&amp;#x5230;1&amp;#xFF0C;&amp;#x4E86;&amp;#x89E3;&amp;#x4E86;&amp;#x5927;&amp;#x578B;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7684;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x7CFB;&amp;#x7EDF;&amp;#xFF0C;&amp;#x4EE5;&amp;#x53CA;&amp;#x9AD8;&amp;#x5E76;&amp;#x53D1;&amp;#x7F16;&amp;#x7A0B;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x7EC6;&amp;#x8282;&amp;#xFF0C;&amp;#x540C;&amp;#x65F6;&amp;#x4E5F;&amp;#x7B80;&amp;#x5355;&amp;#x4F7F;&amp;#x7528;&amp;#x4E86;&amp;#x4E00;&amp;#x4E9B;&amp;#x4E2D;&amp;#x95F4;&amp;#x4EF6;&amp;#x6BD4;&amp;#x5982;zookeeper&amp;#x505A;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;&amp;#x7B80;&amp;#x5355;&amp;#x7684;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x8C03;&amp;#x5EA6;&amp;#x7CFB;&amp;#x7EDF;&amp;#xFF0C;&amp;#x4E00;&amp;#x5E74;&amp;#x5DF2;&amp;#x7ECF;&amp;#x8FC7;&amp;#x53BB;&amp;#xFF0C;&amp;#x660E;&amp;#x5E74;&amp;#x4F1A;&amp;#x66F4;&amp;#x52A0;&amp;#x52AA;&amp;#x529B;&amp;#xFF01;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;
    
    </summary>
    
      <category term="生活" scheme="http://leeboyue.com/categories/%E7%94%9F%E6%B4%BB/"/>
    
    
      <category term="技术" scheme="http://leeboyue.com/tags/%E6%8A%80%E6%9C%AF/"/>
    
  </entry>
  
  <entry>
    <title>2015开源中国年终盛典</title>
    <link href="http://leeboyue.com/2015/12/13/2015%E5%BC%80%E6%BA%90%E4%B8%AD%E5%9B%BD%E5%B9%B4%E7%BB%88%E7%9B%9B%E5%85%B8/"/>
    <id>http://leeboyue.com/2015/12/13/2015开源中国年终盛典/</id>
    <published>2015-12-13T15:47:09.000Z</published>
    <updated>2016-03-02T07:42:21.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;osc&amp;#x5E74;&amp;#x7EC8;&amp;#x76DB;&amp;#x5178;&quot;&gt;OSC&amp;#x5E74;&amp;#x7EC8;&amp;#x76DB;&amp;#x5178;&lt;/h1&gt;&lt;p&gt;&amp;#x65E9;&amp;#x4E0A;&amp;#x4E0D;&amp;#x5230;6&amp;#x70B9;&amp;#x5C31;&amp;#x8D77;&amp;#x5E8A;&amp;#x51FA;&amp;#x53D1;&amp;#x6765;&amp;#x56FD;&amp;#x5BB6;&amp;#x4F1A;&amp;#x8BAE;&amp;#x4E2D;&amp;#x5FC3;&amp;#x4E86;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x4E00;&amp;#x6574;&amp;#x5929;&amp;#x597D;&amp;#x5145;&amp;#x5B9E;&amp;#xFF0C;&amp;#x89C1;&amp;#x5230;&amp;#x4E86;&amp;#x6C88;&amp;#x8BAF;&amp;#xFF0C;&amp;#x8FD8;&amp;#x52A0;&amp;#x4E86;&amp;#x5FAE;&amp;#x4FE1;&amp;#x597D;&amp;#x53CB;&amp;#xFF0C;&amp;#x4E0D;&amp;#x865A;&amp;#x6B64;&amp;#x884C;&amp;#xFF01;&lt;br&gt;&lt;img src=&quot;/2015/12/13/2015&amp;#x5F00;&amp;#x6E90;&amp;#x4E2D;&amp;#x56FD;&amp;#x5E74;&amp;#x7EC8;&amp;#x76DB;&amp;#x5178;/osc_3.jpg&quot; alt=&quot;&amp;#x5F00;&amp;#x573A;&quot;&gt;&lt;br&gt;&lt;img src=&quot;/2015/12/13/2015&amp;#x5F00;&amp;#x6E90;&amp;#x4E2D;&amp;#x56FD;&amp;#x5E74;&amp;#x7EC8;&amp;#x76DB;&amp;#x5178;/osc_1.jpg&quot; alt=&quot;&amp;#x6C88;&amp;#x8BAF;&amp;#x8BB2;&amp;#x8BFE;&quot;&gt;&lt;br&gt;&lt;img src=&quot;/2015/12/13/2015&amp;#x5F00;&amp;#x6E90;&amp;#x4E2D;&amp;#x56FD;&amp;#x5E74;&amp;#x7EC8;&amp;#x76DB;&amp;#x5178;/osc_2.jpg&quot; alt=&quot;&amp;#x5408;&amp;#x5F71;&quot;&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;osc&amp;#x5E
    
    </summary>
    
      <category term="活动" scheme="http://leeboyue.com/categories/%E6%B4%BB%E5%8A%A8/"/>
    
    
      <category term="技术交流" scheme="http://leeboyue.com/tags/%E6%8A%80%E6%9C%AF%E4%BA%A4%E6%B5%81/"/>
    
  </entry>
  
  <entry>
    <title>如何读源码</title>
    <link href="http://leeboyue.com/2015/09/12/%E5%A6%82%E4%BD%95%E8%AF%BB%E6%BA%90%E7%A0%81/"/>
    <id>http://leeboyue.com/2015/09/12/如何读源码/</id>
    <published>2015-09-12T15:51:25.000Z</published>
    <updated>2016-03-06T10:22:29.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;&amp;#x4E2A;&amp;#x4EBA;&amp;#x89C9;&amp;#x5F97;&amp;#x5B66;&amp;#x4E60;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E1C;&amp;#x897F;&amp;#x7684;&amp;#x6B65;&amp;#x9AA4;&quot;&gt;&amp;#x4E2A;&amp;#x4EBA;&amp;#x89C9;&amp;#x5F97;&amp;#x5B66;&amp;#x4E60;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E1C;&amp;#x897F;&amp;#x7684;&amp;#x6B65;&amp;#x9AA4;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x770B;&amp;#x4ECB;&amp;#x7ECD;&lt;/li&gt;
&lt;li&gt;&amp;#x770B;demo&lt;/li&gt;
&lt;li&gt;&amp;#x770B;&amp;#x5165;&amp;#x95E8;&lt;/li&gt;
&lt;li&gt;&amp;#x81EA;&amp;#x5DF1;&amp;#x505A;demo&lt;/li&gt;
&lt;li&gt;&amp;#x770B;&amp;#x5B98;&amp;#x65B9;&amp;#x6280;&amp;#x672F;&amp;#x6587;&amp;#x6863;&lt;/li&gt;
&lt;li&gt;&amp;#x5E94;&amp;#x7528;&lt;/li&gt;
&lt;li&gt;&amp;#x770B;&amp;#x603B;&amp;#x7ED3;&lt;/li&gt;
&lt;li&gt;&amp;#x770B;&amp;#x5FC3;&amp;#x5F97;&lt;/li&gt;
&lt;li&gt;&amp;#x601D;&amp;#x8003;&lt;/li&gt;
&lt;li&gt;&amp;#x770B;&amp;#x6E90;&amp;#x7801;&lt;/li&gt;
&lt;li&gt;debug&amp;#x8C03;&amp;#x8BD5;&amp;#x6E90;&amp;#x7801;&lt;/li&gt;
&lt;li&gt;&amp;#x4FEE;&amp;#x6539;&amp;#x6E90;&amp;#x7801;&lt;/li&gt;
&lt;li&gt;&amp;#x81EA;&amp;#x5DF1;&amp;#x505A;&amp;#x89C1;&amp;#x5F97;&amp;#x5B9E;&amp;#x73B0;&lt;/li&gt;
&lt;li&gt;&amp;#x4E0D;&amp;#x65AD;&amp;#x5B8C;&amp;#x5584;&lt;/li&gt;
&lt;/ol&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;&amp;#x4E2A;
    
    </summary>
    
      <category term="技术" scheme="http://leeboyue.com/categories/%E6%8A%80%E6%9C%AF/"/>
    
    
      <category term="java" scheme="http://leeboyue.com/tags/java/"/>
    
      <category term="随笔" scheme="http://leeboyue.com/tags/%E9%9A%8F%E7%AC%94/"/>
    
  </entry>
  
  <entry>
    <title>分布式技术架构</title>
    <link href="http://leeboyue.com/2015/06/26/%E5%88%86%E5%B8%83%E5%BC%8F%E6%8A%80%E6%9C%AF%E6%9E%B6%E6%9E%84/"/>
    <id>http://leeboyue.com/2015/06/26/分布式技术架构/</id>
    <published>2015-06-26T09:51:25.000Z</published>
    <updated>2016-03-02T07:41:27.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;zookeeper&quot;&gt;zookeeper&lt;/h1&gt;&lt;p&gt;&amp;#x5BF9;&amp;#x4E8E;zookeeper&amp;#x90E8;&amp;#x7F72;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x91CD;&amp;#x8981;&amp;#x63D0;&amp;#x793A;&amp;#xFF1A;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#x4F7F;&amp;#x7528;&amp;#x76D1;&amp;#x63A7;&amp;#x7A0B;&amp;#x5E8F;&amp;#x6765;&amp;#x8FD0;&amp;#x884C;zookeeper&amp;#x662F;&amp;#x5F88;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;zookeeper&amp;#x662F;&amp;#x5FEB;&amp;#x901F;&amp;#x5931;&amp;#x8D25;&amp;#x7684;&amp;#xFF0C;&amp;#x9047;&amp;#x5230;&amp;#x4EFB;&amp;#x4F55;&amp;#x9519;&amp;#x8BEF;&amp;#x60C5;&amp;#x51B5;&amp;#x5C06;&amp;#x4F1A;&amp;#x9000;&amp;#x51FA;&lt;/li&gt;
&lt;li&gt;&amp;#x7B80;&amp;#x5386;cron&amp;#x6765;&amp;#x538B;&amp;#x7F29;zookeeper&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x548C;&amp;#x4E8B;&amp;#x52A1;&amp;#x65E5;&amp;#x5FD7;&amp;#x662F;&amp;#x5F88;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#x3002;zookeeper&amp;#x5B88;&amp;#x62A4;&amp;#x8FDB;&amp;#x7A0B;&amp;#x81EA;&amp;#x5DF1;&amp;#x672C;&amp;#x8EAB;&amp;#x5E76;&amp;#x4E0D;&amp;#x4F1A;&amp;#x8FD9;&amp;#x4E48;&amp;#x505A;&amp;#xFF0C;&amp;#x5982;&amp;#x679C;&amp;#x4E0D;&amp;#x8BBE;&amp;#x7F6E;cron&amp;#xFF0C;zookeeper&amp;#x5F88;&amp;#x5FEB;&amp;#x5C31;&amp;#x4F1A;&amp;#x8017;&amp;#x5C3D;&amp;#x78C1;&amp;#x76D8;&amp;#x7A7A;&amp;#x95F4;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&quot;zookeeper&amp;#x529F;&amp;#x80FD;&amp;#x4ECB;&amp;#x7ECD;&quot;&gt;zookeeper&amp;#x529F;&amp;#x80FD;&amp;#x4ECB;&amp;#x7ECD;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x52A0;&amp;#x5F3A;&amp;#x96C6;&amp;#x7FA4;&amp;#x7A33;&amp;#x5B9A;&amp;#x6027;&lt;/li&gt;
&lt;li&gt;&amp;#x52A0;&amp;#x5F3A;&amp;#x96C6;&amp;#x7FA4;&amp;#x6301;&amp;#x7EED;&amp;#x6027;&lt;/li&gt;
&lt;li&gt;&amp;#x4FDD;&amp;#x8BC1;&amp;#x96C6;&amp;#x7FA4;&amp;#x6709;&amp;#x5E8F;&amp;#x6027;&lt;/li&gt;
&lt;li&gt;&amp;#x4FDD;&amp;#x8BC1;&amp;#x96C6;&amp;#x7FA4;&amp;#x9AD8;&amp;#x6548;&lt;/li&gt;
&lt;li&gt;&amp;#x6570;&amp;#x636E;&amp;#x7ED3;&amp;#x6784;&amp;#x548C;&amp;#x5206;&amp;#x7B49;&amp;#x7EA7;&amp;#x7684;&amp;#x7A7A;&amp;#x95F4;&amp;#x547D;&amp;#x540D;&amp;#xFF08;znode&amp;#xFF09;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&quot;zookeeper&amp;#x539F;&amp;#x7406;&amp;#x67B6;&amp;#x6784;&quot;&gt;zookeeper&amp;#x539F;&amp;#x7406;&amp;#x67B6;&amp;#x6784;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;zookeeper&amp;#x7684;&amp;#x6838;&amp;#x5FC3;&amp;#x662F;&amp;#x539F;&amp;#x5B50;&amp;#x5E7F;&amp;#x64AD;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x673A;&amp;#x5236;&amp;#x4FDD;&amp;#x8BC1;&amp;#x4E86;&amp;#x5404;&amp;#x4E2A;Server&amp;#x4E4B;&amp;#x95F4;&amp;#x7684;&amp;#x540C;&amp;#x6B65;&amp;#x3002;&amp;#x5B9E;&amp;#x73B0;&amp;#x8FD9;&amp;#x4E2A;&amp;#x673A;&amp;#x5236;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#x53EB;&amp;#x505A;Zab&amp;#x534F;&amp;#x8BAE;&amp;#x3002;Zab&amp;#x534F;&amp;#x8BAE;&amp;#x6709;&amp;#x4E24;&amp;#x79CD;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF0C;&amp;#x5B83;&amp;#x4EEC;&amp;#x5206;&amp;#x522B;&amp;#x662F;&amp;#x6062;&amp;#x590D;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF08;&amp;#x9009;&amp;#x4E3B;&amp;#xFF09;&amp;#x548C;&amp;#x5E7F;&amp;#x64AD;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF08;&amp;#x540C;&amp;#x6B65;&amp;#xFF09;&lt;/li&gt;
&lt;li&gt;&amp;#x5F53;&amp;#x670D;&amp;#x52A1;&amp;#x542F;&amp;#x52A8;&amp;#x6216;&amp;#x8005;&amp;#x5728;&amp;#x9886;&amp;#x5BFC;&amp;#x8005;&amp;#x5D29;&amp;#x6E83;&amp;#x540E;&amp;#xFF0C;Zab&amp;#x5C31;&amp;#x8FDB;&amp;#x5165;&amp;#x4E86;&amp;#x56DE;&amp;#x590D;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF0C;&amp;#x5F53;&amp;#x9886;&amp;#x5BFC;&amp;#x8005;&amp;#x88AB;&amp;#x9009;&amp;#x4E3E;&amp;#x51FA;&amp;#x6765;&amp;#xFF0C;&amp;#x4E14;&amp;#x5927;&amp;#x591A;&amp;#x6570;Server&amp;#x5B8C;&amp;#x6210;&amp;#x4E86;&amp;#x548C;leader&amp;#x7684;&amp;#x72B6;&amp;#x6001;&amp;#x540C;&amp;#x6B65;&amp;#x4EE5;&amp;#x540E;&amp;#xFF0C;&amp;#x6062;&amp;#x590D;&amp;#x6A21;&amp;#x5F0F;&amp;#x5C31;&amp;#x7ED3;&amp;#x675F;&amp;#x4E86;&amp;#x3002;&amp;#x72B6;&amp;#x6001;&amp;#x540C;&amp;#x6B65;&amp;#x4FDD;&amp;#x8BC1;&amp;#x4E86;leader&amp;#x548C;Server&amp;#x5177;&amp;#x6709;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x7CFB;&amp;#x7EDF;&amp;#x72B6;&amp;#x6001;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&amp;#x6BCF;&amp;#x4E2A;Server&amp;#x5DE5;&amp;#x4F5C;&amp;#x8FC7;&amp;#x7A0B;&amp;#x4E2D;&amp;#x7684;&amp;#x4E09;&amp;#x79CD;&amp;#x72B6;&amp;#x6001;&amp;#xFF1A;LOOKING&amp;#xFF08;&amp;#x6B63;&amp;#x5728;&amp;#x641C;&amp;#x5BFB;leader&amp;#xFF09;&amp;#xFF1B;LEADING&amp;#xFF08;&amp;#x4E3A;leader&amp;#x6807;&amp;#x8BB0;&amp;#xFF09;&amp;#xFF1B;FOLLOWING&amp;#xFF1A;leader&amp;#xFF08;&amp;#x5DF2;&amp;#x7ECF;&amp;#x9009;&amp;#x4E3E;&amp;#x51FA;&amp;#x6765;&amp;#x3002;&amp;#x5F53;&amp;#x524D;&amp;#x4E0E;&amp;#x4E4B;&amp;#x540C;&amp;#x6B65;&amp;#xFF09;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&quot;zookeeper&amp;#x9009;&amp;#x4E3E;&amp;#x673A;&amp;#x5236;&quot;&gt;zookeeper&amp;#x9009;&amp;#x4E3E;&amp;#x673A;&amp;#x5236;&lt;/h1&gt;&lt;p&gt;Fastleader&amp;#x9009;&amp;#x4E3E;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF1A;&lt;br&gt;&amp;#x5F53;leader&amp;#x5D29;&amp;#x6E83;&amp;#x6216;&amp;#x8005;&amp;#x5931;&amp;#x53BB;&amp;#x5927;&amp;#x591A;&amp;#x6570;&amp;#x7684;follower&amp;#x65F6;&amp;#xFF0C;&amp;#x8FD9;&amp;#x65F6;&amp;#x5019;zookeeper&amp;#x8FDB;&amp;#x5165;&amp;#x56DE;&amp;#x590D;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF0C;&amp;#x56DE;&amp;#x590D;&amp;#x6A21;&amp;#x5F0F;&amp;#x9700;&amp;#x8981;&amp;#x91CD;&amp;#x65B0;&amp;#x9009;&amp;#x4E3E;&amp;#x51FA;&amp;#x4E00;&amp;#x4E2A;&amp;#x65B0;&amp;#x7684;leader&amp;#xFF0C;&amp;#x8BA9;&amp;#x6240;&amp;#x6709;&amp;#x7684;Server&amp;#x90FD;&amp;#x6062;&amp;#x590D;&amp;#x5230;&amp;#x4E00;&amp;#x4E2A;&amp;#x6B63;&amp;#x786E;&amp;#x7684;&amp;#x72B6;&amp;#x6001;&amp;#x3002;&lt;/p&gt;
&lt;h1 id=&quot;zookeeper&amp;#x5E94;&amp;#x7528;&amp;#x573A;&amp;#x666F;&quot;&gt;zookeeper&amp;#x5E94;&amp;#x7528;&amp;#x573A;&amp;#x666F;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x7EDF;&amp;#x4E00;&amp;#x547D;&amp;#x540D;&amp;#x670D;&amp;#x52A1;&amp;#xFF08;Name Service&amp;#xFF09;&lt;/li&gt;
&lt;li&gt;&amp;#x914D;&amp;#x7F6E;&amp;#x7BA1;&amp;#x7406;&lt;/li&gt;
&lt;li&gt;&amp;#x96C6;&amp;#x7FA4;&amp;#x7BA1;&amp;#x7406;&lt;/li&gt;
&lt;li&gt;&amp;#x5171;&amp;#x4EAB;&amp;#x9501;&lt;/li&gt;
&lt;li&gt;&amp;#x961F;&amp;#x5217;&amp;#x7BA1;&amp;#x7406;&lt;/li&gt;
&lt;/ol&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;zookeepe
    
    </summary>
    
      <category term="技术" scheme="http://leeboyue.com/categories/%E6%8A%80%E6%9C%AF/"/>
    
    
      <category term="java" scheme="http://leeboyue.com/tags/java/"/>
    
      <category term="分布式" scheme="http://leeboyue.com/tags/%E5%88%86%E5%B8%83%E5%BC%8F/"/>
    
  </entry>
  
  <entry>
    <title>红烧鲈鱼</title>
    <link href="http://leeboyue.com/2015/06/21/%E7%BA%A2%E7%83%A7%E9%B2%88%E9%B1%BC/"/>
    <id>http://leeboyue.com/2015/06/21/红烧鲈鱼/</id>
    <published>2015-06-21T14:28:38.000Z</published>
    <updated>2016-03-02T07:41:55.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&lt;img src=&quot;/2015/06/21/&amp;#x7EA2;&amp;#x70E7;&amp;#x9C88;&amp;#x9C7C;/yu.jpg&quot; alt=&quot;&amp;#x7EA2;&amp;#x70E7;&amp;#x9C88;&amp;#x9C7C;&quot;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x8FDE;&amp;#x7EED;&amp;#x4E24;&amp;#x5929;&amp;#x8FC7;&amp;#x8282;&amp;#xFF0C;&amp;#x8D81;&amp;#x7740;&amp;#x56DE;&amp;#x5BB6;&amp;#x7684;&amp;#x673A;&amp;#x4F1A;&amp;#x8981;&amp;#x597D;&amp;#x597D;&amp;#x5B66;&amp;#x4E60;&amp;#x5B66;&amp;#x4E60;&amp;#x53A8;&amp;#x827A;&amp;#x3002;&amp;#x81EA;&amp;#x4ECE;&amp;#x51FA;&amp;#x9053;&amp;#x4EE5;&amp;#x6765;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x6CA1;&amp;#x505A;&amp;#x8FC7;&amp;#x9C7C;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x5728;&amp;#x5BB6;&amp;#x5C0F;&amp;#x8BD5;&amp;#x725B;&amp;#x5200;&amp;#xFF0C;&amp;#x8001;&amp;#x5A18;&amp;#x624B;&amp;#x628A;&amp;#x624B;&amp;#x6559;&amp;#x6211;&amp;#xFF0C;&amp;#x4E8E;&amp;#x662F;&amp;#x4E4E;&amp;#x5B9A;&amp;#x8981;&amp;#x628A;&amp;#x5185;&amp;#x529F;&amp;#x5FC3;&amp;#x6CD5;&amp;#x8BB0;&amp;#x5F55;&amp;#x4E0B;&amp;#x6765;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&quot;step1&amp;#x57FA;&amp;#x672C;&amp;#x98DF;&amp;#x6750;&quot;&gt;Step1.&amp;#x57FA;&amp;#x672C;&amp;#x98DF;&amp;#x6750;&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x9C88;&amp;#x9C7C;&lt;/li&gt;
&lt;li&gt;&amp;#x8471;&amp;#x3001;&amp;#x59DC;&amp;#x3001;&amp;#x849C;&amp;#x3001;&amp;#x5927;&amp;#x6599;&amp;#x3001;&amp;#x82B1;&amp;#x6912;&lt;/li&gt;
&lt;li&gt;&amp;#x7CD6;&amp;#x3001;&amp;#x918B;&amp;#x3001;&amp;#x8017;&amp;#x6CB9;&amp;#x3001;&amp;#x9171;&amp;#x6CB9;&amp;#x3001;&amp;#x6599;&amp;#x9152;&amp;#x3001;&amp;#x9762;&amp;#x6216;&amp;#x8005;&amp;#x6DC0;&amp;#x7C89;&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&quot;step2&amp;#x5F00;&amp;#x59CB;&amp;#x505A;&amp;#x83DC;&amp;#x5427;&quot;&gt;Step2.&amp;#x5F00;&amp;#x59CB;&amp;#x505A;&amp;#x83DC;&amp;#x5427;&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x628A;&amp;#x9C7C;&amp;#x6D17;&amp;#x5E72;&amp;#x51C0;&amp;#xFF0C;&amp;#x5207;&amp;#x597D;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x51C6;&amp;#x5907;&amp;#x597D;&amp;#x8471;&amp;#x59DC;&amp;#x5927;&amp;#x849C;&amp;#x5C11;&amp;#x8BB8;&amp;#xFF0C;&amp;#x653E;&amp;#x5728;&amp;#x7897;&amp;#x91CC;&amp;#xFF08;&amp;#x8C03;&amp;#x6599;&amp;#x4E00;&amp;#xFF09;&lt;/li&gt;
&lt;li&gt;&amp;#x518D;&amp;#x51C6;&amp;#x5907;&amp;#x4E00;&amp;#x4E2A;&amp;#x7897;&amp;#x7528;&amp;#x6765;&amp;#x8C03;&amp;#x6599;&amp;#xFF1A;&amp;#x653E;&amp;#x5C11;&amp;#x8BB8;&amp;#x7CD6;&amp;#xFF0C;&amp;#x918B;&amp;#x548C;&amp;#x5747;&amp;#x5300;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x7A0D;&amp;#x5FAE;&amp;#x591A;&amp;#x5012;&amp;#x4E00;&amp;#x4E9B;&amp;#x9171;&amp;#x6CB9;&amp;#x548C;&amp;#x8017;&amp;#x6CB9;&amp;#xFF08;&amp;#x8C03;&amp;#x6599;&amp;#x4E8C;&amp;#xFF09;&lt;/li&gt;
&lt;li&gt;&amp;#x62FF;&amp;#x4E00;&amp;#x4E2A;&amp;#x789F;&amp;#x5B50;&amp;#xFF0C;&amp;#x5012;&amp;#x4E0A;&amp;#x9762;&amp;#x7C89;&amp;#x6216;&amp;#x8005;&amp;#x6DC0;&amp;#x7C89;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x628A;&amp;#x5904;&amp;#x7406;&amp;#x597D;&amp;#x7684;&amp;#x9C7C;&amp;#x653E;&amp;#x5728;&amp;#x91CC;&amp;#x9762;&amp;#xFF0C;&amp;#x8BA9;&amp;#x5176;&amp;#x8868;&amp;#x9762;&amp;#x7C98;&amp;#x4E0A;&amp;#x9762;&amp;#x7C89;&amp;#x5373;&amp;#x53EF;&lt;/li&gt;
&lt;li&gt;&amp;#x5F00;&amp;#x706B;&amp;#x709D;&amp;#x9505;&amp;#xFF0C;&amp;#x5012;&amp;#x4E9B;&amp;#x82B1;&amp;#x6912;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x53BB;&amp;#x8165;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x628A;&amp;#x9C7C;&amp;#x653E;&amp;#x5728;&amp;#x9505;&amp;#x91CC;&lt;/li&gt;
&lt;li&gt;&amp;#x6700;&amp;#x597D;&amp;#x4E0D;&amp;#x8981;&amp;#x9891;&amp;#x7E41;&amp;#x7684;&amp;#x7528;&amp;#x94F2;&amp;#x5B50;&amp;#x6405;&amp;#x548C;&amp;#x9C7C;&amp;#xFF0C;&amp;#x5BB9;&amp;#x6613;&amp;#x628A;&amp;#x9C7C;&amp;#x76AE;&amp;#x5F04;&amp;#x70C2;&lt;/li&gt;
&lt;li&gt;&amp;#x6643;&amp;#x60A0;&amp;#x9505;&amp;#x91CC;&amp;#x7684;&amp;#x6CB9;&amp;#xFF0C;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x4E86;&amp;#x5C31;&amp;#x628A;&amp;#x521A;&amp;#x521A;&amp;#x51C6;&amp;#x5907;&amp;#x597D;&amp;#x7684;&amp;#x8471;&amp;#x59DC;&amp;#x5927;&amp;#x849C;&amp;#xFF08;&amp;#x8C03;&amp;#x6599;&amp;#x4E00;&amp;#xFF09;&amp;#x5012;&amp;#x8FDB;&amp;#x53BB;&lt;/li&gt;
&lt;li&gt;&amp;#x5FEB;&amp;#x901F;&amp;#x7528;&amp;#x6599;&amp;#x9152;&amp;#x6492;&amp;#x9505;&amp;#x4E00;&amp;#x5708;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x95F7;&amp;#x4E0A;&amp;#x76D6;&amp;#x5B50;&amp;#xFF0C;&amp;#x6599;&amp;#x9152;&amp;#x53EF;&amp;#x4EE5;&amp;#x53BB;&amp;#x8165;&lt;/li&gt;
&lt;li&gt;&amp;#x8F7B;&amp;#x8F7B;&amp;#x5730;&amp;#x5C06;&amp;#x9C7C;&amp;#x7FFB;&amp;#x4E2A;&amp;#x8EAB;&amp;#xFF0C;&amp;#x8BA9;&amp;#x4E24;&amp;#x9762;&amp;#x53D7;&amp;#x70ED;&amp;#x5747;&amp;#x5300;&lt;/li&gt;
&lt;li&gt;&amp;#x628A;&amp;#x521A;&amp;#x521A;&amp;#x51C6;&amp;#x5907;&amp;#x597D;&amp;#x7684;&amp;#x8C03;&amp;#x6599;&amp;#x4E8C;&amp;#x52A0;&amp;#x4E00;&amp;#x4E9B;&amp;#x81EA;&amp;#x6765;&amp;#x6C34;&amp;#xFF0C;&amp;#x5012;&amp;#x5165;&amp;#x9505;&amp;#x4E2D;&amp;#xFF0C;&amp;#x76F4;&amp;#x5230;&amp;#x9505;&amp;#x4E2D;&amp;#x7684;&amp;#x6C34;&amp;#x8986;&amp;#x76D6;&amp;#x8FC7;&amp;#x9C7C;&lt;/li&gt;
&lt;li&gt;&amp;#x5F00;&amp;#x5927;&amp;#x706B;&amp;#xFF0C;&amp;#x76D6;&amp;#x4E0A;&amp;#x76D6;&amp;#x5B50;&amp;#xFF0C;&amp;#x7B49;&amp;#x5F85;&amp;#x6536;&amp;#x6C41;&amp;#x5427;&amp;#xFF01;&lt;/li&gt;
&lt;li&gt;&amp;#x522B;&amp;#x5FD8;&amp;#x4E86;&amp;#xFF0C;&amp;#x65F6;&amp;#x4E0D;&amp;#x65F6;&amp;#x7684;&amp;#x6643;&amp;#x60A0;&amp;#x4E00;&amp;#x4E0B;&amp;#x9505;&amp;#xFF0C;&amp;#x522B;&amp;#x8BA9;&amp;#x9505;&amp;#x5E95;&amp;#x7684;&amp;#x9C7C;&amp;#x7CCA;&amp;#x4E86;&amp;#xFF0C;&amp;#x94F2;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x5C0F;&amp;#x5FC3;&amp;#x4E00;&amp;#x4E9B;&lt;/li&gt;
&lt;li&gt;&amp;#x5982;&amp;#x679C;&amp;#x89C9;&amp;#x5F97;&amp;#x4E0D;&amp;#x591F;&amp;#x54B8;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x653E;&amp;#x4E00;&amp;#x4E9B;&amp;#x76D0;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8FC7;&amp;#x4E4B;&amp;#x524D;&amp;#x8C03;&amp;#x6599;&amp;#x4E8C;&amp;#x5DF2;&amp;#x7ECF;&amp;#x5F88;&amp;#x6709;&amp;#x54B8;&amp;#x86CB;&amp;#x5473;&amp;#x4E86;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#x597D;&amp;#x4E86;&amp;#xFF0C;&amp;#x5C31;&amp;#x8FD9;&amp;#x4E48;&amp;#x591A;&amp;#xFF0C;&amp;#x671F;&amp;#x5F85;&amp;#x4E0B;&amp;#x4E00;&amp;#x671F;&amp;#x7F8E;&amp;#x98DF;&amp;#xFF0C;see you again~&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;p&gt;&lt;img src=&quot;/20
    
    </summary>
    
      <category term="菜谱" scheme="http://leeboyue.com/categories/%E8%8F%9C%E8%B0%B1/"/>
    
    
      <category term="家常菜" scheme="http://leeboyue.com/tags/%E5%AE%B6%E5%B8%B8%E8%8F%9C/"/>
    
      <category term="海鲜" scheme="http://leeboyue.com/tags/%E6%B5%B7%E9%B2%9C/"/>
    
  </entry>
  
  <entry>
    <title>zookeeper集群初识</title>
    <link href="http://leeboyue.com/2015/06/17/zookeeper%E9%9B%86%E7%BE%A4%E5%88%9D%E8%AF%86/"/>
    <id>http://leeboyue.com/2015/06/17/zookeeper集群初识/</id>
    <published>2015-06-17T11:25:56.000Z</published>
    <updated>2016-03-02T07:42:28.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x4ECA;&amp;#x5929;&amp;#x7814;&amp;#x7A76;&amp;#x4E86;&amp;#x4E00;&amp;#x4E0B;zookeeper&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x516C;&amp;#x53F8;&amp;#x6765;&amp;#x8BF4;&amp;#xFF0C;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x67B6;&amp;#x6784;&amp;#x662F;&amp;#x5FC5;&amp;#x987B;&amp;#x7684;&amp;#xFF0C;zookeeper&amp;#x6B63;&amp;#x662F;&amp;#x9488;&amp;#x5BF9;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x5E94;&amp;#x7528;&amp;#x7684;&amp;#x9AD8;&amp;#x6027;&amp;#x80FD;&amp;#x534F;&amp;#x8C03;&amp;#x670D;&amp;#x52A1;&amp;#xFF0C;&amp;#x63D0;&amp;#x4F9B;&amp;#x5305;&amp;#x62EC;&amp;#x914D;&amp;#x7F6E;&amp;#x7EF4;&amp;#x62A4;&amp;#x3001;&amp;#x540D;&amp;#x5B57;&amp;#x670D;&amp;#x52A1;&amp;#x3001;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x540C;&amp;#x6B65;&amp;#x3001;&amp;#x7EC4;&amp;#x670D;&amp;#x52A1;&amp;#x7B49;&amp;#x3002;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#x4E0B;&amp;#x9762;&amp;#x4ECB;&amp;#x7ECD;&amp;#x4E00;&amp;#x4E0B;&amp;#x914D;&amp;#x7F6E;zookeeper&amp;#x96C6;&amp;#x7FA4;&amp;#x7684;&amp;#x8FC7;&amp;#x7A0B;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#x590D;&amp;#x5236;&amp;#x4E09;&amp;#x4E2A;zookeeper&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x914D;&amp;#x7F6E;&amp;#x6BCF;&amp;#x4E00;&amp;#x4E2A;zookeeper&amp;#x7684;zoo.cfg&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&lt;/p&gt;
&lt;figure class=&quot;highlight bash&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;6&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;7&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;8&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;9&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;10&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;11&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;tickTime=&lt;span class=&quot;number&quot;&gt;2000&lt;/span&gt;    &lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;initLimit=&lt;span class=&quot;number&quot;&gt;10&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;syncLimit=&lt;span class=&quot;number&quot;&gt;5&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;comment&quot;&gt;#&amp;#x6307;&amp;#x5B9A;dataDir&amp;#x76EE;&amp;#x5F55;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;dataDir=/Users/bear_lee/development/zookeeper/data/zookeeper3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;dataLogDir=/Users/bear_lee/development/zookeeper/logs/zookeeper3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;comment&quot;&gt;#clientPort&amp;#xFF1A;zookeeper&amp;#x7684;&amp;#x7AEF;&amp;#x53E3;&amp;#x53F7;&amp;#xFF0C;&amp;#x5728;&amp;#x540C;&amp;#x4E00;&amp;#x53F0;&amp;#x673A;&amp;#x5668;&amp;#x4E0B;&amp;#x4E0D;&amp;#x540C;zookeeper&amp;#x7AEF;&amp;#x53E3;&amp;#x53F7;&amp;#x4E0D;&amp;#x80FD;&amp;#x4E00;&amp;#x6837;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;clientPort=&lt;span class=&quot;number&quot;&gt;2183&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;server.&lt;span class=&quot;number&quot;&gt;1&lt;/span&gt;=&lt;span class=&quot;number&quot;&gt;127.0&lt;/span&gt;.&lt;span class=&quot;number&quot;&gt;0.1&lt;/span&gt;:&lt;span class=&quot;number&quot;&gt;2881&lt;/span&gt;:&lt;span class=&quot;number&quot;&gt;3881&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;server.&lt;span class=&quot;number&quot;&gt;2&lt;/span&gt;=&lt;span class=&quot;number&quot;&gt;127.0&lt;/span&gt;.&lt;span class=&quot;number&quot;&gt;0.1&lt;/span&gt;:&lt;span class=&quot;number&quot;&gt;2882&lt;/span&gt;:&lt;span class=&quot;number&quot;&gt;3882&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;server.&lt;span class=&quot;number&quot;&gt;3&lt;/span&gt;=&lt;span class=&quot;number&quot;&gt;127.0&lt;/span&gt;.&lt;span class=&quot;number&quot;&gt;0.1&lt;/span&gt;:&lt;span class=&quot;number&quot;&gt;2883&lt;/span&gt;:&lt;span class=&quot;number&quot;&gt;3883&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x5728;3&amp;#x4E2A;zookeeper&amp;#x7684;dataDir&amp;#x76EE;&amp;#x5F55;&amp;#x4E0B;&amp;#x9762;&amp;#x5206;&amp;#x522B;&amp;#x521B;&amp;#x5EFA;&amp;#x6587;&amp;#x4EF6;&amp;#xFF0C;&amp;#x53D6;&amp;#x540D;myid&amp;#xFF0C;&amp;#x5206;&amp;#x522B;&amp;#x5199;&amp;#x5165;1&amp;#x3001;2&amp;#x3001;3&amp;#x3002;&amp;#x5176;&amp;#x4E2D;1&amp;#xFF0C;2&amp;#xFF0C;3&amp;#x5206;&amp;#x522B;&amp;#x6307;&amp;#x7684;&amp;#x662F;zoo.cfg&amp;#x6587;&amp;#x4EF6;&amp;#x4E2D;&amp;#x7684;server.1 server.2 server.3&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x542F;&amp;#x52A8;3&amp;#x4E2A;zookeeper&amp;#xFF1A;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ ./zkServer.sh start&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x968F;&amp;#x4FBF;&amp;#x8FDB;&amp;#x5165;&amp;#x4E00;&amp;#x4E2A;zookeeper&amp;#xFF0C;&amp;#x542F;&amp;#x52A8;zkCli&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x6211;&amp;#x4EEC;&amp;#x4F1A;&amp;#x53D1;&amp;#x73B0;&amp;#x8FDE;&amp;#x63A5;&amp;#x4E86;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;zookeeper&amp;#xFF0C;&amp;#x8BE5;zookeeper&amp;#x5219;&amp;#x662F;&amp;#x6574;&amp;#x4E2A;&amp;#x96C6;&amp;#x7FA4;&amp;#x7684;leader&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ ./zkCli.sh&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;/ol&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;blockquote&gt;
&lt;p&gt;
    
    </summary>
    
      <category term="技术" scheme="http://leeboyue.com/categories/%E6%8A%80%E6%9C%AF/"/>
    
    
      <category term="zookeeper" scheme="http://leeboyue.com/tags/zookeeper/"/>
    
      <category term="分布式" scheme="http://leeboyue.com/tags/%E5%88%86%E5%B8%83%E5%BC%8F/"/>
    
  </entry>
  
  <entry>
    <title>如何搭建个人博客</title>
    <link href="http://leeboyue.com/2015/06/07/%E5%A6%82%E4%BD%95%E6%90%AD%E5%BB%BA%E4%B8%AA%E4%BA%BA%E5%8D%9A%E5%AE%A2/"/>
    <id>http://leeboyue.com/2015/06/07/如何搭建个人博客/</id>
    <published>2015-06-07T09:51:25.000Z</published>
    <updated>2016-03-08T04:03:11.000Z</updated>
    
    <content type="html">&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;hexo&amp;#x4F60;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&quot;&gt;hexo&amp;#x4F60;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&lt;/h1&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x4F5C;&amp;#x4E3A;&amp;#x6280;&amp;#x672F;&amp;#x4EBA;&amp;#x5458;&amp;#x5E94;&amp;#x8BE5;&amp;#x6709;&amp;#x4E2A;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#xFF1A;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x8BB0;&amp;#x5F55;&amp;#x5B66;&amp;#x4E60;&amp;#x77E5;&amp;#x8BC6;&lt;/li&gt;
&lt;li&gt;&amp;#x603B;&amp;#x7ED3;&amp;#x77E5;&amp;#x8BC6;&amp;#x70B9;&amp;#xFF0C;&amp;#x505A;&amp;#x5FC3;&amp;#x5F97;&amp;#x4F53;&amp;#x4F1A;&lt;/li&gt;
&lt;li&gt;&amp;#x7ED3;&amp;#x4EA4;&amp;#x670B;&amp;#x53CB;&lt;/li&gt;
&lt;/ul&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#x5E9F;&amp;#x8BDD;&amp;#x4E0D;&amp;#x591A;&amp;#x8BF4;&amp;#xFF0C;&amp;#x7F51;&amp;#x4E0A;&amp;#x627E;&amp;#x4E86;&amp;#x5F88;&amp;#x591A;hexo&amp;#x5EFA;&amp;#x7AD9;&amp;#x7684;&amp;#x6559;&amp;#x7A0B;&amp;#xFF0C;&amp;#x90FD;&amp;#x4E0D;&amp;#x9760;&amp;#x8C31;&amp;#xFF0C;&amp;#x6700;&amp;#x540E;&amp;#x7ECF;&amp;#x8FC7;&amp;#x6478;&amp;#x722C;&amp;#x6EDA;&amp;#x6253;&amp;#x56DB;&amp;#x5904;&amp;#x63D0;&amp;#x95EE;&amp;#x4E4B;&amp;#x540E;&amp;#xFF0C;&amp;#x603B;&amp;#x7ED3;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;&amp;#x9760;&amp;#x8C31;&amp;#x7684;&amp;#x5EFA;&amp;#x7AD9;&amp;#x6D41;&amp;#x7A0B;&amp;#xFF0C;&amp;#x5206;&amp;#x4EAB;&amp;#x5982;&amp;#x4E0B;&amp;#xFF1A;&lt;/p&gt;
&lt;h2 id=&quot;step1&amp;#x642D;&amp;#x5EFA;&amp;#x73AF;&amp;#x5883;&quot;&gt;Step1.&amp;#x642D;&amp;#x5EFA;&amp;#x73AF;&amp;#x5883;&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x5B89;&amp;#x88C5;Node.js&lt;/em&gt;&lt;/strong&gt;&lt;br&gt;hexo&amp;#x662F;&amp;#x5E95;&amp;#x5C42;&amp;#x662F;&amp;#x57FA;&amp;#x4E8E;node&amp;#x7684;&amp;#xFF0C;&amp;#x4E0D;&amp;#x4F1A;node&amp;#x6CA1;&amp;#x5173;&amp;#x7CFB;&amp;#x6211;&amp;#x4EEC;&amp;#x53EA;&amp;#x9700;&amp;#x8981;&amp;#x5B89;&amp;#x88C5;&amp;#x597D;node&amp;#x5C31;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x7BA1;&amp;#x5176;&amp;#x5B83;&amp;#x7684;&amp;#x5566;&amp;#x3002;&amp;#x5230;&lt;a href=&quot;http://nodejs.org/download&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Node.js&amp;#x5B98;&amp;#x7F51;&amp;#x4E0B;&amp;#x8F7D;&lt;/a&gt;&amp;#x64CD;&amp;#x4F5C;&amp;#x7CFB;&amp;#x7EDF;&amp;#x5BF9;&amp;#x5E94;&amp;#x7684;&amp;#x7248;&amp;#x672C;&amp;#xFF0C;&amp;#x5B89;&amp;#x88C5;&amp;#x4E00;&amp;#x8DEF;next&amp;#x5C31;&amp;#x597D;&amp;#x4E86;&amp;#xFF0C;&amp;#x6211;&amp;#x5B89;&amp;#x88C5;&amp;#x7684;&amp;#x7248;&amp;#x672C;&amp;#x662F;v0.12.4&amp;#xFF0C;&amp;#x67E5;&amp;#x770B;&amp;#x662F;&amp;#x5426;&amp;#x6309;&amp;#x7167;&amp;#x6210;&amp;#x529F;&amp;#x4EE5;&amp;#x53CA;node&amp;#x7248;&amp;#x672C;&amp;#xFF0C;&amp;#x7528;&amp;#x5982;&amp;#x4E0B;&amp;#x547D;&amp;#x4EE4;&amp;#xFF1A;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ node -v&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;v0&lt;span class=&quot;number&quot;&gt;.12&lt;/span&gt;&lt;span class=&quot;number&quot;&gt;.4&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x5B89;&amp;#x88C5;Git&lt;/em&gt;&lt;/strong&gt;&lt;br&gt;&amp;#x6211;&amp;#x7528;&amp;#x7684;&amp;#x662F;mac pro&amp;#xFF0C;&amp;#x7CFB;&amp;#x7EDF;&amp;#x81EA;&amp;#x5E26;git&amp;#xFF0C;&amp;#x56E0;&amp;#x6B64;&amp;#x7528;Mac&amp;#x7684;&amp;#x540C;&amp;#x5B66;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x770B;&amp;#x5566;&amp;#xFF01;&amp;#x5B89;&amp;#x88C5;git&amp;#x7684;&amp;#x76EE;&amp;#x7684;&amp;#x5C31;&amp;#x662F;&amp;#x4E3A;&amp;#x4E86;&amp;#x5C06;&amp;#x672C;&amp;#x5730;&amp;#x4EE3;&amp;#x7801;&amp;#x4E0A;&amp;#x4F20;&amp;#x5230;Github&amp;#x4E0A;&amp;#x3002;Git&amp;#x7684;&amp;#x5BA2;&amp;#x6237;&amp;#x7AEF;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#xFF0C;&amp;#x8FD9;&amp;#x91CC;&amp;#x63A8;&amp;#x8350;&lt;a href=&quot;http://code.google.com/p/msysgit&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;msysgit&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&lt;em&gt;&amp;#x5B89;&amp;#x88C5;Sublime&lt;/em&gt;&lt;/strong&gt;&lt;br&gt;&amp;#x73AF;&amp;#x5883;&amp;#x642D;&amp;#x5EFA;&amp;#x5B8C;&amp;#x4E86;&amp;#xFF0C;&amp;#x4E0B;&amp;#x9762;&amp;#x6211;&amp;#x4EEC;&amp;#x5F53;&amp;#x7136;&amp;#x8981;&amp;#x5F00;&amp;#x59CB;&amp;#x5199;&amp;#x6587;&amp;#x7AE0;&amp;#x5566;&amp;#xFF01;&amp;#x8FD9;&amp;#x91CC;&amp;#x63A8;&amp;#x8350;&amp;#x7528;&lt;a href=&quot;http://www.sublimetext.com/3&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Sublime&lt;/a&gt;&amp;#x7F16;&amp;#x8F91;&amp;#x5668;&amp;#x7F16;&amp;#x5199;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x8D76;&amp;#x7D27;&amp;#x4E0B;&amp;#x8F7D;&amp;#x4E00;&amp;#x4E2A;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x6211;&amp;#x4EEC;&amp;#x53EF;&amp;#x4EE5;&amp;#x5F00;&amp;#x59CB;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x6781;&amp;#x5BA2;&amp;#x4E4B;&amp;#x65C5;&amp;#x4E86;&amp;#x3002;&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&quot;step2&amp;#x7ED1;&amp;#x5B9A;github&amp;#x8D26;&amp;#x53F7;&quot;&gt;Step2.&amp;#x7ED1;&amp;#x5B9A;Github&amp;#x8D26;&amp;#x53F7;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;GitHub&amp;#x8D26;&amp;#x53F7;&amp;#x548C;GitHub Pages &amp;#x4E00;&amp;#x822C;&amp;#x90FD;&amp;#x5E94;&amp;#x8BE5;&amp;#x6709;&amp;#x5427;&amp;#xFF0C;&amp;#x5DF2;&amp;#x6709;&amp;#x7684;&amp;#x8BF7;&amp;#x81EA;&amp;#x52A8;&amp;#x65E0;&amp;#x89C6;&amp;#x8FD9;&amp;#x4E00;&amp;#x90E8;&amp;#x5206;&amp;#x3002;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&quot;step3&amp;#x5F00;&amp;#x59CB;&amp;#x8FC5;&amp;#x901F;&amp;#x5EFA;&amp;#x7AD9;&quot;&gt;Step3.&amp;#x5F00;&amp;#x59CB;&amp;#x8FC5;&amp;#x901F;&amp;#x5EFA;&amp;#x7AD9;&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x5B89;&amp;#x88C5;hexo&amp;#xFF0C;&amp;#x5728;terminal&amp;#x91CC;&amp;#x6267;&amp;#x884C;&amp;#x5982;&amp;#x4E0B;&amp;#x547D;&amp;#x4EE4;&amp;#xFF1A;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ npm install hexo-cli -g&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x521D;&amp;#x59CB;&amp;#x5316;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo init blog&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt; &amp;#x6267;&amp;#x884C;&amp;#x5B8C;&amp;#x8FD9;&amp;#x6761;&amp;#x547D;&amp;#x4EE4;&amp;#x540E;&amp;#xFF0C;&amp;#x4F1A;&amp;#x5728;&amp;#x4F60;&amp;#x5F53;&amp;#x524D;&amp;#x76EE;&amp;#x5F55;&amp;#x4E0B;&amp;#x751F;&amp;#x6210;&amp;#x4E00;&amp;#x4E2A;&amp;#x540D;&amp;#x53EB;blog&amp;#x7684;&amp;#x6587;&amp;#x4EF6;&amp;#x5939;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&lt;strong&gt;cd blog&amp;#x5230;&amp;#x4F60;&amp;#x7684;&amp;#x6587;&amp;#x4EF6;&amp;#x5939;&amp;#x91CC;&lt;/strong&gt;&amp;#xFF0C;&amp;#x4EE5;&amp;#x540E;&amp;#x6240;&amp;#x6709;&amp;#x547D;&amp;#x4EE4;&amp;#x90FD;&amp;#x5728;&amp;#x8FD9;&amp;#x4E2A;&amp;#x76EE;&amp;#x5F55;&amp;#x4E0B;&amp;#x6267;&amp;#x884C;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x5B89;&amp;#x88C5;&amp;#x63D2;&amp;#x4EF6;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ npm install&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x542F;&amp;#x52A8;&amp;#x670D;&amp;#x52A1;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo server&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt; &amp;#x6D4F;&amp;#x89C8;&amp;#x5668;&amp;#x8F93;&amp;#x5165;&lt;a href=&quot;http://localhost:4000&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x770B;&amp;#x5230;&amp;#x6548;&amp;#x679C;&amp;#x3002;&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;http://localhost:4000&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x770B;&amp;#x5230;&amp;#x6548;&amp;#x679C;&amp;#x3002;&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&quot;step4&amp;#x5F00;&amp;#x5199;&quot;&gt;Step4.&amp;#x5F00;&amp;#x5199;&amp;#xFF01;&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x751F;&amp;#x6210;&amp;#x6587;&amp;#x7AE0;&lt;/em&gt;&lt;/strong&gt;&lt;br&gt;&amp;#x6267;&amp;#x884C;new&amp;#x547D;&amp;#x4EE4;&amp;#xFF0C;&amp;#x751F;&amp;#x6210;&amp;#x6307;&amp;#x5B9A;&amp;#x540D;&amp;#x79F0;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x81F3;hexo\source_posts\postName.md&amp;#x3002;&lt;/p&gt;
 &lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo new &lt;span class=&quot;string&quot;&gt;&amp;quot;postName&amp;quot;&lt;/span&gt; &lt;span class=&quot;comment&quot;&gt;#&amp;#x65B0;&amp;#x5EFA;&amp;#x6587;&amp;#x7AE0;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x751F;&amp;#x6210;html&lt;/em&gt;&lt;/strong&gt;&lt;br&gt; &amp;#x90E8;&amp;#x7F72;&amp;#x535A;&amp;#x5BA2;&amp;#x4E4B;&amp;#x524D;&amp;#xFF0C;&amp;#x8FD8;&amp;#x9700;&amp;#x8981;&amp;#x751F;&amp;#x6210;html&amp;#x9759;&amp;#x6001;&amp;#x9875;&amp;#x9762;&amp;#xFF0C;&amp;#x6267;&amp;#x884C;&amp;#x4E0B;&amp;#x9762;&amp;#x4EE3;&amp;#x7801;&amp;#x5373;&amp;#x53EF;&amp;#xFF1A;&lt;/p&gt;
 &lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo generate&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x90E8;&amp;#x7F72;&amp;#x5230;Github pages&amp;#x4E0A;&lt;/em&gt;&lt;/strong&gt;&lt;br&gt; html&amp;#x751F;&amp;#x6210;&amp;#x597D;&amp;#x4E86;&amp;#xFF0C;&amp;#x5728;&amp;#x4E0A;&amp;#x4F20;Github&amp;#x4E4B;&amp;#x524D;&amp;#x8FD8;&amp;#x9700;&amp;#x8981;&amp;#x4FEE;&amp;#x6539;&amp;#x4E00;&amp;#x4E0B;&amp;#x6839;&amp;#x76EE;&amp;#x5F55;&amp;#x4E0B;&amp;#x7684;_config.yml&amp;#x914D;&amp;#x7F6E;&amp;#x6587;&amp;#x4EF6;&lt;/p&gt;
 &lt;figure class=&quot;highlight less&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attribute&quot;&gt;deploy&lt;/span&gt;:&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;attribute&quot;&gt;type&lt;/span&gt;: git&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;attribute&quot;&gt;repository&lt;/span&gt;: &lt;span class=&quot;attribute&quot;&gt;https&lt;/span&gt;:&lt;span class=&quot;comment&quot;&gt;//github.com/liboyue23/liboyue23.github.io.git&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;attribute&quot;&gt;branch&lt;/span&gt;: master&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt; &amp;#x5B89;&amp;#x88C5;deploy&amp;#x63D2;&amp;#x4EF6;&amp;#xFF1A;&lt;/p&gt;
&lt;p&gt; &amp;#x63A5;&amp;#x4E0B;&amp;#x6765;&amp;#xFF0C;&amp;#x8BA9;&amp;#x6211;&amp;#x4EEC;&amp;#x6267;&amp;#x884C;&amp;#x6700;&amp;#x540E;&amp;#x4E00;&amp;#x6B65;&amp;#x628A;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#x4E0A;&amp;#x4F20;&amp;#x5230;Github&amp;#x4E0A;&amp;#x5427;&amp;#xFF01;&lt;/p&gt;
 &lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ npm install hexo-deployer-git --save&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;$ hexo deploy&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt; &amp;#x5927;&amp;#x529F;&amp;#x544A;&amp;#x6210;&amp;#xFF01;&lt;/p&gt;
&lt;p&gt; &amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;-&amp;#x534E;&amp;#x4E3D;&amp;#x7684;&amp;#x5206;&amp;#x5272;&amp;#x7EBF;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;&amp;#x2014;-&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x8FDB;&amp;#x9636;&amp;#x4F7F;&amp;#x7528;&quot;&gt;&amp;#x8FDB;&amp;#x9636;&amp;#x4F7F;&amp;#x7528;&lt;/h2&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x5C06;github&amp;#x7684;issues&amp;#x6252;&amp;#x4E0B;&amp;#x6765;&amp;#xFF1A;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ npm install hexo-migrator-github-issue --save&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;$ hexo migrate github-issue liboyue23/liboyue23.github.io&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x4F7F;&amp;#x7528;&amp;#x8C46;&amp;#x74E3;&amp;#x63D2;&amp;#x4EF6;&amp;#x6D4F;&amp;#x89C8;&amp;#x8C46;&amp;#x74E3;&amp;#x8BFB;&amp;#x4E66;&amp;#x7684;&amp;#x6570;&amp;#x636E;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x5982;&amp;#x4F55;&amp;#x5728;&amp;#x6587;&amp;#x7AE0;&amp;#x4E2D;&amp;#x6DFB;&amp;#x52A0;&amp;#x76EE;&amp;#x5F55;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ npm install hexo-toc --save&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;&amp;#x5229;&amp;#x7528;swiftype&amp;#x8FDB;&amp;#x884C;&amp;#x57DF;&amp;#x540D;&amp;#x5185;&amp;#x5BB9;&amp;#x7684;&amp;#x68C0;&amp;#x7D22;&lt;/em&gt;&lt;/strong&gt;&lt;br&gt;&amp;#x8BBF;&amp;#x95EE;&lt;a href=&quot;https://swiftype.com/home&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;swiftype&lt;/a&gt;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF0C;&amp;#x5EFA;&amp;#x7ACB;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;index&amp;#xFF0C;&amp;#x5F53;&amp;#x4F60;&amp;#x7684;blog&amp;#x6709;&amp;#x5185;&amp;#x5BB9;&amp;#x66F4;&amp;#x65B0;&amp;#x4E4B;&amp;#x540E;&amp;#x53EF;&amp;#x4EE5;&amp;#x5728;manage&amp;#x7684;domain&amp;#x7BA1;&amp;#x7406;&amp;#x4E2D;&amp;#x53EF;&amp;#x4EE5;recrawl&amp;#x91CD;&amp;#x65B0;&amp;#x6293;&amp;#x53D6;&amp;#x4F60;&amp;#x57DF;&amp;#x540D;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;source&amp;#x76EE;&amp;#x5F55;&amp;#x91CC;&amp;#x589E;&amp;#x52A0;&amp;#x76EE;&amp;#x5F55;&amp;#x547D;&amp;#x4EE4;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;$ hexo new page &lt;span class=&quot;string&quot;&gt;&amp;quot;about&amp;quot;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#x7136;&amp;#x540E;&amp;#x4F60;&amp;#x4F1A;&amp;#x53D1;&amp;#x73B0;source&amp;#x91CC;&amp;#x9762;&amp;#x591A;&amp;#x4E86;&amp;#x4E2A;&amp;#x76EE;&amp;#x5F55;about&amp;#xFF0C;&amp;#x91CC;&amp;#x9762;&amp;#x6709;&amp;#x4E2A;index.md&amp;#x3002;&amp;#x5176;&amp;#x5B9E;&amp;#x4F60;&amp;#x4E5F;&amp;#x53EF;&amp;#x4EE5;&amp;#x624B;&amp;#x52A8;&amp;#x5EFA;&amp;#x7ACB;&amp;#x3002;&amp;#x9875;&amp;#x9762;&amp;#x7684;&amp;#x683C;&amp;#x5F0F;&amp;#x548C;&amp;#x6587;&amp;#x7AE0;&amp;#x4E00;&amp;#x6837;&amp;#x3002;&lt;br&gt;&amp;#x63A5;&amp;#x7740;&amp;#x628A;&amp;#x94FE;&amp;#x63A5;&amp;#x52A0;&amp;#x4E0A;&amp;#xFF0C;themes/&lt;theme_name&gt;/_config.yml&amp;#x91CC;&amp;#x9762;&amp;#x7684;menu&amp;#x4E00;&amp;#x9879;&amp;#xFF0C;&amp;#x6DFB;&amp;#x52A0;&amp;#x4E00;&amp;#x884C;About: /about&amp;#x3002;&lt;br&gt;&amp;#x5B8C;&amp;#x4E8B;&amp;#x3002;&lt;br&gt;&lt;!-- 以上几个命令一路下来，hexo工程便搭建好了，我们安装的是hexo3
更多语法请按`Cmd + /` --&gt;&lt;/theme_name&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href=&quot;/assets/css/APlayer.min.css&quot;&gt;&lt;script src=&quot;/assets/js/APlayer.min.js&quot;&gt; &lt;/script&gt;&lt;h1 id=&quot;hexo&amp;#x4
    
    </summary>
    
      <category term="技术" scheme="http://leeboyue.com/categories/%E6%8A%80%E6%9C%AF/"/>
    
    
      <category term="hexo" scheme="http://leeboyue.com/tags/hexo/"/>
    
      <category term="随笔" scheme="http://leeboyue.com/tags/%E9%9A%8F%E7%AC%94/"/>
    
  </entry>
  
</feed>
