<!DOCTYPE html>
<html>
<head>
  <meta name="google-site-verification" content="aFT__ANLb-yZdaSU6cxKDWXvaN-lH8nKnQWH5T_V3C0" />
  <script src="http://echarts.baidu.com/dist/echarts.common.min.js"></script>
  <meta charset="utf-8">
  
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <title>7年老人谈些新人成长经验 | Mr.Lee</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x5728;&amp;#x963F;&amp;#x91CC;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x5FEB;7&amp;#x4E2A;&amp;#x5E74;&amp;#x5934;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;7&amp;#x5E74;&amp;#x4E2D;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x786E;&amp;#x4E5F;&amp;#x5B66;&amp;#x5230;&amp;#x4E86;&amp;#x5F88;&amp;#x591">
<meta property="og:type" content="article">
<meta property="og:title" content="7年老人谈些新人成长经验">
<meta property="og:url" content="http://leeboyue.com/2016/05/05/7年老人谈些新人成长经验/index.html">
<meta property="og:site_name" content="Mr.Lee">
<meta property="og:description" content="&amp;#x5728;&amp;#x963F;&amp;#x91CC;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x5FEB;7&amp;#x4E2A;&amp;#x5E74;&amp;#x5934;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;7&amp;#x5E74;&amp;#x4E2D;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x786E;&amp;#x4E5F;&amp;#x5B66;&amp;#x5230;&amp;#x4E86;&amp;#x5F88;&amp;#x591">
<meta property="og:updated_time" content="2016-05-05T13:25:00.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="7年老人谈些新人成长经验">
<meta name="twitter:description" content="&amp;#x5728;&amp;#x963F;&amp;#x91CC;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x5FEB;7&amp;#x4E2A;&amp;#x5E74;&amp;#x5934;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;7&amp;#x5E74;&amp;#x4E2D;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x786E;&amp;#x4E5F;&amp;#x5B66;&amp;#x5230;&amp;#x4E86;&amp;#x5F88;&amp;#x591">
  
    <link rel="alternative" href="/atom.xml" title="Mr.Lee" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/css/style.css" type="text/css">

  
<script type="text/javascript">
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?e0f262b7d553292b5906a66c7f78ccb5";
  var s = document.getElementsByTagName("script")[0];
  s.parentNode.insertBefore(hm, s);
})();
</script>


</head>

<body>
  <div id="container">
    <div class="left-col">
    <div class="overlay">

	
		<form class="search" action="/search/index.html" method="get" accept-charset="utf-8">
			<label>Search</label>
			<input type="text" id="st-search-input" class="st-default-search-input" maxlength="30" placeholder="Search" />
		</form>
	

</div>
<div class="intrude-less">

	

	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="/assets/me.jpg" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">Bear Lee</a></h1>
		</hgroup>

		
		<p class="header-subtitle">爱coding、爱运动、爱生活</p>
		

		
			<div class="switch-btn">
				<div class="icon">
					<div class="icon-ctn">
						<div class="icon-wrap icon-house" data-idx="0">
							<div class="birdhouse"></div>
							<div class="birdhouse_holes"></div>
						</div>
						<div class="icon-wrap icon-ribbon hide" data-idx="1">
							<div class="ribbon"></div>
						</div>
						
						
						<div class="icon-wrap icon-me hide" data-idx="3">
							<div class="user"></div>
							<div class="shoulder"></div>
						</div>
						
					</div>
					
				</div>
				<div class="tips-box hide">
					<div class="tips-arrow"></div>
					<ul class="tips-inner">
						<li>菜单</li>
						<li>標籤</li>
						
						
						<li>關於</li>
						
					</ul>
				</div>
			</div>
		

		<div class="switch-area">
			<div class="switch-wrap">
				<section class="switch-part switch-part1">
					<nav class="header-menu">
						<ul>
						
							<li><a href="/">主页</a></li>
				        
							<li><a href="/archives">文章</a></li>
				        
							<li><a href="/tags/随笔">随笔</a></li>
				        
							<li><a href="/douban">读书</a></li>
				        
							<li><a href="/about">关于我</a></li>
				        
						</ul>
					</nav>
					<nav class="header-nav">
						<div class="social">
							
								<a class="github" target="_blank" href="https://github.com/liboyue23" title="github">github</a>
					        
								<a class="weibo" target="_blank" href="http://weibo.com/2394030483/profile" title="weibo">weibo</a>
					        
								<a class="zhihu" target="_blank" href="http://www.zhihu.com/people/li-bo-yue-5" title="zhihu">zhihu</a>
					        
								<a class="rss" target="_blank" href="/atom.xml" title="rss">rss</a>
					        
						</div>
					</nav>
				</section>
				
				
				<section class="switch-part switch-part2">
					<div class="widget tagcloud" id="js-tagcloud">
						<a href="/tags/Guava/" style="font-size: 10px;">Guava</a> <a href="/tags/MySQL/" style="font-size: 10px;">MySQL</a> <a href="/tags/commons/" style="font-size: 10px;">commons</a> <a href="/tags/hexo/" style="font-size: 10px;">hexo</a> <a href="/tags/java/" style="font-size: 20px;">java</a> <a href="/tags/json/" style="font-size: 10px;">json</a> <a href="/tags/mysql/" style="font-size: 10px;">mysql</a> <a href="/tags/plugins/" style="font-size: 10px;">plugins</a> <a href="/tags/zookeeper/" style="font-size: 10px;">zookeeper</a> <a href="/tags/互联网金融/" style="font-size: 10px;">互联网金融</a> <a href="/tags/分布式/" style="font-size: 15px;">分布式</a> <a href="/tags/存储/" style="font-size: 10px;">存储</a> <a href="/tags/家常菜/" style="font-size: 10px;">家常菜</a> <a href="/tags/工具/" style="font-size: 10px;">工具</a> <a href="/tags/心得/" style="font-size: 10px;">心得</a> <a href="/tags/性能优化/" style="font-size: 10px;">性能优化</a> <a href="/tags/技术/" style="font-size: 15px;">技术</a> <a href="/tags/技术交流/" style="font-size: 10px;">技术交流</a> <a href="/tags/树/" style="font-size: 10px;">树</a> <a href="/tags/海鲜/" style="font-size: 10px;">海鲜</a> <a href="/tags/索引/" style="font-size: 10px;">索引</a> <a href="/tags/网络/" style="font-size: 10px;">网络</a> <a href="/tags/脑图/" style="font-size: 10px;">脑图</a> <a href="/tags/通讯/" style="font-size: 10px;">通讯</a> <a href="/tags/阿里巴巴/" style="font-size: 10px;">阿里巴巴</a> <a href="/tags/随笔/" style="font-size: 20px;">随笔</a>
					</div>
				</section>
				
				
				

				
				
				<section class="switch-part switch-part3">
				
					<div id="js-aboutme">我是谁，我从哪里来，我到哪里去？我就是我，是颜色不一样的吃货…</div>
				</section>
				
			</div>
		</div>
	</header>				
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"></div>
  		<h1 class="header-author js-mobile-header hide">Bear Lee</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
			
				<img lazy-src="/assets/me.jpg" class="js-avatar">
			
			</div>
			<hgroup>
			  <h1 class="header-author">Bear Lee</h1>
			</hgroup>
			
			<p class="header-subtitle">爱coding、爱运动、爱生活</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">文章</a></li>
		        
					<li><a href="/tags/随笔">随笔</a></li>
		        
					<li><a href="/douban">读书</a></li>
		        
					<li><a href="/about">关于我</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/liboyue23" title="github">github</a>
			        
						<a class="weibo" target="_blank" href="http://weibo.com/2394030483/profile" title="weibo">weibo</a>
			        
						<a class="zhihu" target="_blank" href="http://www.zhihu.com/people/li-bo-yue-5" title="zhihu">zhihu</a>
			        
						<a class="rss" target="_blank" href="/atom.xml" title="rss">rss</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-7年老人谈些新人成长经验" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/05/05/7年老人谈些新人成长经验/" class="article-date">
  	<time datetime="2016-05-05T13:21:38.000Z" itemprop="datePublished">2016-05-05</time>
</a>
    </div>
  

  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      7年老人谈些新人成长经验
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        
        

        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
         <!--02-->
        <div id="toc" class="toc-article">
    <div class="toc-title">目录</div>
    
</div>
      
        <link rel="stylesheet" type="text/css" href="/assets/css/APlayer.min.css"><script src="/assets/js/APlayer.min.js"> </script><p>&#x5728;&#x963F;&#x91CC;&#x5DEE;&#x4E0D;&#x591A;&#x5FEB;7&#x4E2A;&#x5E74;&#x5934;&#x4E86;&#xFF0C;&#x8FD9;7&#x5E74;&#x4E2D;&#x81EA;&#x5DF1;&#x7684;&#x786E;&#x4E5F;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x8FD9;&#x5176;&#x4E2D;&#x6709;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x5207;&#x8EAB;&#x611F;&#x53D7;&#x4E5F;&#x6709;&#x4E9B;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x522B;&#x4EBA;&#x603B;&#x7ED3;&#x7684;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#xFF0C;&#x53BB;&#x5E74;&#x7684;&#x65F6;&#x5019;&#x56E2;&#x961F;&#x65B0;&#x4EBA;&#x7ECF;&#x5E38;&#x95EE;&#x6211;&#x7684;&#xFF0C;&#x4E00;&#x76F4;&#x60F3;&#x5199;&#x6CA1;&#x5199;&#xFF0C;&#x5728;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x7B54;&#x6848;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x6211;&#x89C9;&#x5F97;&#x6BD4;&#x8F83;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x90FD;&#x5BF9;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x771F;&#x5FC3;&#x60F3;&#x8BF4;&#x7684;&#x8BDD;&#x3002;&#x8FD9;&#x4E9B;&#x8BDD;&#x6709;&#x4E9B;&#x5305;&#x62EC;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x90FD;&#x5B9E;&#x8DF5;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x4E5F;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x8981;&#x5148;&#x5177;&#x5907;&#x8FD9;&#x79CD;&#x610F;&#x8BC6;&#x624D;&#x884C;&#x3002;</p>
<p>&#x5148;&#x505A;&#x4E8B;<br>&#x6709;&#x5F88;&#x591A;&#x65B0;&#x540C;&#x5B66;&#x521A;&#x8FC7;&#x6765;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x56F0;&#x60D1;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x505A;&#x6280;&#x672F;&#x8FD8;&#x662F;&#x505A;&#x4E1A;&#x52A1;&#xFF1F;&#x662F;&#x6BCF;&#x5929;&#x52A0;&#x73ED;&#x52A0;&#x70B9;&#x5199;&#x4EE3;&#x7801;&#x8FD8;&#x662F;&#x5468;&#x672B;&#x8981;&#x7A7A;&#x70B9;&#x65F6;&#x95F4;&#x6765;&#x770B;&#x4E66;&#x5B66;&#x4E60;&#xFF1F;&#x662F;&#x5148;&#x8FFD;&#x6C42;&#x5E7F;&#x5EA6;&#x8FD8;&#x662F;&#x5148;&#x94BB;&#x7814;&#x4E00;&#x95E8;&#x6280;&#x672F;&#xFF1F;&#x662F;&#x4E24;&#x8033;&#x4E0D;&#x95FB;&#x7A97;&#x5916;&#x4E8B;&#x7684;&#x4E00;&#x5FC3;&#x57CB;&#x5934;&#x505A;&#x4E8B;&#x8FD8;&#x662F;&#x548C;&#x540C;&#x4E8B;&#x6253;&#x6210;&#x4E00;&#x7247;&#x53C2;&#x52A0;&#x5404;&#x79CD;&#x6D3B;&#x52A8;&#xFF1F;&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E5F;&#x66FE;&#x7ECF;&#x56F0;&#x6270;&#x4E86;&#x6211;&#xFF0C;&#x5DEE;&#x4E0D;&#x591A;&#x4EE5;&#x4E00;&#x4E2A;&#x8FC7;&#x6765;&#x4EBA;&#x7684;&#x89D2;&#x5EA6;&#x518D;&#x56DE;&#x5934;&#x770B;&#x4E00;&#x4E0B;&#x6211;&#x7684;&#x4E00;&#x4E9B;&#x7406;&#x89E3;&#x3002;</p>
<a id="more"></a>
<p>&#x5176;&#x5B9E;&#x6211;&#x89C9;&#x5F97;&#x65B0;&#x4EBA;&#x5230;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;&#x5728;&#x524D;3&#x5E74;&#x5EFA;&#x7ACB;&#x8D77;&#x4E2A;&#x4EBA;&#x54C1;&#x724C;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x5176;&#x4E2D;&#x6709;&#x4E9B;&#x903B;&#x8F91;&#x53EF;&#x4EE5;&#x548C;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E0B;&#xFF0C;&#x5F53;&#x522B;&#x4EBA;&#x5BF9;&#x4F60;&#x5B8C;&#x5168;&#x4E0D;&#x4E86;&#x89E3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x7ED9;&#x522B;&#x4EBA;&#x7559;&#x4E0B;&#x7684;&#x5370;&#x8C61;&#x4F1A;&#x8513;&#x5EF6;&#x5230;&#x6574;&#x4E2A;&#x516C;&#x53F8;&#xFF0C;&#x6240;&#x4EE5;&#x4EA4;&#x7ED9;&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E00;&#x5B9A;&#x8981;&#x505A;&#x597D;&#xFF0C;&#x600E;&#x4E48;&#x624D;&#x53EB;&#x505A;&#x597D;&#xFF0C;&#x5728;&#x76EE;&#x524D;&#x8FD9;&#x4E2A;&#x804C;&#x573A;&#x4E2D;&#xFF0C;&#x5176;&#x5B9E;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x6BD4;&#x62FC;&#x5927;&#x5BB6;&#x667A;&#x5546;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x505A;&#x4E8B;&#x8BA4;&#x771F;&#x4E00;&#x70B9;&#x3001;&#x8003;&#x8651;&#x7684;&#x66F4;&#x6DF1;&#x5165;&#x4E00;&#x70B9;&#x3001;&#x79EF;&#x6781;&#x4E3B;&#x52A8;&#x4E00;&#x70B9;&#x8FD9;&#x51E0;&#x70B9;&#x90FD;&#x505A;&#x597D;&#xFF0C;&#x4F60;&#x57FA;&#x672C;&#x5DF2;&#x7ECF;&#x597D;&#x4E8E;70%&#x7684;&#x540C;&#x5B66;&#x4E86;&#xFF0C;&#x597D;&#x4E8E;70%&#x7684;&#x540C;&#x5B66;&#x6211;&#x4EEC;&#x90FD;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x9760;&#x8C31;&#x201D;&#x3002;&#x628A;&#x6BCF;&#x4EF6;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5F53;&#x4E2D;&#x5EFA;&#x7ACB;&#x8D77;&#x81EA;&#x5DF1;&#x7684;&#x5206;&#x522B;&#x5FC3;&#xFF0C;&#x6BD4;&#x5982;&#x505A;&#x6280;&#x672F;&#x7684;&#xFF0C;&#x8981;&#x5728;&#x67D0;&#x4E00;&#x65B9;&#x9762;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x8981;&#x6210;&#x4E3A;&#x6743;&#x5A01;&#xFF0C;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x505A;&#x51FA;&#x4E00;&#x4EF6;&#x4EE4;&#x4EBA;&#x4F69;&#x670D;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x9010;&#x6E10;&#x5EFA;&#x7ACB;&#x8D77;&#x81EA;&#x5DF1;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x3002;</p>
<p>&#x83B7;&#x5F97;&#x4E86;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x5305;&#x62EC;&#x4E3B;&#x7BA1;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x81EA;&#x7136;&#x83B7;&#x5F97;&#x7684;&#x673A;&#x4F1A;&#x5C31;&#x4F1A;&#x66F4;&#x591A;&#xFF0C;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x4F1A;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x4F60;&#x7684;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x4EE5;&#x53CA;&#x548C;&#x4F60;&#x4E00;&#x8D77;&#x505A;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4E5F;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x5F62;&#x6210;&#x6B63;&#x5FAA;&#x73AF;&#xFF0C;&#x4F60;&#x7684;&#x6210;&#x957F;&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x5FEB;&#x3002;&#x6240;&#x4EE5;&#x524D;3&#x5E74;&#x901A;&#x8FC7;&#x505A;&#x4E8B;&#x5F62;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x79EF;&#x7D2F;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x8109;&#x3002;&#x953B;&#x70BC;&#x81EA;&#x5DF1;&#x7684;&#x5BF9;&#x672A;&#x77E5;&#x4E8B;&#x7269;&#x7684;&#x5224;&#x65AD;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x968F;&#x7740;&#x4F60;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4F60;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x80FD;&#x591F;&#x8986;&#x76D6;&#x5EA6;&#x5C31;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x4F60;&#x4F1A;&#x9047;&#x5230;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4F60;&#x4E0D;&#x61C2;&#x7684;&#x9886;&#x57DF;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x628A;&#x4F60;&#x6240;&#x6709;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x77E5;&#x8BC6;&#x90FD;&#x638C;&#x63E1;&#x4E00;&#x904D;&#xFF0C;&#x6240;&#x4EE5;&#x57F9;&#x517B;&#x81EA;&#x5DF1;&#x7684;&#x5224;&#x65AD;&#x80FD;&#x529B;&#x5C31;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5224;&#x65AD;&#x5305;&#x62EC;&#x5BF9;&#x4E8B;&#x7269;&#x672A;&#x77E5;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x7684;&#x5224;&#x65AD;&#x3001;&#x4E8B;&#x60C5;&#x4EA7;&#x751F;&#x4EF7;&#x503C;&#x7684;&#x5224;&#x65AD;&#x3001;&#x4EE5;&#x53CA;&#x5BF9;&#x4EBA;&#x7684;&#x5224;&#x65AD;&#x7B49;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x540E;3&#x5E74;&#x505A;&#x4EBA;&#xFF0C;&#x662F;&#x66F4;&#x591A;&#x7684;&#x53D1;&#x6325;&#x51FA;&#x4EBA;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x628A;&#x4E8B;&#x505A;&#x597D;&#x5C31;&#x884C;&#xFF0C;&#x5305;&#x62EC;&#x5728;&#x5408;&#x9002;&#x7684;&#x65F6;&#x95F4;&#x505A;&#x5408;&#x9002;&#x7684;&#x4E8B;&#x60C5;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x66F4;&#x5927;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x91CC;&#x505A;&#x5148;&#x70C8;&#x7684;&#x60C5;&#x51B5;&#x6709;&#x5F88;&#x591A;&#xFF1B;&#x627E;&#x5230;&#x591A;&#x4E2A;&#x56E2;&#x961F;&#x7684;&#x5171;&#x540C;&#x4EF7;&#x503C;&#x70B9;&#x628A;&#x4E8B;&#x60C5;&#x4E00;&#x8D77;&#x505A;&#x597D;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x6700;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x8D8A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x5229;&#x76CA;&#x65B9;&#x4E5F;&#x4F1A;&#x8D8A;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x5E73;&#x8861;&#x597D;&#x5404;&#x4E2A;&#x5229;&#x76CA;&#x65B9;&#x7684;&#x8BC9;&#x6C42;&#x662F;&#x4E8B;&#x60C5;&#x6210;&#x8D25;&#x7684;&#x5173;&#x952E;&#xFF1B;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#x540E;&#x8FD8;&#x8981;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x4EBA;&#x5E2E;&#x4F60;&#x5BA3;&#x4F20;&#x7B49;&#x3002;&#x8FD9;&#x4E2A;&#x5F53;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x4EBA;&#x7684;&#x6027;&#x683C;&#x3001;&#x4EA4;&#x9645;&#x80FD;&#x529B;&#x3001;&#x5411;&#x4E0A;&#x7BA1;&#x7406;&#x7B49;&#x7EFC;&#x5408;&#x80FD;&#x529B;&#xFF08;&#x8FD9;&#x4E2A;&#x9700;&#x8981;&#x5F88;&#x9AD8;&#x7684;&#x60C5;&#x5546;&#x6211;&#x4E5F;&#x4E0D;&#x64C5;&#x957F;&#xFF0C;&#x4E5F;&#x5728;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x5C31;&#x4E0D;&#x8BE6;&#x8C08;&#x4E86;&#xFF0C;&#x5475;&#x5475;&#xFF09;&#x3002;</p>
<p>&#x5584;&#x4E0E;&#x53D1;&#x73B0;&#x5174;&#x594B;&#x70B9;<br>&#x65B0;&#x540C;&#x5B66;&#x521A;&#x5165;&#x804C;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x6240;&#x505A;&#x4E8B;&#x60C5;&#x7684;&#x96BE;&#x5EA6;&#x90FD;&#x4E0D;&#x5927;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5F88;&#x5BB9;&#x6613;&#x4F1A;&#x5F62;&#x6210;&#x843D;&#x5DEE;&#xFF0C;&#x50CF;&#x963F;&#x91CC;&#x76EE;&#x524D;&#x62DB;&#x7684;&#x90FD;&#x662F;&#x5B66;&#x6821;&#x91CC;&#x9762;&#x7684;&#x5C16;&#x5B50;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x65F6;&#x5019;&#x5230;&#x5C97;&#x4F4D;&#x4E0A;&#x540E;&#x53D1;&#x73B0;&#x6BCF;&#x5929;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x7410;&#x788E;&#x7684;&#x4E8B;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x611F;&#x5230;&#x5931;&#x671B;&#x3002;&#x5982;&#x679C;&#x957F;&#x671F;&#x4E0D;&#x8C03;&#x6574;&#x597D;&#x5FC3;&#x6001;&#x540E;&#x5F88;&#x96BE;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x6FC0;&#x60C5;&#x53D1;&#x6325;&#x51FA;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x5C31;&#x6162;&#x6162;&#x5E73;&#x5EB8;&#x4E0B;&#x53BB;&#x3002;&#x6211;&#x53EF;&#x4EE5;&#x8BF4;&#x4E00;&#x4E0B;&#x6211;&#x5728;&#x963F;&#x91CC;&#x7684;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#xFF0C;&#x5F53;&#x521D;&#x6211;&#x548C;&#x5927;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x4E5F;&#x662F;&#x4ECE;&#x6700;&#x57FA;&#x672C;&#x7684;&#x65E5;&#x5E38;&#x5F00;&#x59CB;&#x505A;&#x8D77;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x5BF9;&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x81EA;&#x5DF1;&#x7684;&#x8981;&#x6C42;&#x662F;&#xFF0C;&#x4EE3;&#x7801;&#x5C42;&#x9762;&#x4E0D;&#x51FA;bug&#x3001;&#x6CE8;&#x91CA;&#x8981;&#x5199;&#x6E05;&#x695A;&#xFF0C;&#x6309;&#x65F6;&#x53D1;&#x5E03;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6700;&#x57FA;&#x672C;&#x7684;&#x8981;&#x6C42;&#xFF1B;&#x4F46;&#x662F;&#x6211;&#x4F1A;&#x5229;&#x7528;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x505A;&#x597D;&#x51E0;&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ol>
<li><p>&#x53D1;&#x73B0;&#x5DE5;&#x4F5C;&#x4E2D;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x6548;&#x7387;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x7410;&#x4E8B;&#x7684;&#x4E8B;&#x60C5;&#x5DE5;&#x5177;&#x5316;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x5F53;&#x65F6;&#x5728;&#x505A;&#x4E00;&#x4E2A;&#x641C;&#x7D22;&#x9700;&#x6C42;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x4F20;&#x7ED9;&#x641C;&#x7D22;&#x7684;&#x53C2;&#x4E0E;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x6B21;&#x62FC;URL&#x975E;&#x5E38;&#x9EBB;&#x70E6;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x662F;&#x7ED9;&#x8FD0;&#x8425;&#x540C;&#x5B66;&#x5728;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5C31;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x628A;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x505A;&#x6210;&#x8868;&#x5355;&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x8425;&#x540C;&#x5B66;&#x53EA;&#x8981;&#x5728;&#x5BF9;&#x5E94;&#x7684;&#x5B57;&#x6BB5;&#xFF08;&#x81EA;&#x52A8;&#x7684;&#x542B;&#x4E49;&#x6709;&#x8BF4;&#x660E;&#xFF09;&#x8868;&#x5355;&#x4E2D;&#x586B;&#x5165;&#x503C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x6700;&#x7EC8;&#x7684;URL&#x3002;&#x63D0;&#x5347;&#x4E86;&#x8FD0;&#x8425;&#x540C;&#x5B66;&#x751F;&#x6210;URL&#x7684;&#x6548;&#x7387;&#x3002;&#x5F53;&#x7136;&#x505A;&#x51FA;&#x6765;&#x540E;&#xFF0C;&#x4E5F;&#x80AF;&#x5B9A;&#x53D7;&#x5230;&#x4E86;&#x8FD0;&#x8425;&#x540C;&#x5B66;&#x7684;&#x597D;&#x8BC4;&#x3002;</p>
</li>
<li><p>&#x9664;&#x4E86;&#x53D1;&#x73B0;&#x5DE5;&#x4F5C;&#x4E2D;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x7684;&#x6548;&#x7387;&#x5916;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x79EF;&#x7D2F;&#x4E00;&#x4E9B;&#x4EBA;&#x54C1;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x65F6;&#x6211;&#x4EEC;&#x6709;&#x4E2A;&#x5C0F;&#x56FE;&#x4E66;&#x9986;&#xFF0C;&#x6709;&#x4E2A;&#x540C;&#x5B66;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x6BCF;&#x5468;&#x6BCF;&#x4E2A;&#x540C;&#x5B66;&#x501F;&#x4E86;&#x90A3;&#x4E9B;&#x4E66;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8FD8;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FD8;&#x90FD;&#x662F;&#x4EBA;&#x8089;&#x8BB0;&#x5F55;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x505A;&#x4E86;&#x4E2A;&#x56FE;&#x4E66;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7ED9;&#x90A3;&#x4E2A;&#x540C;&#x5B66;&#x7528;&#xFF0C;&#x5F53;&#x65F6;&#x4E5F;&#x79EF;&#x7D2F;&#x4E0D;&#x5C11;&#x4EBA;&#x54C1;&#x3002;</p>
</li>
<li><p>&#x9664;&#x4E86;&#x5728;&#x4E3B;&#x52A8;&#x6027;&#x548C;&#x79EF;&#x7D2F;&#x4EBA;&#x54C1;&#x5916;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8FD8;&#x662F;&#x8981;&#x79EF;&#x7D2F;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x6211;&#x4F1A;&#x628A;&#x5728;&#x516C;&#x53F8;&#x7528;&#x5230;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#x90FD;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#x4E00;&#x904D;&#xFF0C;&#x5E76;&#x4E14;&#x5199;&#x6210;&#x5B66;&#x4E60;&#x6587;&#x6863;&#xFF0C;&#x548C;&#x5176;&#x4ED6;&#x540C;&#x5B66;&#x5199;&#x90A3;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x4F7F;&#x7528;&#x5FC3;&#x5F97;&#x578B;&#x7684;&#x6587;&#x6863;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x5199;&#x7684;&#x5B66;&#x4E60;&#x6587;&#x6863;&#x90FD;&#x662F;&#x5206;&#x6790;&#x8BBE;&#x8BA1;&#x539F;&#x7406;&#x6027;&#x7684;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x5206;&#x6790;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BBE;&#x8BA1;&#xFF0C;&#x7528;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3001;&#x5173;&#x952E;&#x7684;&#x6280;&#x672F;&#x70B9;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#xFF1B;&#x8FD9;&#x79CD;&#x6587;&#x7AE0;&#x5BF9;&#x90A3;&#x4E9B;&#x5DE5;&#x4F5C;&#x51E0;&#x5E74;&#x5BF9;&#x4E2D;&#x95F4;&#x4EF6;&#x719F;&#x6089;&#x7684;&#x540C;&#x5B66;&#x4E5F;&#x4F1A;&#x6709;&#x5174;&#x8DA3;&#x6765;&#x770B;&#x3002;&#x867D;&#x7136;&#x6211;&#x5199;&#x8FD9;&#x4E9B;&#x6587;&#x7AE0;&#x53D7;&#x5230;&#x4E86;&#x4E0D;&#x5C11;&#x597D;&#x8BC4;&#xFF0C;&#x4F46;&#x662F;&#x770B;&#x5230;&#x4EBA;&#x5728;&#x516C;&#x53F8;&#x6BD5;&#x7ADF;&#x6709;&#x9650;&#xFF0C;&#x800C;&#x4E14;&#x5199;&#x8FD9;&#x4E9B;&#x6587;&#x7AE0;&#x4E5F;&#x82B1;&#x8D39;&#x4E86;&#x6211;&#x4E0D;&#x5C11;&#x7CBE;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8981;&#x5BFB;&#x627E;&#x65B0;&#x7684;&#x52A8;&#x529B;&#x6765;&#x7EE7;&#x7EED;&#x5199;&#x4E0B;&#x53BB;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x4ECE;&#x5199;&#x516C;&#x53F8;&#x72EC;&#x6709;&#x7684;&#x6846;&#x67B6;&#x8F6C;&#x5230;&#x5199;&#x516C;&#x53F8;&#x5185;&#x548C;&#x516C;&#x53F8;&#x5916;&#x901A;&#x7528;&#x7684;&#x6280;&#x672F;&#x6846;&#x67B6;&#x7684;&#x5206;&#x6790;&#x6587;&#x7AE0;&#xFF0C;&#x5982;spring&#x3001;ibaties&#x3001;tomcat&#x7B49;jvm&#x6280;&#x672F;&#x3002;&#x5E76;&#x4E14;&#x627E;&#x673A;&#x4F1A;&#x628A;&#x5B83;&#x6295;&#x5230;&#x5916;&#x9762;&#x7684;&#x6742;&#x5FD7;&#x548C;&#x7F51;&#x7AD9;&#x4E0A;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E9B;&#x7ECF;&#x6D4E;&#x56DE;&#x62A5;&#xFF0C;&#x53E6;&#x5916;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6536;&#x5230;&#x66F4;&#x591A;&#x7684;&#x53CD;&#x9988;&#x4FE1;&#x606F;&#xFF0C;&#x6700;&#x7EC8;&#x5728;developerworks&#x4E0A;&#x6295;&#x4E86;&#x5341;&#x51E0;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x83B7;&#x5F97;&#x4ED6;&#x4EEC;&#x7F51;&#x7AD9;&#x7684;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x4F5C;&#x8005;&#xFF0C;&#x76EE;&#x524D;&#x6211;&#x5199;&#x7684;&#x6587;&#x7AE0;&#x4F30;&#x8BA1;&#x4E5F;&#x662F;developerworks&#x4E0A;&#x5355;&#x7BC7;&#x8BBF;&#x95EE;&#x91CF;&#x6700;&#x5927;&#x7684;&#x3002;</p>
</li>
</ol>
<p>&#x6240;&#x4EE5;&#x5584;&#x4E0E;&#x4ECE;&#x5DE5;&#x4F5C;&#x4E2D;&#x627E;&#x5230;&#x6E90;&#x52A8;&#x529B;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x65F6;&#x4ECE;&#x4E0D;&#x540C;&#x89D2;&#x5EA6;&#x53D1;&#x73B0;&#x5176;&#x4E2D;&#x7684;&#x4EF7;&#x503C;&#x53EF;&#x4EE5;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x5BF9;&#x505A;&#x4E8B;&#x7684;&#x6FC0;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x5982;&#x679C;&#x6211;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x522B;&#x4EBA;&#x7684;&#x611F;&#x8C22;&#x3001;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x522B;&#x4EBA;&#x7684;&#x79F0;&#x8D5E;&#x3001;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x77E5;&#x8BC6;&#x7B49;&#x3002;&#x627E;&#x5230;&#x6211;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x8FD9;&#x6B63;&#x5411;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x9644;&#x5E26;&#x83B7;&#x5F97;&#x77E5;&#x8BC6;&#x548C;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x7136;&#x540E;&#x4FC3;&#x4F7F;&#x6211;&#x66F4;&#x60F3;&#x6301;&#x7EED;&#x7684;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x5199;&#x6587;&#x7AE0;&#x548C;&#x603B;&#x7ED3;&#x4E00;&#x76F4;&#x662F;&#x6211;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5174;&#x594B;&#x70B9;&#xFF0C;&#x4ED6;&#x4F1A;&#x6709;&#x591A;&#x79CD;&#x597D;&#x5904;&#xFF1A;</p>
<ol>
<li><p>&#x53EF;&#x4EE5;&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x6C89;&#x6DC0;&#x548C;&#x603B;&#x7ED3;&#xFF0C;&#x53EA;&#x6709;&#x7ECF;&#x8FC7;&#x6C89;&#x6DC0;&#x548C;&#x603B;&#x7ED3;&#x7684;&#x77E5;&#x8BC6;&#x624D;&#x80FD;&#x88AB;&#x66F4;&#x957F;&#x8FDC;&#x7684;&#x8BB0;&#x4F4F;&#x3002;</p>
</li>
<li><p>&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x81EA;&#x5DF1;&#x7684;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x66F4;&#x591A;&#x7684;&#x5206;&#x4EAB;&#x7ED9;&#x522B;&#x4EBA;&#x5E26;&#x6765;&#x4EF7;&#x503C;&#xFF0C;&#x624D;&#x6709;&#x6709;&#x4EBA;&#x5173;&#x6CE8;&#x4F60;</p>
</li>
<li><p>&#x7ED9;&#x505A;&#x4E8B;&#x589E;&#x52A0;&#x52A8;&#x529B;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90A3;&#x4E9B;&#x7410;&#x788E;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5982;&#x679C;&#x80FD;&#x628A;&#x7410;&#x788E;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x4E5F;&#x662F;&#x5F88;&#x597D;&#x7684;&#x7ED3;&#x679C;</p>
</li>
</ol>
<p>&#x6240;&#x4EE5;&#x8981;&#x627E;&#x5230;&#x4F60;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x5174;&#x594B;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x4F60;&#x6301;&#x7EED;&#x7684;&#x5BF9;&#x5DE5;&#x4F5C;&#x5145;&#x6EE1;&#x6FC0;&#x60C5;&#x3002;</p>
<p>&#x4E0E;&#x4EBA;&#x534F;&#x4F5C;<br>&#x5728;&#x4E0E;&#x4EBA;&#x534F;&#x4F5C;&#x4E0A;&#xFF0C;&#x8FD9;&#x51E0;&#x5E74;&#x6211;&#x7684;&#x611F;&#x89E6;&#x591C;&#x5F88;&#x6DF1;&#xFF0C;&#x4ECE;&#x6700;&#x521D;&#x7684;&#x60F3;&#x4E00;&#x4E2A;&#x4EBA;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x5C3D;&#x91CF;&#x8BA9;&#x522B;&#x4EBA;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x79CD;&#x8F6C;&#x53D8;&#x771F;&#x662F;&#x5F88;&#x7279;&#x522B;&#xFF0C;&#x73B0;&#x5728;&#x56DE;&#x8FC7;&#x6765;&#x5934;&#x518D;&#x770B;&#x65B0;&#x6765;&#x7684;&#x540C;&#x5B66;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x628A;&#x6211;&#x7684;&#x8F6C;&#x53D8;&#x8FC7;&#x7A0B;&#x5199;&#x51FA;&#x6765;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#x3002;&#x5728;&#x516C;&#x53F8;&#x4E2D;&#x6709;&#x5F88;&#x5C11;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x4EBA;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x6709;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x7684;&#xFF0C;&#x9664;&#x53BB;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x79CD;&#x5DEE;&#x522B;&#x5916;&#xFF0C;&#x5F88;&#x6709;&#x76F8;&#x540C;&#x5C97;&#x4F4D;&#x4E0D;&#x540C;&#x5C42;&#x7EA7;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x4EE5;&#x516C;&#x53F8;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x9879;&#x76EE;&#x8FD0;&#x4F5C;&#x6A21;&#x5F0F;&#x4E3A;&#x4F8B;&#xFF0C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x4E00;&#x822C;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#xFF08;PM&#xFF09;&#x3001;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x67B6;&#x6784;&#x5E08;&#x3001;&#x7136;&#x540E;&#x5C31;&#x662F;&#x82E5;&#x5E72;&#x4E2A;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x5176;&#x4ED6;&#x5C31;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x5C97;&#x4F4D;&#x5206;&#x5DE5;&#x4E86;&#x5982;PD&#x3001;UED&#x3001;&#x6D4B;&#x8BD5;&#x3001;PE&#x7B49;&#x8FD9;&#x4E9B;&#x4EBA;&#x3002;PM&#x548C;&#x67B6;&#x6784;&#x5E08;&#x4E24;&#x4E2A;&#x89D2;&#x8272;&#x521A;&#x597D;&#x7ED9;&#x4E24;&#x4E2A;&#x540C;&#x8D28;&#x7684;&#x56E2;&#x961F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;PM&#x4E00;&#x822C;&#x4F1A;&#x62FF;&#x5230;&#x4E1A;&#x52A1;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x67B6;&#x6784;&#x5E08;&#x4E00;&#x822C;&#x80FD;&#x4F53;&#x73B0;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x6280;&#x672F;&#x6210;&#x679C;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x573A;&#x666F;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6280;&#x672F;&#x901A;&#x8FC7;PM&#x6765;&#x843D;&#x5730;&#x5C31;&#x80FD;&#x8FBE;&#x5230;&#x53CC;&#x8D62;&#x3002;&#x4E0E;&#x4EBA;&#x534F;&#x52A9;&#x4E0A;&#x6709;&#x51E0;&#x4E2A;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x7ECF;&#x5386;&#xFF1A;</p>
<ol>
<li><p>&#x522B;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x5F53;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5E2E;&#x522B;&#x4EBA;&#x5B9E;&#x73B0;&#x3002;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x521D;&#x671F;&#x4E0E;&#x4EBA;&#x5408;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x628A;&#x522B;&#x4EBA;&#x7684;&#x4E8B;&#x5F53;&#x4F5C;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#xFF0C;&#x5E76;&#x4E14;&#x60F3;&#x65B9;&#x8BBE;&#x6CD5;&#x5B9E;&#x73B0;&#x597D;&#xFF0C;&#x8BE5;&#x505A;&#x87BA;&#x4E1D;&#x9489;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x8981;&#x505A;&#x597D;&#x3002;</p>
</li>
<li><p>&#x5FC5;&#x987B;&#x7ECF;&#x5386;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x65B0;&#x4EBA;&#x4E00;&#x822C;&#x4F1A;&#x7ECF;&#x5386;&#x5BB3;&#x6015;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x8BF4;&#x51FA;&#x6765;&#xFF0C;&#x88AB;&#x522B;&#x4EBA;&#x62A2;&#x53BB;&#x5B9E;&#x73B0;&#x4E86;&#x7684;&#x62C5;&#x5FC3;&#x3002;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x6211;&#x4E5F;&#x62C5;&#x5FC3;&#x8FC7;&#xFF0C;&#x5B9E;&#x9645;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x786E;&#x6709;&#x4E9B;&#x540C;&#x5B66;&#x5584;&#x4E0E;&#x76D7;&#x53D6;&#x522B;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x7136;&#x540E;&#x7A0D;&#x5FAE;&#x6362;&#x4E00;&#x4E0B;&#x518D;&#x5230;&#x5904;&#x7ED9;&#x522B;&#x4EBA;&#x5BA3;&#x626C;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x518D;&#x62A2;&#x7740;&#x7ED9;&#x8001;&#x677F;&#x6C47;&#x62A5;&#x5C31;&#x66F4;&#x8BA8;&#x538C;&#x4E86;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x8FD9;&#x79CD;&#x62C5;&#x5FC3;&#x4E5F;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x60F3;&#x6CD5;&#x800C;&#x662F;&#x5B9E;&#x8DF5;&#x3002;&#x5BF9;&#x65B0;&#x540C;&#x5B66;&#x6765;&#x8BF4;&#xFF0C;&#x591A;&#x60F3;&#x5C11;&#x8BF4;&#x591A;&#x5B9E;&#x8DF5;&#x624D;&#x662F;&#x738B;&#x9053;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5C11;&#x60F3;&#x591A;&#x8BF4;&#x5C11;&#x5B9E;&#x8DF5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x597D;&#x7684;&#x60F3;&#x6CD5;&#x4E0D;&#x59A8;&#x8BF4;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x5B9E;&#x73B0;&#x51FA;&#x6765;&#x4E00;&#x4E2A;demo&#x8BC1;&#x660E;&#x53EF;&#x884C;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x8BC1;&#x660E;&#x9760;&#x8C31;&#x4E5F;&#x4E0D;&#x7528;&#x7EA0;&#x7ED3;&#x6700;&#x7EC8;&#x540D;&#x4E49;&#x4E0A;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E0D;&#x662F;&#x4F60;&#x80FD;&#x83B7;&#x5F97;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x524D;&#x9762;&#x6240;&#x8BF4;&#x7684;&#xFF0C;&#x5148;&#x505A;&#x597D;&#x4E8B;&#xFF0C;&#x4E0D;&#x7528;&#x6025;&#x7740;&#x53BB;&#x4E89;&#x540D;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6B63;&#x662F;&#x4F60;&#x79EF;&#x7D2F;&#x4EE5;&#x540E;&#x7ED9;&#x4F60;&#x798F;&#x62A5;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
</li>
<li><p>&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x627E;&#x4E00;&#x5E2E;&#x4EBA;&#x5E2E;&#x5B9E;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;&#x5E73;&#x8861;&#x5229;&#x76CA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5408;&#x7406;&#x7684;&#x8BA9;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x6210;&#x5458;&#x90FD;&#x80FD;&#x83B7;&#x5F97;&#x6700;&#x5927;&#x7684;&#x5229;&#x76CA;&#x662F;&#x9879;&#x76EE;&#x6210;&#x529F;&#x7684;&#x5173;&#x952E;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x53C2;&#x4E0E;&#x9879;&#x76EE;&#x7684;&#x6210;&#x5458;&#x8FD8;&#x5305;&#x62EC;&#x9879;&#x76EE;&#x6210;&#x5458;&#x7684;&#x8001;&#x677F;&#xFF0C;&#x4EC5;&#x4EC5;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#x8FD8;&#x53EA;&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x9879;&#x76EE;&#x8981;&#x53D1;&#x6325;&#x51FA;&#x6700;&#x5927;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x8FD8;&#x6709;&#x6709;&#x8001;&#x677F;&#x4EEC;&#x5E2E;&#x4F60;&#x5BA3;&#x4F20;&#xFF0C;&#x624D;&#x80FD;&#x6709;&#x66F4;&#x591A;&#x7684;&#x843D;&#x5730;&#x573A;&#x666F;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x6210;&#x529F;&#x9700;&#x8981;&#x5929;&#x65F6;&#x5730;&#x5229;&#x4EBA;&#x548C;&#xFF0C;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#x3002;</p>
</li>
<li><p>&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8BA9;&#x522B;&#x4EBA;&#x8BF4;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x5B9E;&#x73B0;&#x3002;&#x4F60;&#x7684;&#x60F3;&#x6CD5;&#x53D8;&#x6210;&#x4E86;&#x522B;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x540E;&#x5B9E;&#x73B0;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x80AF;&#x5B9A;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x4EBA;&#x4E86;&#x3002;&#x65B0;&#x4EBA;&#x65E0;&#x7591;&#x6700;&#x5FCC;&#x8BB3;&#x51FA;&#x73B0;&#x8FD9;&#x4E2A;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x4F60;&#x524D;&#x9762;&#x51E0;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x505A;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4F60;&#x4F1A;&#x5F88;&#x6DE1;&#x5B9A;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x65F6;&#x4F60;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;Leader&#x4E86;&#xFF0C;&#x800C;Leader&#x8981;&#x505A;&#x7684;&#x6B63;&#x662F;&#x8FD9;&#x4E2A;&#x3002;</p>
</li>
</ol>
<p>&#x4E0E;&#x4EBA;&#x534F;&#x4F5C;&#x65F6;&#x6211;&#x89C9;&#x5F97;&#x300A;choice&#x300B;&#x8BFE;&#x7A0B;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x91D1;&#x5B57;&#x5854;&#x5982;&#x4F55;&#x8FBE;&#x5230;&#x5EFA;&#x7ACB;&#x6700;&#x6709;&#x6548;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x662F;&#x975E;&#x5E38;&#x6709;&#x53C2;&#x8003;&#x4EF7;&#x503C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x628A;&#x6700;&#x5927;&#x65F6;&#x95F4;&#x82B1;&#x5728;&#x5BF9;&#x4E0E;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x7684;&#x4EBA;&#x5EFA;&#x7ACB;&#x826F;&#x597D;&#x5173;&#x7CFB;&#x4E0A;&#x662F;&#x6700;&#x6709;&#x6210;&#x6548;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x4E0D;&#x5C31;&#x662F;&#x90A3;&#x7FA4;&#x5929;&#x5929;&#x5728;&#x516C;&#x53F8;&#x4E0D;&#x5E72;&#x4E8B;&#x53EA;&#x4F1A;&#x62C9;&#x5173;&#x7CFB;&#x7684;&#x4EBA;&#x5417;&#xFF1F;&#x5176;&#x5B9E;&#x5EFA;&#x7ACB;&#x5173;&#x7CFB;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x624B;&#x6BB5;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x662F;&#x5EFA;&#x7ACB;&#x5173;&#x7CFB;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x7684;&#x7ED3;&#x679C;&#x624D;&#x662F;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x5F71;&#x54CD;&#x529B;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x4E00;&#x79CD;&#x534F;&#x4F5C;&#x3002;</p>
<p>&#x8001;&#x677F;&#x5E0C;&#x671B;&#x4F60;&#x505A;&#x7684;<br>&#x4ECA;&#x5E74;&#x5E26;&#x4E86;&#x4E00;&#x5E74;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x4E5F;&#x7B97;&#x6253;&#x5165;&#x4E86;&#x7EC4;&#x7EC7;&#x5185;&#x90E8;&#x4E86;&#x89E3;&#x7EC4;&#x7EC7;&#x662F;&#x600E;&#x4E48;&#x8FD0;&#x8F6C;&#x7684;&#xFF0C;&#x963F;&#x91CC;&#x603B;&#x4F53;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x5065;&#x5EB7;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x6709;&#x6CA1;&#x6709;&#x751F;&#x547D;&#x529B;&#x5C31;&#x770B;&#x8FD9;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;Leader&#x662F;&#x4E0D;&#x662F;&#x6700;&#x80FD;&#x5E72;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x4E14;&#x7EC4;&#x7EC7;&#x8981;&#x6709;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x6700;&#x80FD;&#x5E72;&#x7684;&#x4EBA;&#x80FD;&#x591F;&#x6210;&#x4E3A;Leader&#x7684;&#x673A;&#x5236;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x6211;&#x4E3B;&#x8981;&#x60F3;&#x8BB2;&#x7684;&#x4E0D;&#x662F;&#x5982;&#x4F55;&#x7ED9;&#x8001;&#x677F;&#x62CD;&#x9A6C;&#x5C41;&#x3001;&#x5982;&#x4F55;&#x548C;&#x8001;&#x677F;&#x5957;&#x8FD1;&#x4E4E;&#xFF0C;&#x4ECB;&#x7ECD;&#x7ED9;&#x5927;&#x5BB6;&#x4E3B;&#x7BA1;&#x6700;&#x5E0C;&#x671B;&#x7684;&#x505A;&#x4E8B;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ol>
<li><p>&#x7B2C;&#x4E00;&#x6B65;&#x8981;&#x548C;&#x4E3B;&#x7BA1;&#x53D6;&#x5F97;&#x76F8;&#x4E92;&#x4FE1;&#x4EFB;&#xFF0C;&#x6CE8;&#x610F;&#x6211;&#x8BF4;&#x7684;&#x662F;&#x76F8;&#x4E92;&#x4FE1;&#x4EFB;&#xFF0C;&#x8FD9;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x3002;&#x4F60;&#x4FE1;&#x4EFB;&#x4E3B;&#x7BA1;&#x65E0;&#x975E;&#x5173;&#x6CE8;&#x51E0;&#x70B9;&#xFF0C;&#x4F60;&#x5185;&#x5FC3;&#x662F;&#x670D;&#x4ED6;&#x7684;&#xFF1B;&#x4F60;&#x77E5;&#x9053;&#x4ED6;&#x662F;&#x771F;&#x5FC3;&#x613F;&#x610F;&#x57F9;&#x517B;&#x4F60;&#x7684;&#x3002;&#x4E3B;&#x7BA1;&#x4FE1;&#x4EFB;&#x4F60;&#x4E3B;&#x8981;&#x662F;&#x4EA4;&#x7ED9;&#x4F60;&#x7684;&#x4E8B;&#x60C5;&#x80FD;&#x591F;&#x6F02;&#x4EAE;&#x7684;&#x5B8C;&#x6210;&#xFF1B;&#x8BA4;&#x4E3A;&#x4F60;&#x6B7B;&#x5FC3;&#x584C;&#x5730;&#x7684;&#x8DDF;&#x7740;&#x4ED6;&#x3002;&#x6709;&#x5F88;&#x591A;&#x7684;&#x7BA1;&#x7406;&#x4E8B;&#x6545;&#x65E0;&#x975E;&#x90FD;&#x662F;&#x8FD9;&#x79CD;&#x76F8;&#x4E92;&#x4FE1;&#x4EFB;&#x6CA1;&#x6709;&#x5EFA;&#x7ACB;&#x5BFC;&#x81F4;&#x7684;&#xFF08;&#x5F53;&#x7136;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x4F60;&#x548C;&#x8001;&#x677F;&#x90FD;&#x662F;&#x7B26;&#x5408;&#x963F;&#x91CC;&#x4EF7;&#x503C;&#x89C2;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x5FC3;&#x7406;&#x9ED1;&#x6697;&#x7684;&#x5C31;&#x6216;&#x7565;&#x4E86;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x79EF;&#x6781;&#x4E3B;&#x52A8;&#x7684;&#x7ED9;&#x8001;&#x677F;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x60CA;&#x559C;&#xFF0C;&#x662F;&#x4F60;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x673A;&#x4F1A;&#x7684;&#x52A9;&#x71C3;&#x5242;&#xFF0C;&#x8001;&#x677F;&#x4E00;&#x822C;&#x559C;&#x6B22;&#x4E24;&#x79CD;&#x4EBA;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x542C;&#x8BDD;&#x7684;&#x4EBA;&#xFF0C;&#x5162;&#x5162;&#x4E1A;&#x4E1A;&#x7684;&#x5B8C;&#x6210;&#x4EA4;&#x7ED9;&#x7684;&#x4EFB;&#x52A1;&#xFF1B;&#x7B2C;&#x4E8C;&#x79CD;&#x4EBA;&#x662F;&#x603B;&#x662F;&#x6709;&#x65B0;&#x60F3;&#x6CD5;&#x5E76;&#x4E14;&#x7231;&#x6298;&#x817E;&#x7684;&#x4EBA;&#xFF0C;&#x6709;&#x60F3;&#x6CD5;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x6709;&#x7ED3;&#x679C;&#x3002;&#x5F88;&#x663E;&#x7136;&#x7B2C;&#x4E8C;&#x79CD;&#x4EBA;&#x66F4;&#x5BB9;&#x6613;&#x83B7;&#x5F97;&#x8001;&#x677F;&#x7684;&#x63D0;&#x62E8;</p>
</li>
<li><p>&#x9002;&#x5F53;&#x7684;&#x7ED9;&#x8001;&#x677F;&#x627E;&#x4E9B;&#x201C;&#x9EBB;&#x70E6;&#x201D;&#x4E5F;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x6240;&#x8C13;&#x7684;&#x627E;&#x9EBB;&#x70E6;&#x6709;&#x4E24;&#x91CD;&#x542B;&#x4E49;&#xFF1A;</p>
</li>
</ol>
<p>&#x4E00;&#x662F;&#xFF0C;&#x8981;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5373;&#x5F53;&#x53D1;&#x73B0;&#x660E;&#x663E;&#x6709;&#x95EE;&#x9898;&#x65F6;&#x8FD8;&#x542C;&#x4E4B;&#x4EFB;&#x4E4B;&#xFF0C;&#x53EA;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x8001;&#x677F;&#x89C9;&#x5F97;&#x4F60;&#x6CA1;&#x6709;&#x4E3B;&#x89C1;&#xFF0C;&#x79EF;&#x6781;&#x7684;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x8981;&#x57FA;&#x4E8E;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x6B63;&#x76F4;&#x7684;&#x4EBA;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8001;&#x677F;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x809A;&#x9E21;&#x80A0;&#x7684;&#x4EBA;&#xFF0C;&#x90A3;&#x4F60;&#x8FD8;&#x8BF4;&#x597D;&#x81EA;&#x4E3A;&#x4E4B;&#x5427;&#x3002;</p>
<p>&#x4E8C;&#x662F;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x8BA9;&#x4F60;&#x8001;&#x677F;&#x7684;&#x8BA4;&#x77E5;&#x8303;&#x56F4;&#x5B8C;&#x5168;&#x8986;&#x76D6;&#x4F60;&#x7684;&#x8BA4;&#x77E5;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x5728;&#x4F60;&#x8001;&#x677F;&#x773C;&#x91CC;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x900F;&#x660E;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x6240;&#x6709;&#x601D;&#x8003;&#x548C;&#x884C;&#x52A8;&#x90FD;&#x5728;&#x4ED6;&#x7684;&#x53EF;&#x9884;&#x77E5;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#x5BF9;&#x4F60;&#x5F88;&#x96BE;&#x6709;&#x5F88;&#x5927;&#x7684;&#x671F;&#x5F85;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x5DE5;&#x4F5C;&#x573A;&#x666F;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x7684;&#x6DF1;&#x5EA6;&#x3001;&#x5E7F;&#x5EA6;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x6280;&#x80FD;&#x4E0A;&#x4F60;&#x8981;&#x6709;&#x6240;&#x957F;&#x3002;&#x6BD4;&#x5982;&#x6280;&#x80FD;&#x4E0A;&#x4F60;&#x64C5;&#x957F;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x6216;&#x8005;&#x53CA;&#x7EBF;&#x4E0A;&#x8FD0;&#x7EF4;&#x975E;&#x5E38;&#x597D;&#x6216;&#x8005;&#x4F60;&#x601D;&#x8003;&#x95EE;&#x9898;&#x975E;&#x5E38;&#x5168;&#x9762;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x903B;&#x8F91;&#x63A8;&#x5BFC;&#x80FD;&#x529B;&#x5F88;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x8FBE;&#x5230;&#x4E0B;&#x56FE;&#x4E2D;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x7406;&#x60F3;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5F53;&#x7136;&#x6709;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x8981;&#x907F;&#x514D;&#xFF0C;&#x5C31;&#x662F;&#x5F53;&#x4F60;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#x5982;&#x679C;&#x5927;&#x4E8E;&#x4F60;&#x7684;&#x8001;&#x677F;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x8001;&#x677F;&#x4E0D;&#x5982;&#x4F60;&#xFF0C;&#x4F46;&#x662F;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#xFF0C;&#x4ED6;&#x7684;&#x63A8;&#x7406;&#x8303;&#x56F4;&#x53EF;&#x80FD;&#x8FD8;&#x662F;&#x8FDC;&#x8FDC;&#x8986;&#x76D6;&#x4F60;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5BF9;&#x4E8B;&#x60C5;&#x7684;&#x5224;&#x65AD;&#x80FD;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D;&#x8981;&#x8FC7;&#x4E8E;&#x81EA;&#x5927;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x6709;&#x53E5;&#x8BDD;&#x8BF4;&#xFF1A;&#x8DDF;&#x5BF9;&#x4E00;&#x4E2A;&#x597D;&#x8001;&#x677F;&#x662F;&#x4F60;&#x4E00;&#x751F;&#x7684;&#x798F;&#x62A5;&#xFF0C;&#x7684;&#x786E;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4EE5;&#x6211;&#x76EE;&#x524D;&#x7684;&#x89C2;&#x5BDF;&#xFF0C;&#x516C;&#x53F8;&#x76EE;&#x524D;&#x90A3;&#x4E9B;&#x540D;&#x8001;&#x677F;&#x90FD;&#x662F;&#x90A3;&#x79CD;&#x60C5;&#x5546;&#x5F88;&#x9AD8;&#x4F46;&#x662F;&#x5185;&#x5FC3;&#x771F;&#x6B63;&#x7B80;&#x5355;&#x900F;&#x660E;&#x7684;&#x4EBA;&#xFF0C;&#x804C;&#x573A;&#x7684;&#x6743;&#x672F;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x4EC5;&#x4EC5;&#x9760;&#x6743;&#x672F;&#x5F88;&#x96BE;&#x771F;&#x6B63;&#x83B7;&#x5F97;&#x957F;&#x4E45;&#x7684;&#x6210;&#x529F;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x521A;&#x624D;&#x5B66;&#x4E60;&#x6BD5;&#x4E1A;&#x7684;&#x4EBA;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x725B;&#x903C;&#x5927;&#x5496;&#x52A0;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x524D;&#x671F;&#x6240;&#x6709;&#x7684;&#x7CBE;&#x529B;&#x90FD;&#x5E94;&#x8BE5;&#x653E;&#x5230;&#x5177;&#x4F53;&#x7684;&#x5C0F;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x505A;&#x597D;&#x4EE5;&#x4E8B;&#x670D;&#x4EBA;&#xFF0C;&#x540E;&#x9762;&#x518D;&#x4EE5;&#x5FB7;&#x670D;&#x4EBA;&#x6211;&#x89C9;&#x5F97;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x6210;&#x957F;&#x601D;&#x8DEF;&#x3002;</p>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/08/30/apache-包使用/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption"><</strong>
      <div class="article-nav-title">
        
          apache 包使用
        
      </div>
    </a>
  
  
    <a href="/2016/04/13/Mysql5-7新特性之json与虚拟索引列/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">Mysql5.7新特性之json与虚拟索引列</div>
      <strong class="article-nav-caption">></strong>
    </a>
  
</nav>

  
</article>


<div class="share_jia">
	<!-- JiaThis Button BEGIN -->
	<div class="jiathis_style">
		<span class="jiathis_txt">分享到: &nbsp; </span>
		<a class="jiathis_button_facebook"></a> 
    <a class="jiathis_button_twitter"></a>
    <a class="jiathis_button_plus"></a> 
    <a class="jiathis_button_tsina"></a>
		<a class="jiathis_button_cqq"></a>
		<a class="jiathis_button_douban"></a>
		<a class="jiathis_button_weixin"></a>
		<a class="jiathis_button_tumblr"></a>
    <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	</div>
	<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js?uid=1405949716054953" charset="utf-8"></script>
	<!-- JiaThis Button END -->
</div>




<div class="share_addthis">
  <div class="sharing addthis_toolbox share">
    <a class="addthis_button_facebook_like"></a>
    <a class="addthis_button_tweet"></a>
    <a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
    <a class="addthis_counter addthis_pill_style"></a>
  </div>
  <script type="text/javascript" src="//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-560c64c35486b3d4" async="async"></script>
</div>




<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="7年老人谈些新人成长经验" data-title="7年老人谈些新人成长经验" data-url="http://leeboyue.com/2016/05/05/7年老人谈些新人成长经验/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"true"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>




</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2016 Bear Lee
    	</div>
    </div>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');
  
  _st('install','cUsTwKigHaG9pw5Grcxd','2.0.0');
</script>

  </div>
</footer>
    </div>
    
  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css" type="text/css">


<script>
	var yiliaConfig = {
		fancybox: true,
		mathjax: true,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false
	}
</script>
<script src="http://7.url.cn/edu/jslib/comb/require-2.1.6,jquery-1.9.1.min.js" type="text/javascript"></script>
<script src="/js/main.js" type="text/javascript"></script>






<script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
    }
});

MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';                 
    }       
});
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>



<div id="totop" style="position:fixed;bottom:150px;right:50px;cursor: pointer;">
<a title="返回顶部"><img src="/img/scrollup.png"/></a>
</div>
<script src="/js/totop.js"></script>

  </div>

<!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for(i=0; i < all.length; i += 1) {
            all[i].SourceElement().parentNode.className += ' has-jax';
        }
    });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
</body>
</html>